{"resourceType":"ValueSet","id":"v2-0506","meta":{"profile":["http://hl7.org/fhir/StructureDefinition/shareablevalueset"]},"language":"en","text":{"status":"additional","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n            <p>Service Request Relationship</p>\n\n            <table class=\"grid\">\n              <tr>\n                <td>\n                  <b>Code</b>\n                </td>\n                <td>\n                  <b>Description</b>\n                </td>\n                <td>\n                  <b>Comment</b>\n                </td>\n                <td>\n                  <b>Version</b>\n                </td>\n              </tr>\n              <tr>\n                <td>C\n                  <a name=\"C\"> </a>\n                </td>\n                <td>Compound</td>\n                <td>A compound is an extempo order which may be made up of multiple drugs.  For example, many hospitals have a standard item called &quot;Magic Mouthwash&quot;.  The item is ordered that way by the physician. The extempo items will contain multiple products, such as Maalox, Benadryl, Xylocaine, etc.  They will all be mixed together and will be dispensed in a single container.</td>\n                <td>added v2.5</td>\n              </tr>\n              <tr>\n                <td>E\n                  <a name=\"E\"> </a>\n                </td>\n                <td>Exclusive</td>\n                <td>An exclusive order is an order where only one of the multiple items should be administered at any one dosage time.  The nurse may chose between the alternatives, but should only give ONE of them.  An example would be: Phenergan 25 mg PO, IM or R q6h prn (orally, intramuscularly, or rectally every 6 hours as needed).</td>\n                <td>added v2.5</td>\n              </tr>\n              <tr>\n                <td>N\n                  <a name=\"N\"> </a>\n                </td>\n                <td>Nurse prerogative</td>\n                <td>Where a set of two or more orders exist and the Nurse, or other caregiver, has the prerogative to choose which order will be administered at a particular point in time.  For example,\n\tMilk of Magnesia PO 30 ml qhs (at bedtime)\n\tDulcolax Supp R @ hs prn\n\tColace 100 mg capsule PO bid \nThe nurse would be administering MOM, but may add the Colace and may also give the Dulcolax Supp as needed to promote and maintain regularity.</td>\n                <td>added v2.5</td>\n              </tr>\n              <tr>\n                <td>S\n                  <a name=\"S\"> </a>\n                </td>\n                <td>Simultaneous</td>\n                <td>A simultaneous order is 2 or more drugs which are ordered to be given at the same time.  A common example of this would be Demerol and Phenergan (Phenergan is given with the Demerol to control the nausea that Demerol can cause).  The order could be: Demerol 50 mg IM with Phenergan 25 mg IM q4h prn (every 4 hours as needed).</td>\n                <td>added v2.5</td>\n              </tr>\n              <tr>\n                <td>T\n                  <a name=\"T\"> </a>\n                </td>\n                <td>Tapering</td>\n                <td>A tapering order is one in which the same drug is used, but it has a declining dosage over a number of days.\nFor example, Decadron 0.5 mg is often ordered this way.  The order would look like this:\n\tDecadron 0.5 mg qid (four times a day) for 2 days, then\n\tDecadron 0.5 mg tid (three times a day) for 2 days, then\n\tDecadron 0.5 mg bid (twice a day) for 2 days, then\n\tDecadron 0.5 mg qd (daily) for 2 days, then stop.</td>\n                <td>added v2.5</td>\n              </tr>\n            </table>\n\n          </div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"external"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://terminology.hl7.org/ValueSet/v2-0506","version":"2.9","name":"v2.0506","title":"v2 Service Request Relationship","status":"active","experimental":false,"publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":"FHIR Value set/code system definition for HL7 v2 table 0506 ( Service Request Relationship)","immutable":true,"compose":{"include":[{"system":"http://terminology.hl7.org/CodeSystem/v2-0506"}]}}