{"resourceType":"CodeSystem","id":"standards-status","meta":{"lastUpdated":"2019-11-01T09:29:23.356+11:00"},"url":"http://terminology.hl7.org/CodeSystem/standards-status","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.4.642.4.1366"}],"version":"4.0.1","name":"StandardsStatus","title":"StandardsStatus","status":"draft","experimental":false,"date":"2019-11-01T09:29:23+11:00","publisher":"HL7 (FHIR Project)","contact":[{"telecom":[{"system":"url","value":"http://hl7.org/fhir"},{"system":"email","value":"fhir@lists.hl7.org"}]}],"description":"HL7 Ballot/Standards status of artifact.","caseSensitive":true,"valueSet":"http://hl7.org/fhir/ValueSet/standards-status","content":"complete","concept":[{"code":"draft","display":"Draft","definition":"This portion of the specification is not considered to be complete enough or sufficiently reviewed to be safe for implementation. It may have known issues or still be in the \"in development\" stage. It is included in the publication as a place-holder, to solicit feedback from the implementation community and/or to give implementers some insight as to functionality likely to be included in future versions of the specification. Content at this level should only be implemented by the brave or desperate and is very much \"use at your own risk\". The content that is Draft that will usually be elevated to Trial Use once review and correction is complete after it has been subjected to ballot."},{"code":"normative","display":"Normative","definition":"This content has been subject to review and production implementation in a wide variety of environments. The content is considered to be stable and has been 'locked', subjecting it to FHIR Inter-version Compatibility Rules. While changes are possible, they are expected to be infrequent and are tightly constrained. Compatibility Rules."},{"code":"trial-use","display":"Trial-Use","definition":"This content has been well reviewed and is considered by the authors to be ready for use in production systems. It has been subjected to ballot and approved as an official standard. However, it has not yet seen widespread use in production across the full spectrum of environments it is intended to be used in. In some cases, there may be documented known issues that require implementation experience to determine appropriate resolutions for.\n\nFuture versions of FHIR may make significant changes to Trial Use content that are not compatible with previously published content."},{"code":"informative","display":"Informative","definition":"This portion of the specification is provided for implementer assistance, and does not make rules that implementers are required to follow. Typical examples of this content in the FHIR specification are tables of contents, registries, examples, and implementer advice."},{"code":"deprecated","display":"Deprecated","definition":"This portion of the specification is provided for implementer assistance, and does not make rules that implementers are required to follow. Typical examples of this content in the FHIR specification are tables of contents, registries, examples, and implementer advice."},{"code":"external","display":"External","definition":"This is content that is managed outside the FHIR Specification, but included for implementer convenience."}]}