{"resourceType":"CodeSystem","id":"v2-0906","meta":{"profile":["http://hl7.org/fhir/StructureDefinition/shareablecodesystem"]},"language":"en","extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"external"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://terminology.hl7.org/CodeSystem/v2-0906","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.18.417"}],"version":"2.9","name":"v2.0906","title":"v2 ActPriority","status":"active","experimental":false,"publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":"FHIR Value set/code system definition for HL7 v2 table 0906 ( ActPriority)","content":"complete","concept":[{"code":"A","display":"ASAP - As soon as possible, next highest priority after stat"},{"code":"CR","display":"Callback results - filler should contact the placer as soon as results are available, even for preliminary results"},{"code":"CS","display":"Callback for scheduling - Filler should contact the placer (or target) to schedule the service."},{"code":"CSP","display":"Callback placer for scheduling - filler should contact the placer to schedule the service"},{"code":"CSR","display":"Contact recipient for scheduling - Filler should contact the service recipient (target) to schedule the service"},{"code":"EL","display":"Elective - Beneficial to the patient but not essential for survival."},{"code":"EM","display":"Emergency - An unforeseen combination of circumstances or the resulting state that calls for immediate action"},{"code":"P","display":"Preop - Used to indicate that a service is to be performed prior to a scheduled surgery.  When ordering a service and using the pre-op priority, a check is done to see the amount of time that must be allowed for performance of the service.  When the order"},{"code":"PRN","display":"As needed - An \"as needed\" order should be accompanied by a description of what constitutes a need.  This description is represented by an observation service predicate as a precondition."},{"code":"R","display":"Routine - Routine service, do at usual work hours"},{"code":"RR","display":"Rush reporting - A report should be prepared and sent as quickly as possible"},{"code":"S","display":"Stat - With highest priority (e.g. emergency)."},{"code":"T","display":"Timing critical - It is critical to come as close as possible to the requested time (e.g. for a through antimicrobial level)."},{"code":"UD","display":"Use as directed - Drug is to be used as directed by the prescriber."},{"code":"UR","display":"Urgent - Calls for prompt action"}]}