{"resourceType":"CodeSystem","id":"extra-security-role-type","meta":{"lastUpdated":"2019-11-01T09:29:23.356+11:00","profile":["http://hl7.org/fhir/StructureDefinition/shareablecodesystem"]},"url":"http://terminology.hl7.org/CodeSystem/extra-security-role-type","version":"4.0.1","name":"SecurityRoleType","status":"draft","experimental":true,"date":"2017-02-13","publisher":"HL7 International","contact":[{"name":"FHIR project team","telecom":[{"system":"url","value":"http://hl7.org/fhir"}]}],"description":"This CodeSystem contains Additional FHIR-defined Security Role types not defined elsewhere","caseSensitive":true,"content":"complete","concept":[{"code":"authserver","display":"authorization server","definition":"An entity providing authorization services to enable the electronic sharing of health-related information based on resource owner's preapproved permissions. For example, an UMA Authorization Server[UMA]"},{"code":"datacollector","display":"data collector","definition":"An entity that collects information over which the data subject may have certain rights under policy or law to control that information's management and distribution by data collectors, including the right to access, retrieve, distribute, or delete that information. "},{"code":"dataprocessor","display":"data processor","definition":"An entity that processes collected information over which the data subject may have certain rights under policy or law to control that information's management and distribution by data processors, including the right to access, retrieve, distribute, or delete that information."},{"code":"datasubject","display":"data subject","definition":"A person whose personal information is collected or processed, and who may have certain rights under policy or law to control that information's management and distribution by data collectors or processors, including the right to access, retrieve, distribute, or delete that information."},{"code":"humanuser","display":"human user","definition":"The human user that has participated."}]}