{"resourceType":"CodeSystem","id":"v3-HL7StandardVersionCode","meta":{"lastUpdated":"2018-08-12T00:00:00.000+10:00"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"external"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://terminology.hl7.org/CodeSystem/v3-HL7StandardVersionCode","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.5.1097"}],"version":"2018-08-12","name":"v3.HL7StandardVersionCode","title":"v3 Code System HL7StandardVersionCode","status":"active","experimental":false,"date":"2018-08-12T00:00:00+10:00","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":" This code system holds version codes for the Version 3 standards. Values are to be determined by HL7 and added with each new version of the HL7 Standard.","caseSensitive":true,"valueSet":"http://terminology.hl7.org/ValueSet/v3-HL7StandardVersionCode","hierarchyMeaning":"is-a","content":"complete","property":[{"code":"status","uri":"http://hl7.org/fhir/concept-properties#status","description":"A property that indicates the status of the concept. One of active, experimental, deprecated, retired","type":"code"}],"concept":[{"code":"Ballot2008Jan","display":"Ballot 2008 January","definition":"The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in January 2008."},{"code":"Ballot2008May","display":"Ballot 2008 May","definition":"The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in May 2008."},{"code":"Ballot2008Sep","display":"Ballot 2008 September","definition":"The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in September 2008."},{"code":"Ballot2009Jan","display":"Ballot 2009 January","definition":"The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in January 2009."},{"code":"Ballot2009May","display":"Ballot 2009 May","definition":"The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in May 2009."},{"code":"Ballot2009Sep","display":"Ballot 2009 September","definition":"The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in September 2009."},{"code":"Ballot2010Jan","display":"Ballot 2010 Jan","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in January 2010."},{"code":"Ballot2010May","display":"Ballot 2010 May","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in May 2010."},{"code":"Ballot2010Sep","display":"Ballot 2010 Sep","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in September 2010."},{"code":"Ballot2011Jan","display":"Ballot 2011 Jan","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in January 2011."},{"code":"Ballot2011May","display":"Ballot 2011 May","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in May 2011."},{"code":"Ballot2011Sep","display":"Ballot 2011 Sep","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in September 2011."},{"code":"Ballot2012Jan","display":"Ballot 2012 Jan","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in January 2012."},{"code":"Ballot2012May","display":"Ballot 2012 May","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in May 2012."},{"code":"Ballot2012Sep","display":"Ballot 2012 Sep","definition":"Definition: The complete set of normative, DSTU, proposed (under ballot) and draft artifacts as published in the ballot whose ballot cycle ended in September 2012."},{"code":"V3-2003-12","display":"HL7 Version V3-2003-12","definition":"The consistent set of messaging artefacts as published or contained in repositories in December of 2003, based on the latest version of any V3 models or artefacts (RIM, Datatypes, CMETS, Common Messages, Vocabularies) as available in December of 2003. Note: This versioncode does not cover the version of the XML ITS."},{"code":"V3-2005N","display":"2005 Normative Edition","definition":"Description:The consistent set of normative and DSTU messaging artifacts as published or contained in repositories in December of 2004, based on the latest version of any V3 models or artifacts (RIM, Datatypes, CMETS, Common Messages, Vocabularies) as published under the title of Normative Edition 2005. Note: This versioncode does not cover the version of the XML ITS."},{"code":"V3-2006N","display":"2006 Normative Edition","definition":"Description:The consistent set of normative and DSTU messaging artifacts as published or contained in repositories in December of 2005, based on the latest version of any V3 models or artifacts (RIM, Datatypes, CMETS, Common Messages, Vocabularies) as published under the title of Normative Edition 2006. Note: This versioncode does not cover the version of the XML ITS."},{"code":"V3-2008N","display":"2008 Normative Edition","definition":"Definition: The consistent set of normative and DSTU messaging artifacts as published or contained in repositories in December of 2007, based on the latest version of any V3 models or artifacts (RIM, Data Types, CMETS, Common Messages, Vocabularies) published under the title of Normative Edition 2008. Note: This version code does not cover the version of the XML ITS."},{"code":"V3-2009N","display":"2009 Normative Edition","definition":"Description: The consistent set of normative and DSTU messaging artifacts as published or contained in repositories in December of 2008, based on the latest version of any V3 models or artifacts (RIM, Data Types, CMETS, Common Messages, Vocabularies) published under the title of Normative Edition 2009. Note: This version code does not cover the version of the XML ITS."},{"code":"V3-2010N","display":"2010 Normative Edition","definition":"Definition: The consistent set of normative and DSTU messaging artifacts as published or contained in repositories in December of 2009, based on the latest version of any V3 models or artifacts (RIM, Data Types, CMETS, Common Messages, Vocabularies) published under the title of Normative Edition 2010. Note: This version code does not cover the version of the XML ITS."},{"code":"V3-2011N","display":"2011 Normative Edition","definition":"Definition: The consistent set of normative and DSTU messaging artifacts as published or contained in repositories in December of 2010, based on the latest version of any V3 models or artifacts (RIM, Data Types, CMETS, Common Messages, Vocabularies) published under the title of Normative Edition 2011. Note: This version code does not cover the version of the XML ITS."},{"code":"V3-2012N","display":"2012 Normative Edition","definition":"Definition: The consistent set of normative and DSTU messaging artifacts as published or contained in repositories in December of 2011, based on the latest version of any V3 models or artifacts (RIM, Data Types, CMETS, Common Messages, Vocabularies) published under the title of Normative Edition 2012. Note: This version code does not cover the version of the XML ITS."},{"code":"V3PR1","display":"Version3 Pre-release #1","definition":"Includes all material published as part of the ballot package released for vote in July-August 2003."},{"code":"V3-2007N","display":"2007 Normative Edition","definition":"Description:The consistent set of normative and DSTU messaging artifacts as published or contained in repositories in December of 2006, based on the latest version of any V3 models or artifacts (RIM, Datatypes, CMETS, Common Messages, Vocabularies) published under the title of Normative Edition 2007. Note: This versioncode does not cover the version of the XML ITS.","property":[{"code":"status","valueCode":"retired"}]}]}