{"resourceType":"CodeSystem","id":"v3-NullFlavor","meta":{"lastUpdated":"2018-08-12T00:00:00.000+10:00"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"normative"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":5},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-wg","valueCode":"pa"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-normative-version","valueCode":"4.0.0"}],"url":"http://terminology.hl7.org/CodeSystem/v3-NullFlavor","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.5.1008"}],"version":"2018-08-12","name":"v3.NullFlavor","title":"v3 Code System NullFlavor","status":"active","experimental":false,"date":"2018-08-12T00:00:00+10:00","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":" A collection of codes specifying why a valid value is not present.","caseSensitive":true,"valueSet":"http://terminology.hl7.org/ValueSet/v3-NullFlavor","hierarchyMeaning":"is-a","content":"complete","property":[{"code":"child","uri":"http://hl7.org/fhir/concept-properties#child","description":"The concept identified in this property is a child of the concept on which it is a property. The property type will be 'code'. The meaning of parent/child relationships is defined by the hierarchyMeaning attribute","type":"code"},{"code":"status","uri":"http://hl7.org/fhir/concept-properties#status","description":"A property that indicates the status of the concept. One of active, experimental, deprecated, retired","type":"code"}],"concept":[{"code":"NI","display":"NoInformation","definition":"Description:The value is exceptional (missing, omitted, incomplete, improper). No information as to the reason for being an exceptional value is provided. This is the most general exceptional value. It is also the default exceptional value.","concept":[{"code":"INV","display":"invalid","definition":"Description:The value as represented in the instance is not a member of the set of permitted data values in the constrained value domain of a variable.","concept":[{"code":"DER","display":"derived","definition":"Description:An actual value may exist, but it must be derived from the provided information (usually an EXPR generic data type extension will be used to convey the derivation expressionexpression ."},{"code":"OTH","display":"other","definition":"Description:The actual value is not a member of the set of permitted data values in the constrained value domain of a variable. (e.g., concept not provided by required code system).\r\n\n                        \n                           Usage Notes: This flavor and its specializations are most commonly used with the CD datatype and its flavors.  However, it may apply to *any* datatype where the constraints of the type are tighter than can be conveyed.  For example, a PQ that is for a true measured amount whose units are not supported in UCUM, a need to convey a REAL when the type has been constrained to INT, etc.\r\n\n                        With coded datatypes, this null flavor may only be used if the vocabulary binding has a coding strength of CNE.  By definition, all local codes and original text are part of the value set if the coding strength is CWE.","concept":[{"code":"NINF","display":"negative infinity","definition":"Negative infinity of numbers."},{"code":"PINF","display":"positive infinity","definition":"Positive infinity of numbers."}]},{"code":"UNC","display":"un-encoded","definition":"Description: The actual value has not yet been encoded within the approved value domain.\r\n\n                        \n                           Example: Original text or a local code has been specified but translation or encoding to the approved value set has not yet occurred due to limitations of the sending system.  Original text has been captured for a PQ, but not attempt has been made to split the value and unit or to encode the unit in UCUM.\r\n\n                        \n                           Usage Notes: If it is known that it is not possible to encode the concept, OTH should be used instead.  However, use of UNC does not necessarily guarantee the concept will be encodable, only that encoding has not been attempted.\r\n\n                        Data type properties such as original text and translations may be present when this null flavor is included."}]},{"code":"MSK","display":"masked","definition":"There is information on this item available but it has not been provided by the sender due to security, privacy or other reasons. There may be an alternate mechanism for gaining access to this information.\r\n\n                        Note: using this null flavor does provide information that may be a breach of confidentiality, even though no detail data is provided.  Its primary purpose is for those circumstances where it is necessary to inform the receiver that the information does exist without providing any detail."},{"code":"NA","display":"not applicable","definition":"Known to have no proper value (e.g., last menstrual period for a male)."},{"code":"UNK","display":"unknown","definition":"Description:A proper value is applicable, but not known.\r\n\n                        \n                           Usage Notes: This means the actual value is not known.  If the only thing that is unknown is how to properly express the value in the necessary constraints (value set, datatype, etc.), then the OTH or UNC flavor should be used.  No properties should be included for a datatype with this property unless:\r\n\n                        \n                           Those properties themselves directly translate to a semantic of \"unknown\".  (E.g. a local code sent as a translation that conveys 'unknown')\n                           Those properties further qualify the nature of what is unknown.  (E.g. specifying a use code of \"H\" and a URL prefix of \"tel:\" to convey that it is the home phone number that is unknown.)","concept":[{"code":"ASKU","display":"asked but unknown","definition":"Information was sought but not found (e.g., patient was asked but didn't know)","concept":[{"code":"NAV","display":"temporarily unavailable","definition":"Information is not available at this time but it is expected that it will be available later."}]},{"code":"NASK","display":"not asked","definition":"This information has not been sought (e.g., patient was not asked)"},{"code":"NAVU","display":"Not available","definition":"Information is not available at this time (with no expectation regarding whether it will or will not be available in the future).","property":[{"code":"child","valueCode":"NAV"}]},{"code":"QS","display":"Sufficient Quantity","definition":"Description:The specific quantity is not known, but is known to be non-zero and is not specified because it makes up the bulk of the material. e.g. 'Add 10mg of ingredient X, 50mg of ingredient Y, and sufficient quantity of water to 100mL.' The null flavor would be used to express the quantity of water."},{"code":"TRC","display":"trace","definition":"The content is greater than zero, but too small to be quantified."}]}]},{"code":"NP","display":"not present","definition":"Value is not present in a message.  This is only defined in messages, never in application data!  All values not present in the message must be replaced by the applicable default, or no-information (NI) as the default of all defaults.","property":[{"code":"status","valueCode":"retired"}]}]}