{"resourceType":"CodeSystem","id":"tldc","meta":{"lastUpdated":"2019-11-01T09:29:23.356+11:00"},"url":"urn:oid:2.16.840.1.113883.3.1937.98.5.8","name":"TemplateStatusCodeLifeCycle","title":"TemplateStatusCode LifeCycle","status":"active","experimental":false,"date":"2013-12-05","publisher":"Art-Decor","description":"Life cycle of the Status Code of a Template Design (Version)","caseSensitive":true,"valueSet":"urn:oid:2.16.840.1.113883.3.1937.98.11.8","content":"complete","concept":[{"code":"draft","display":"Draft","definition":"Design is under development (nascent)."},{"code":"pending","display":"Under pre-publication review","definition":"Design is completed and is being reviewed."},{"code":"active","display":"active","definition":"Design has been deemed fit for the intended purpose and is published by the governance group."},{"code":"review","display":"In Review","definition":"Design is active, but is under review. The review may result in a change to the design. The change may necessitate a new version to be created. This in turn may result in the prior version of the template to be retired. Alternatively, the review may result in a change to the design that does not require a new version to be created, or it may result in no change to the design at all."},{"code":"cancelled","display":"Cancelled","definition":"A drafted design is determined to be erroneous or not fit for intended purpose and is discontinued before ever being published in an active state."},{"code":"rejected","display":"Rejected","definition":"A previously drafted design is determined to be erroneous or not fit for intended purpose and is discontinued before ever being published for consideration in a pending state."},{"code":"retired","display":"retired","definition":"A previously active design is discontinued from use. It should no longer be used for future designs, but for historical purposes may be used to process data previously recorded using this design. A newer design may or may not exist. The design is published in the retired state."},{"code":"terminated","display":"Terminated","definition":"A design is determined to be erroneous or not fit for the intended purpose and should no longer be used, even for historical purposes. No new designs can be developed for this template. The associated template no longer needs to be published, but if published, is shown in the terminated state."}]}