{"resourceType":"CodeSystem","id":"questionnaire-item-control","meta":{"lastUpdated":"2019-11-01T09:29:23.356+11:00","profile":["http://hl7.org/fhir/StructureDefinition/shareablecodesystem"]},"url":"http://hl7.org/fhir/questionnaire-item-control","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.4.642.4.932"}],"version":"4.0.1","name":"QuestionnaireItemUIControlCodes","title":"Questionnaire Item UI Control Codes","status":"draft","experimental":false,"publisher":"HL7 International - Patient Care WG","contact":[{"telecom":[{"system":"url","value":"http://www.hl7.org/Special/committees/patientcare"}]}],"description":"Starter set of user interface control/display mechanisms that might be used when rendering an item in a questionnaire.","caseSensitive":true,"valueSet":"http://hl7.org/fhir/ValueSet/questionnaire-item-control","hierarchyMeaning":"is-a","content":"complete","property":[{"code":"abstract","description":"True if an element is considered 'abstract' - that is the code is not for use as a real concept","type":"boolean"}],"concept":[{"code":"group","definition":"UI controls relevant to organizing groups of questions","property":[{"code":"abstract","valueBoolean":true}],"concept":[{"code":"list","display":"List","definition":"Questions within the group should be listed sequentially"},{"code":"table","display":"Vertical Answer Table","definition":"Questions within the group are rows in the table with possible answers as columns.  Used for 'choice' questions."},{"code":"htable","display":"Horizontal Answer Table","definition":"Questions within the group are columns in the table with possible answers as rows.  Used for 'choice' questions."},{"code":"gtable","display":"Group Table","definition":"Questions within the group are columns in the table with each group repetition as a row.  Used for single-answer questions."},{"code":"atable","display":"Answer Table","definition":"This table has one row - for the question.  Permitted answers are columns.  Used for choice questions."},{"code":"header","display":"Header","definition":"The group is to be continuously visible at the top of the questionnaire"},{"code":"footer","display":"Footer","definition":"The group is to be continuously visible at the bottom of the questionnaire"}]},{"code":"text","definition":"UI controls relevant to rendering questionnaire text items","property":[{"code":"abstract","valueBoolean":true}],"concept":[{"code":"inline","display":"In-line","definition":"Text is displayed as a paragraph in a sequential position between sibling items (default behavior)"},{"code":"prompt","display":"Prompt","definition":"Text is displayed immediately below or within the answer-entry area of the containing question item (typically as a guide for what to enter)"},{"code":"unit","display":"Unit","definition":"Text is displayed adjacent (horizontally or vertically) to the answer space for the parent question, typically to indicate a unit of measure"},{"code":"lower","display":"Lower-bound","definition":"Text is displayed to the left of the set of answer choices or a scaling control for the parent question item to indicate the meaning of the 'lower' bound.  E.g. 'Strongly disagree'"},{"code":"upper","display":"Upper-bound","definition":"Text is displayed to the right of the set of answer choices or a scaling control for the parent question item to indicate the meaning of the 'upper' bound.  E.g. 'Strongly agree'"},{"code":"flyover","display":"Fly-over","definition":"Text is temporarily visible over top of an item if the mouse is positioned over top of the text for the containing item"},{"code":"help","display":"Help-Button","definition":"Text is displayed in a dialog box or similar control if invoked by pushing a button or some other UI-appropriate action to request 'help' for a question, group or the questionnaire as a whole (depending what the text is nested within)"}]},{"code":"question","definition":"UI controls relevant to capturing question data","property":[{"code":"abstract","valueBoolean":true}],"concept":[{"code":"autocomplete","display":"Auto-complete","definition":"A control which provides a list of potential matches based on text entered into a control.  Used for large choice sets where text-matching is an appropriate discovery mechanism."},{"code":"drop-down","display":"Drop down","definition":"A control where an item (or multiple items) can be selected from a list that is only displayed when the user is editing the field."},{"code":"check-box","display":"Check-box","definition":"A control where choices are listed with a box beside them.  The box can be toggled to select or de-select a given choice.  Multiple selections may be possible."},{"code":"lookup","display":"Lookup","definition":"A control where editing an item spawns a separate dialog box or screen permitting a user to navigate, filter or otherwise discover an appropriate match.  Useful for large choice sets where text matching is not an appropriate discovery mechanism.  Such screens must generally be tuned for the specific choice list structure."},{"code":"radio-button","display":"Radio Button","definition":"A control where choices are listed with a button beside them.  The button can be toggled to select or de-select a given choice.  Selecting one item deselects all others."},{"code":"slider","display":"Slider","definition":"A control where an axis is displayed between the high and low values and the control can be visually manipulated to select a value anywhere on the axis."},{"code":"spinner","display":"Spinner","definition":"A control where a list of numeric or other ordered values can be scrolled through via arrows."},{"code":"text-box","display":"Text Box","definition":"A control where a user can type in their answer freely."}]}]}