{"resourceType":"CodeSystem","id":"v3-hl7CMETAttribution","meta":{"lastUpdated":"2018-08-12T00:00:00.000+10:00"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"external"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://terminology.hl7.org/CodeSystem/v3-hl7CMETAttribution","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.5.1132"}],"version":"2018-08-12","name":"v3.hl7CMETAttribution","title":"v3 Code System hl7CMETAttribution","status":"active","experimental":false,"date":"2018-08-12T00:00:00+10:00","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":"**** MISSING DEFINITIONS ****","caseSensitive":true,"valueSet":"http://terminology.hl7.org/ValueSet/v3-hl7CMETAttribution","hierarchyMeaning":"is-a","content":"complete","concept":[{"code":"contact","display":"contact","definition":"Description: Provides sufficient information to allow the object identified to be contacted. This is likely to have the content of identified and confirmable plus telephone number."},{"code":"identified","display":"identified","definition":"Description: This variant is a proper subset of universal and is intended to provide sufficient information to identify the object(s) modeled by the CMET. This variant is only suitable for use within TIGHTLY COUPLED SYSTEMS ONLY. This variant provides ONLY the ID (and code where applicable) and Name. Other variants may not be substituted at runtime."},{"code":"identified-confirmable","display":"identified-confirmable","definition":"Description: This extends the identified variant by adding just sufficient additional information to allow the identity of object modeled to be confirmed by a number of corroborating items of data; for instance a patient's date of birth and current address. However, specific contact information, such as telephone number, are not viewed as confirming information."},{"code":"identified-informational","display":"identified-informational","definition":"Description: Generally the same information content as \"contactable\" but using new \"informational\" CMETs as dependant CMETs. This flavor allows expression of the CMET when non-focal class information is not known."},{"code":"informational","display":"informational","definition":"Description: Generally the same information content as \"contactable\", but with required (not mandatory) ids on entry point class. This flavor allows expression of the CMET even when mandatory information is not known."},{"code":"minimal","display":"minimal","definition":"Description: Provides more than identified, but not as much as universal. There are not expected to be many of these."},{"code":"universal","display":"universal","definition":"Description: This variant includes all attributes and associations present in the R-MIM. Any of non-mandatory and non-required attributes and/or associations may be present or absent, as permitted in the cardinality constraints."}]}