{"resourceType":"CodeSystem","id":"v3-AddressUse","meta":{"lastUpdated":"2018-08-12T00:00:00.000+10:00"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"external"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://terminology.hl7.org/CodeSystem/v3-AddressUse","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.5.1119"}],"version":"2018-08-12","name":"v3.AddressUse","title":"v3 Code System AddressUse","status":"active","experimental":false,"date":"2018-08-12T00:00:00+10:00","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":" Codes that provide guidance around the circumstances in which a given address should be used.","caseSensitive":true,"valueSet":"http://terminology.hl7.org/ValueSet/v3-AddressUse","hierarchyMeaning":"is-a","content":"complete","property":[{"code":"notSelectable","uri":"http://hl7.org/fhir/concept-properties#notSelectable","description":"Indicates that the code is abstract - only intended to be used as a selector for other concepts","type":"boolean"}],"concept":[{"code":"_GeneralAddressUse","display":"_GeneralAddressUse","definition":"Description: Address uses that can apply to both postal and telecommunication addresses.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"BAD","display":"bad address","definition":"Description: A flag indicating that the address is bad, in fact, useless."},{"code":"CONF","display":"confidential address","definition":"Description: Indicates that the address is considered sensitive and should only be shared or published in accordance with organizational controls governing patient demographic information with increased sensitivity. Uses of Addresses.   Lloyd to supply more complete description."},{"code":"H","display":"home address","definition":"Description: A communication address at a home, attempted contacts for business purposes might intrude privacy and chances are one will contact family or other household members instead of the person one wishes to call. Typically used with urgent cases, or if no other contacts are available.","concept":[{"code":"HP","display":"primary home","definition":"Description: The primary home, to reach a person after business hours."},{"code":"HV","display":"vacation home","definition":"Description: A vacation home, to reach a person while on vacation."}]},{"code":"OLD","display":"no longer in use","definition":"This address is no longer in use.\r\n\n                        \n                           Usage Note: Address may also carry valid time ranges. This code is used to cover the situations where it is known that the address is no longer valid, but no particular time range for its use is known."},{"code":"TMP","display":"temporary address","definition":"Description: A temporary address, may be good for visit or mailing. Note that an address history can provide more detailed information."},{"code":"WP","display":"work place","definition":"Description: An office address. First choice for business related contacts during business hours.","concept":[{"code":"DIR","display":"direct","definition":"Description: Indicates a work place address or telecommunication address that reaches the individual or organization directly without intermediaries. For phones, often referred to as a 'private line'."},{"code":"PUB","display":"public","definition":"Description: Indicates a work place address or telecommunication address that is a 'standard' address which may reach a reception service, mail-room, or other intermediary prior to the target entity."}]}]},{"code":"_PostalAddressUse","display":"_PostalAddressUse","definition":"Description: Address uses that only apply to postal addresses, not telecommunication addresses.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"PHYS","display":"physical visit address","definition":"Description: Used primarily to visit an address."},{"code":"PST","display":"postal address","definition":"Description: Used to send mail."}]},{"code":"_TelecommunicationAddressUse","display":"_TelecommunicationAddressUse","definition":"Description: Address uses that only apply to telecommunication addresses, not postal addresses.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"AS","display":"answering service","definition":"Description: An automated answering machine used for less urgent cases and if the main purpose of contact is to leave a message or access an automated announcement."},{"code":"EC","display":"emergency contact","definition":"Description: A contact specifically designated to be used for emergencies. This is the first choice in emergencies, independent of any other use codes."},{"code":"MC","display":"mobile contact)","definition":"Description: A telecommunication device that moves and stays with its owner. May have characteristics of all other use codes, suitable for urgent matters, not the first choice for routine business."},{"code":"PG","display":"pager","definition":"Description: A paging device suitable to solicit a callback or to leave a very short message."}]}]}