{"resourceType":"CodeSystem","id":"v3-RoleLinkType","meta":{"lastUpdated":"2018-08-12T00:00:00.000+10:00"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"external"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://terminology.hl7.org/CodeSystem/v3-RoleLinkType","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.5.107"}],"version":"2018-08-12","name":"v3.RoleLinkType","title":"v3 Code System RoleLinkType","status":"active","experimental":false,"date":"2018-08-12T00:00:00+10:00","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":"**** MISSING DEFINITIONS ****","caseSensitive":true,"valueSet":"http://terminology.hl7.org/ValueSet/v3-RoleLinkType","hierarchyMeaning":"is-a","content":"complete","concept":[{"code":"REL","display":"related","definition":"An action taken with respect to a subject Entity by a regulatory or authoritative body with supervisory capacity over that entity. The action is taken in response to behavior by the subject Entity that body finds to be undesirable.\r\n\n                        Suspension, license restrictions, monetary fine, letter of reprimand, mandated training, mandated supervision, etc.Examples:","concept":[{"code":"BACKUP","display":"is backup for","definition":"This relationship indicates the source Role is available to the target Role as a backup. An entity in a backup role will be available as a substitute or replacement in the event that the entity assigned the role is unavailable. In medical roles where it is critical that the function be performed and there is a possibility that the individual assigned may be ill or otherwise indisposed, another individual is assigned to cover for the individual originally assigned the role. A backup may be required to be identified, but unless the backup is actually used, he/she would not assume the assigned entity role."},{"code":"CONT","display":"has contact","definition":"This relationship indicates the target Role provides or receives information regarding the target role.  For example, AssignedEntity is a contact for a ServiceDeliveryLocation."},{"code":"DIRAUTH","display":"has direct authority over","definition":"The source Role has direct authority over the target role in a chain of authority."},{"code":"IDENT","display":"Identification","definition":"Description: The source role provides identification for the target role. The source role must be IDENT. The player entity of the source role is constrained to be the same as (i.e. the equivalent of, or equal to) the player of the target role if present. If the player is absent from the source role, then it is assumed to be the same as the player of the target role."},{"code":"INDAUTH","display":"has indirect authority over","definition":"The source Role has indirect authority over the target role in a chain of authority."},{"code":"PART","display":"has part","definition":"The target Role is part of the Source Role."},{"code":"REPL","display":"replaces","definition":"This relationship indicates that the source Role replaces (or subsumes) the target Role.  Allows for new identifiers and/or new effective time for a registry entry or a certification, etc."}]}]}