{"resourceType":"OperationDefinition","id":"CapabilityStatement-conforms","meta":{"lastUpdated":"2019-11-01T09:29:23.356+11:00"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":5},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"trial-use"}],"url":"http://hl7.org/fhir/OperationDefinition/CapabilityStatement-conforms","version":"4.0.1","name":"Test if a server implements a client's required operations","status":"draft","kind":"operation","date":"2019-11-01T09:29:23+11:00","publisher":"HL7 (FHIR Project)","contact":[{"telecom":[{"system":"url","value":"http://hl7.org/fhir"},{"system":"email","value":"fhir@lists.hl7.org"}]}],"description":"This operation asks the server to check that it implements all the resources, interactions, search parameters, and operations that the client provides in its capability statement. The client provides both capability statements by reference, and must ensure that all the referenced resources are available to the conformance server","code":"conforms","comment":"The operation performs a full comparison of the functionality described by the two capability statements, including the profiles and value sets they reference, and also including concept maps and structure maps.     \n\nThe full execution of this operation is still a matter of research, but it is intended to support comparison of systems to see if they will interoperate    \n\nIf the capability statements can be successfully compared, then the return value is a 200 OK with an OperationOutcome along with intersection and union capability statements. The operation outcome can contain errors relating to differences between the capability statements. If the capability statements cannot be compared, because dependencies cannot be located, the return value is a 4xx error, with an OperationOutcome with at least one issue with severity >= error","resource":["CapabilityStatement"],"system":false,"type":true,"instance":false,"parameter":[{"name":"left","use":"in","min":0,"max":"1","documentation":"A canonical reference to the left-hand system's capability statement","type":"canonical"},{"name":"right","use":"in","min":0,"max":"1","documentation":"A canonical reference to the right-hand system's capability statement","type":"canonical"},{"name":"mode","use":"in","min":0,"max":"1","documentation":"What kind of comparison to perform - server to server, or client to server (use the codes 'server/server' or 'client/server')","type":"code"},{"name":"issues","use":"out","min":1,"max":"1","documentation":"Outcome of the CapabilityStatement test","type":"OperationOutcome"},{"name":"union","use":"out","min":0,"max":"1","documentation":"The intersection of the functionality described by the CapabilityStatement resources","type":"CapabilityStatement"},{"name":"intersection","use":"out","min":0,"max":"1","documentation":"The union of the functionality described by the CapabilityStatement resources","type":"CapabilityStatement"}]}