{"resourceType":"OperationDefinition","id":"NamingSystem-preferred-id","meta":{"lastUpdated":"2019-11-01T09:29:23.356+11:00"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":1},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"trial-use"}],"url":"http://hl7.org/fhir/OperationDefinition/NamingSystem-preferred-id","version":"4.0.1","name":"Fetch Preferred it","status":"draft","kind":"operation","date":"2019-11-01T09:29:23+11:00","publisher":"HL7 (FHIR Project)","contact":[{"telecom":[{"system":"url","value":"http://hl7.org/fhir"},{"system":"email","value":"fhir@lists.hl7.org"}]}],"description":"This operation returns the preferred identifiers for identifiers, and terminologies. The operation takes 2 parameters:     \n\n* a system identifier - either a URI, an OID, or a v2 table 0396 (other) code  \n* a code for what kind of identifier is desired (URI, OID, v2 table 0396 identifier)    \n\nand returns either the requested identifier, or an HTTP errors response with an OperationOutcome because either the provided identifier was not recognized, or the requested identiifer type is not known.    \n\nThe principle use of this operation is when converting between v2, CDA and FHIR Identifier/CX/II and CodeableConcepts/C(N/W)E/CD but the operation may also find use when converting metadata such as profiles.","code":"preferred-id","comment":"Servers handle this request by finding the provided identifier in their known naming systems, and returning the requested identifier type ([NamingSystem.uniqueId.type](namingsystem-definitions.html#NamingSystem.uniqueId.type)). If there are multiple possible identifiers of the specified type (e.g. multiple OIDs) the server returns an error.    \n\nIf the server wishes, it can also look through all code systems and value sets it knows about when attempting to find the requested identifier","resource":["NamingSystem"],"system":false,"type":true,"instance":false,"parameter":[{"name":"id","use":"in","min":1,"max":"1","documentation":"The server parses the provided id to see what type it is (mary a URI, an OID as a URI, a plain OID, or a v2 table 0396 code). If the server can't tell what type of identifier it is, it can try it as multiple types. It is an error if more than one system matches the provided identifier","type":"string"},{"name":"type","use":"in","min":1,"max":"1","type":"code","binding":{"strength":"required","valueSet":"http://hl7.org/fhir/ValueSet/namingsystem-identifier-type|4.0.1"}},{"name":"result","use":"out","min":1,"max":"1","documentation":"OIDs are return as plain OIDs (not the URI form).","type":"string"}]}