{"resourceType":"ValueSet","id":"v3-hl7Realm","meta":{"lastUpdated":"2018-08-12T00:00:00.000+10:00","profile":["http://hl7.org/fhir/StructureDefinition/shareablevalueset"]},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"external"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-wg","valueCode":"vocab"}],"url":"http://terminology.hl7.org/ValueSet/v3-hl7Realm","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.1.11.20355"}],"version":"2018-08-12","name":"v3.hl7Realm","title":"v3 Code System hl7Realm","status":"active","experimental":false,"date":"2018-08-12","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":"  Description:\r\nCoded concepts representing Binding Realms (used for Context Binding of terminology in HL7 models)  and/or Namespace Realms (used to help ensure unique identification of HL7 artifacts). This code system is partitioned into three sections: Affiliate realms, Binding realms and Namespace realms.  All affiliate realm codes may automatically be used as both binding realms and namespace realms.  Furthermore, affiliate realms are the only realms that have authority over the creation of binding realms.  (Note that 'affiliate' includes the idea of both international affiliates and the HL7 International organization.)  All other codes must be associated with an owning affiliate realm and must appear as a specialization of _BindingRealm or _NamespaceRealm.  For affiliates whose concepts align with nations, the country codes from ISO 3166-1 2-character alpha are used for the code when possible so these codes should not be used for other realm types.  It is recommended that binding realm and namespace codes submitted by affiliates use the realm code as a prefix to avoid possible collisions with ISO codes.  However, tooling does not currently support namepace realm codes greater than 2 characters.  Open Issue:\r\nThe name of the concept property \"owningAffiliate\" should be changed to better reflect that the property value is the human readable name of the organizational entity that manages the Realm identified by the Realm Code.  Open Issue:\r\nIn spite of the inability of tooling to process codes longer than 2 characters, there is at least one realm codes ('SOA') that was added that is 3 characters in length.","immutable":true,"compose":{"include":[{"system":"http://terminology.hl7.org/CodeSystem/v3-hl7Realm"}]}}