{"resourceType":"CodeSystem","id":"v2-0119","meta":{"profile":["http://hl7.org/fhir/StructureDefinition/shareablecodesystem"]},"language":"en","text":{"status":"additional","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n            <p>Order Control Codes</p>\n\n            <table class=\"grid\">\n              <tr>\n                <td>\n                  <b>Code</b>\n                </td>\n                <td>\n                  <b>Description</b>\n                </td>\n                <td>\n                  <b>Comment</b>\n                </td>\n                <td>\n                  <b>Version</b>\n                </td>\n              </tr>\n              <tr>\n                <td>AF\n                  <a name=\"AF\"> </a>\n                </td>\n                <td>Order/service refill request approval</td>\n                <td>Placer Applications.\nAF is a response to RF where the placer authorizing a refill or quantity of refills.</td>\n                <td>added v2.3</td>\n              </tr>\n              <tr>\n                <td>CA\n                  <a name=\"CA\"> </a>\n                </td>\n                <td>Cancel order/service request</td>\n                <td>Placer or Filler Applications.\nA cancellation is a request by the placer for the filler, or the filler to the placer, not to do a previously ordered service. Confirmation of the cancellation request is provided by the filler or placer, e.g., a message with an ORC-1-order control value of CR.\nTypical responses include, but are not limited to, CR – Cancelled as requested, UC – Unable to Cancel.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>CH\n                  <a name=\"CH\"> </a>\n                </td>\n                <td>Child order/service</td>\n                <td>Placer or Filler Applications.\nUsed in conjunction with the PA - Parent order control code. Refer to PA order control code for discussion.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>CN\n                  <a name=\"CN\"> </a>\n                </td>\n                <td>Combined result</td>\n                <td>Filler Applications.\nThe combined result code provides a mechanism to transmit results that are associated with two or more orders. This situation occurs commonly in radiology reports when the radiologist dictates a single report for two or more exams represented as two or more orders. For example, knee and hand films for a rheumatoid arthritis patient might generate a single dictation on the part of the radiologist.\nWhen such results are reported the CN code replaces the RE code in all but the last ORC, and the results follow the last ORC and its OBR. An example follows of a single report following three ORCs:\nMSH|...&lt;cr&gt;\nPID|...&lt;cr&gt;\nORC|CN|...&lt;cr&gt;\nOBR|1|A4461XA^HIS|81641^RAD|73666^Bilateral Feet|...&lt;cr&gt;\nORC|CN|...&lt;cr&gt;\nOBR|2|A4461XB^HIS|81642^RAD|73642^Bilateral Hand PA|...&lt;cr&gt;\nORC|RE|...&lt;cr&gt;\nOBR|3|A4461XC^HIS|81643^RAD|73916^Bilateral Knees|...&lt;cr&gt;\nOBX|1|CE|73916&amp;IMP|1|Radiologist’s Impression|...&lt;cr&gt;\nOBX|2|CE|73642&amp;IMP|1|Radiologist’s Impression|...&lt;cr&gt;\nOBX|3|FT|73642&amp;GDT|1|Description|...&lt;cr&gt;</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>CP\n                  <a name=\"CP\"> </a>\n                </td>\n                <td>Cancel process step</td>\n                <td>Filler Applications.\nThe control code CP – Cancel process step should be used in the ORC-1 for communication Filler-to-Filler, e.g., LIS-to-Analyzer, to differentiate from code CA (Placer-to-Filler).\nThe Filler should response with an acceptance of the cancellation using ORC-1 = CR and ORC-5 = CA.</td>\n                <td>added v2.8</td>\n              </tr>\n              <tr>\n                <td>CR\n                  <a name=\"CR\"> </a>\n                </td>\n                <td>Canceled as requested</td>\n                <td>Filler or Placer Applications.\nA response by the filler or placer application that a request to cancel (CA by the placer application) was performed successfully.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>DC\n                  <a name=\"DC\"> </a>\n                </td>\n                <td>Discontinue order/service request</td>\n                <td>Placer or Filler Applications.\nA request by the placer for the filler, or the filler to the placer,  to discontinue a previously requested service. The differentiation between discontinue and cancel is that discontinue effects the order/service and all future occurrences, cancel refers to just the present action. \nTypical responses include, but are not limited to, CR – Cancelled as requested, UC – Unable to Cancel.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>DE\n                  <a name=\"DE\"> </a>\n                </td>\n                <td>Data errors</td>\n                <td>Placer or Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>DF\n                  <a name=\"DF\"> </a>\n                </td>\n                <td>Order/service refill request denied</td>\n                <td>Placer Applications.\nIn response to a Filler application requesting refill authorization (RF), DF indicates that the placer does not authorize refills for the order. ORC-16 Order Control Code reason may be used to indicate the reason for the request denial. Some suggested values include:\nAA\tPatient unknown to the provider\nAB\tPatient never under provider care\nAC\tPatient no longer under provider care\nAD\tPatient has requested refill too soon\nAE\tMedication never prescribed for the patient\nAF\tPatient should contact provider first\nAG\tRefill not appropriate\nNote that these values originate from the NCPDP SCRIPT Response Segment Code List Qualifiers. Materials Reproduced with the consent of ©National Council for Prescription Drug Programs, Inc. 1988, 1992, 2002 NCPDP.</td>\n                <td>added v2.3</td>\n              </tr>\n              <tr>\n                <td>DR\n                  <a name=\"DR\"> </a>\n                </td>\n                <td>Discontinued as requested</td>\n                <td>Filler or Placer Applications.\nThe filler or placer, in response to a request to discontinue (DC from the placer or filler application), has discontinued the order/service.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>FU\n                  <a name=\"FU\"> </a>\n                </td>\n                <td>Order/service refilled, unsolicited</td>\n                <td>Filler Applications.\nFU notifies the placer that the filler issued a refill for the order at the patient's request.</td>\n                <td>added v2.3</td>\n              </tr>\n              <tr>\n                <td>HD\n                  <a name=\"HD\"> </a>\n                </td>\n                <td>Hold order request</td>\n                <td>Placer Applications.\nTypical responses include, but are not limited to, CR - Cancelled as requested, UC - Unable to Cancel.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>HR\n                  <a name=\"HR\"> </a>\n                </td>\n                <td>On hold as requested</td>\n                <td>Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>LI\n                  <a name=\"LI\"> </a>\n                </td>\n                <td>Link order/service to patient care problem or goal</td>\n                <td>Placer or Filler Applications.\nRefer to Chapter 12 Patient Care for complete discussion.</td>\n                <td>added v2.3.1</td>\n              </tr>\n              <tr>\n                <td>MC\n                  <a name=\"MC\"> </a>\n                </td>\n                <td>Miscellaneous Charge - not associated with an order</td>\n                <td>applies to DFT^P03^DFT_P03 and DFT^P11^DFT_P11</td>\n                <td>added v2.6</td>\n              </tr>\n              <tr>\n                <td>NA\n                  <a name=\"NA\"> </a>\n                </td>\n                <td>Number assigned</td>\n                <td>Placer Applications.\nThere are three circumstances that involve requesting an order number (ORC-2-placer order number or ORC-3-filler order number): \n\n(1) When the filler application needs to request an ORC-3-filler order number from a centralized application (e.g., HIS).\nSN – The send order number code provides a mechanism for the filler to request an ORC-3-filler order number from some centralized application (called “other” in the table below), such as a central HIS, by sending an ORM message containing an ORC-1-order control value of SN. This ORC has a null ORC-3-filler order number and an ORC-2-placer order number created by the filler application when the filler originates the order.\n\nThe order (SN type) message can be acknowledged by either one of two methods:\na) By an order application acknowledgement message containing an ORC-1-order control value of OK. Then an unsolicited order message can be sent at a future time, containing an ORC with ORC-1-order control value of NA to provide the actual number assigned.\n\nb) By an order acknowledgement message containing an ORC-1-order control value of NA as described below.\n\nNA – The number assigned code allows the “other” application to notify the filler application of the newly-assigned filler order number. ORC-1-order control contains value of NA, ORC-2-placer order number (from the ORC with the SN value), and the newly-assigned filler order number. \nCode\tFrom\tORC-2-Placer Order Number\tORC-3-Filler Order Number\nSN\tfiller application\tplacer order number^filler application ID\tNull\nNA\tother application\tplacer order number^filler application ID\tfiller order number^filler application ID\nNote: Both the placer order number and the filler order number have the filler’s application ID\n\n(2) When the filler application needs to request an ORC-2-placer order number from some other application (e.g., Order Entry).\n\nSN – The send order number code provides a mechanism for the filler application to request an ORC-2-placer order number from another application (called “other” in the table below) by sending an order message containing an ORC-1-order control value of SN. This ORC has a null ORC-2-placer order number and an ORC-3-filler order number created by the filler application when the filler originates the order. \n\nThe order (SN type) message can be acknowledged by two methods:\na) By an order application acknowledgement message containing an ORC-1-order control value of OK. Then an unsolicited order message can be sent at a future time, containing an ORC-1-order control value of NA to provide the actual number assigned.\n \nb) By an order acknowledgement message containing an ORC-1-order control value of NA as described below.\nNA – The number assigned code allows the “other” application to notify the filler application of the newly-assigned ORC-2-placer order number. The ORC contains an ORC-1-order control value of NA, the newly-assigned ORC-2-placer order number, and the ORC-3-filler order number (from the ORC with the SN value).\nCode\tFrom\tORC-2-Placer Order Number\tORC-3-Filler Order Number\nSN\tfiller application\tnull\tfiller order number^filler application ID\nNA\tother application\tplacer order number^placer application ID\tfiller order number^filler application ID\nNote: The new ORC-2-placer order number has the placer’s application ID\n\n(3) When an application (not the filler application) wants to assign an ORC-3-filler order number for a new order.\nNW – When the application creating an order (not the filler application) wants to assign a filler order number for a new order.\nor \nRO – (RO following an RP). In this case, the “other” application completes ORC-3-filler order number, using the filler application ID as the second component of the filler order number.\nCode\tFrom\tORC-2-Placer Order Number\tORC-3-Filler Order Number\nNW or RO\tOther application to filler application\tplacer order number^placer application ID\tfiller order number^filler application ID</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>NR\n                  <a name=\"NR\"> </a>\n                </td>\n                <td>Notification Received</td>\n                <td/>\n                <td>added v2.9</td>\n              </tr>\n              <tr>\n                <td>NW\n                  <a name=\"NW\"> </a>\n                </td>\n                <td>New order/service</td>\n                <td>Placer Applications.\nSee comments for NA - Number Assigned.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>OC\n                  <a name=\"OC\"> </a>\n                </td>\n                <td>Order/service canceled</td>\n                <td>Filler Applications.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>OD\n                  <a name=\"OD\"> </a>\n                </td>\n                <td>Order/service discontinued</td>\n                <td>Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>OE\n                  <a name=\"OE\"> </a>\n                </td>\n                <td>Order/service released</td>\n                <td>Filler Applications.</td>\n                <td>added v2.3</td>\n              </tr>\n              <tr>\n                <td>OF\n                  <a name=\"OF\"> </a>\n                </td>\n                <td>Order/service refilled as requested</td>\n                <td>Filler Applications.\nOF directly responds to the placer system's request for a refill.</td>\n                <td>added v2.3</td>\n              </tr>\n              <tr>\n                <td>OH\n                  <a name=\"OH\"> </a>\n                </td>\n                <td>Order/service held</td>\n                <td>Filler Applications.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>OK\n                  <a name=\"OK\"> </a>\n                </td>\n                <td>Order/service accepted &amp; OK</td>\n                <td>Filler Applications.\nSee comments for NA - Number Assigned.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>OP\n                  <a name=\"OP\"> </a>\n                </td>\n                <td>Notification of order for outside dispense</td>\n                <td>Placer Applications.\nThese order control codes are used to communicate an order between systems where the order is intended for informational purposes. For example, an order that will be performed by a vendor outside the enterprise of communicating systems. The communicating systems may need to maintain information relative to the order for clinical continuity, but no actions to perform the ordered service are intended.\nOP represents an informational version of NW, PY represents the informational-only version of RO. NW and RO table notes also apply to OP and PY, respectively.</td>\n                <td>added v2.5</td>\n              </tr>\n              <tr>\n                <td>OR\n                  <a name=\"OR\"> </a>\n                </td>\n                <td>Released as requested</td>\n                <td>Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>PA\n                  <a name=\"PA\"> </a>\n                </td>\n                <td>Parent order/service</td>\n                <td>Filler Applications.\nThe parent (PA) and child (CH) order control codes allow the spawning of “child” orders from a “parent” order without changing the parent (original order). One or more ORC segments with an ORC-1-order control value of PA are followed by one or more ORC segments with an ORC-1-order control value of CH. Whether OBR segments must be present is determined by the value of ORC-6-response flag. \n\nFor example, suppose that a microbiology culture produced two organisms and corresponding susceptibility reports. Then the sequence of segments would be as follows: (see figure 4-4)\n\nThe assignment of placer order numbers in the parent-child paradigm depends on whether the placer or filler creates the child order and in the latter case, on whether the placer supports the SN/NA transaction. If the placer creates the child orders it will assign their placer order numbers according to its usual procedures. If the filler creates the child orders there are two possibilities: each child will inherit the placer order number of its parent, or the filler will use the SN/NA transaction to request that the placer assign a placer order number. In either case, the filler application creates the filler order numbers of the children according to its usual procedures.\n\nWhenever a child order is transmitted in a message the ORC segment’s ORC-8-parent is valued with the parent’s filler order number (if originating from the filler) and with the parent’s placer order number (if originating from the filler or if originating from the placer). \n\nThe parent child mechanism can be used to “expand” a parent order (e.g., an order for three EKGs on successive mornings).</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>PR\n                  <a name=\"PR\"> </a>\n                </td>\n                <td>Previous Results with new order/service</td>\n                <td>Placer Applications.\nPR indicates that this ORC is part of an ORU structure containing previous observation, which is embedded in the order.\n\nAt least two main use cases require that the complete results of the previous observations be transmitted with the order. \n\n•\tDiagnostic laboratories referring tests to another lab for either confirmation of results (HIV, etc.) or due to not being equipped to do the tests (genetic testing, etc.). \n\n•\tDiagnostic laboratories sending test results to Knowledge Bases for the automated generation of diagnostic comments for inclusion into the lab report.</td>\n                <td>added v2.4</td>\n              </tr>\n              <tr>\n                <td>PY\n                  <a name=\"PY\"> </a>\n                </td>\n                <td>Notification of replacement order for outside dispense</td>\n                <td>Placer Applications.\nSee comments for OP - Notification of order for outside dispense.</td>\n                <td>added v2.5</td>\n              </tr>\n              <tr>\n                <td>RA\n                  <a name=\"RA\"> </a>\n                </td>\n                <td>Recommendation Accepted</td>\n                <td/>\n                <td>added v2.9</td>\n              </tr>\n              <tr>\n                <td>RC\n                  <a name=\"RC\"> </a>\n                </td>\n                <td>Recommended Change</td>\n                <td/>\n                <td>added v2.9</td>\n              </tr>\n              <tr>\n                <td>RD\n                  <a name=\"RD\"> </a>\n                </td>\n                <td>Recommendation Declined</td>\n                <td/>\n                <td>added v2.9</td>\n              </tr>\n              <tr>\n                <td>RE\n                  <a name=\"RE\"> </a>\n                </td>\n                <td>Observations/Performed Service to follow</td>\n                <td>Placer or Filler Applications.\nThe observations-to-follow code is used to transmit patient-specific information with an order. An order detail segment (e.g., OBR) can be followed by one or more observation segments (OBX). Any observation that can be transmitted in an ORU message can be transmitted with this mechanism. When results are transmitted with an order, the results should immediately follow the order or orders that they support.\n\nThe following example shows the sequence of segments for three Pharmacy orders. It illustrates the use of the RE code:\nSegment\tOrder Control\tComment\nMSH\t\t\nPID\t\t\nORC\tNW\tFirst new order\nRXO\t\tFirst order segment\n\t\t\nORC\tNW\t2nd new order\nRXO\t\t2nd order segment\n[ORC\tRE\tPatient-specific observation, optional in V 2.2\n OBR]\t\tObservation OBR, optional in V 2.2\nOBX\t\tAn observation segment\nOBX\t\tAnother observation segment\nOBX\t\tAnother observation segment\nOBX\t\tAnother observation segment\n\t\t\nORC\tNW\t3rd order\nRXO\t\t3rd order segment\n\nIn this version of HL7, results can be transmitted with an order as one or more OBX segments without the necessity of including the ORC and OBR segments.\n\nObservations can be transmitted in an ORU message without using an ORC. There are times when it is necessary to transmit information not included in the OBR segments of the ORU message. In this case, it is recommended that the ORC be included in the ORU message.\n\nThe order control value of RE is required only in ORM messages to indicate that an order is followed by observation results (OBX). The RE code is not necessary in the ORU message because it is expected that the OBR segments can be followed by observation results (OBX).</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>RF\n                  <a name=\"RF\"> </a>\n                </td>\n                <td>Refill order/service request</td>\n                <td>Placer or Filler Applications.\nRF accommodates requests by either the filler or the placer. The filler may be requesting refill authorization from the placer. A placer system may be requesting a refill to be done by the filler system.\n\nTypical responses include, but are not limited to: For a Filler request AF – Order/service refill request approval, DF – Order/service refill request denied; for a Placer request RE – Observations/Performed Service to follow, UF – Unable to refill.</td>\n                <td>added v2.3</td>\n              </tr>\n              <tr>\n                <td>RL\n                  <a name=\"RL\"> </a>\n                </td>\n                <td>Release previous hold</td>\n                <td>Placer Applications.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>RO\n                  <a name=\"RO\"> </a>\n                </td>\n                <td>Replacement order</td>\n                <td>Placer or Filler Applications.\nA replacement is the substitution of one or more orders for one or more previously ordered services.\n\nThe replaced orders are treated as though they were canceled. If and when an ordered service can be replaced are local site-specific determinations.\n\nUse the parent/child order control codes if the site specifies that the original order must remain intact. Do not use the replacement codes under this circumstance. \n\nFor each order to be replaced, use an ORC-1-order control value of RP (request for a replacement going to a filler) or RU (an unsolicited replacement created by the filler) used by the filler to notify the placer and/or other systems). By local agreement, the ORC segment (with RP or RU) may be followed by its original order detail segment. The ORC segments (with RP or RU) must be followed by an ORC segment with an ORC-1-order control value of RO (indicating the replacement order). By local agreement, the ORC with the RO value may be followed by an order detail segment. \n\nFor example, suppose that an ancillary application were replacing two OBR orders with three different orders. The sequence of segments would be as follows:\n\nSeg\tOrder Control\tComment\nORC\tRU\t1st replaced ORC\nOBR\t\t1st replaced order’s detail segment\n\t\t\nORC\tRU\t2nd replaced ORC\nOBR\t\t2nd replaced order’s detail segment\n\t\t\nORC\tRO\t1st replacement ORC\nOBR\t\t1st replacement order’s detail segment\n\t\t\nORC\tRO\t2nd replacement ORC\nOBR\t\t2nd replacement order’s detail segment\n\t\t\nORC\tRO\t3rd replacement ORC\nOBR\t\t3rd replacement order’s detail segment\n\nWhether the OBR segments must be present is determined by the value of ORC-6-response flag.\n\nThe described replacement method will handle all possible cases of replacement: one into one, many into one, one into many, and many into many. If the placer sent this request to the filler with two RPs, and this was a response back from the filler to the placer, the two RUs (replaced unsolicited) would be two RQs (replaced as requested). (see figure 4-3)\n\nSeg\tOrder Control\tComment\nORC\tRQ\t1st replaced ORC\nOBR\t\t1st replaced order’s detail segment\n\t\t\nORC\tRQ\t2nd replaced ORC\nOBR\t\t2nd replaced order’s detail segment\n\t\t\nORC\tRO\t1st replacement ORC\nOBR\t\t1st replacement order’s detail segment\n\t\t\nORC\tRO\t2nd replacement ORC\nOBR\t\t2nd replacement order’s detail segment\n\t\t\nORC\tRO\t3rd replacement ORC\nOBR\t\t3rd replacement order’s detail segment\n\nThe replacement order code is sent by the filler application to another application indicating the exact replacement ordered service. It is used with the RP and RU order control codes as described above.\n\nThe rules for the order numbers in ORC segments with an order control value of RO are determined by the replacement type (RP or RU).\n\nIn the case of the RU type (i.e., unsolicited replacement by the filler), the filler order number is generated as usual by the filler application. The placer order number is identical to the placer order number of the first transmitted ORC with an order control value of RU.\n\nIn the case of the RP type (i.e., a replacement request from another application to the filler), the placer order number is generated by the placer application using the procedure for new orders. The filler order number is generated by the filler application using the procedure identical for new orders.\n\nIf a replacement sequence is used in an ORU message (i.e., during results reporting), the following are the recommended segments to be used for the replacement orders:\n\nORC with an order control value of RO.\n\nAny OBR segments (can be replaced by any order detail segments).\n\nOptionally followed by observation result segments (OBX)\nNTE segments can appear after the OBR (or any order detail segment) or after an OBX segment as in a regular ORU message.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>RP\n                  <a name=\"RP\"> </a>\n                </td>\n                <td>Order/service replace request</td>\n                <td>Placer Applications.\nA replacement is the substitution of one or more orders for one or more previously ordered services. See comment 1 on RO – Replacement Order for further discussion.\n\nThe order replace request code permits the order filler to replace one or more new orders with one or more new orders, at the request of the placer application.\n\nThe rules for the order numbers in ORC segments with an order control value of RO are determined by the replacement type (RP or RU).\n\nIn the case of the RU type (i.e., unsolicited replacement by the filler), the filler order number is generated as usual by the filler application. The placer order number is identical to the placer order number of the first transmitted ORC with an order control value of RU.\n\nIn the case of the RP type (i.e., a replacement request from another application to the filler), the placer order number is generated by the placer application using the procedure for new orders. The filler order number is generated by the filler application using the procedure identical for new orders.\n\nIf a replacement sequence is used in an ORU message (i.e., during results reporting), the following are the recommended segments to be used for the replacement orders:\n\na) ORC with an order control value of RO\n\nb) Any OBR segments (can be replaced by any order detail segments)\n\nc) Optionally followed by observation result segments (OBX)\n\nd) NTE segments can appear after the OBR (or any order detail segment) or after an OBX segment as in a regular ORU message</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>RQ\n                  <a name=\"RQ\"> </a>\n                </td>\n                <td>Replaced as requested</td>\n                <td>Filler Applications.\nA replacement is the substitution of one or more orders for one or more previously ordered services. See comment 1 on RO – Replacement Order for further discussion.\n\nThe order replace request code permits the order filler to replace one or more new orders with one or more new orders, at the request of the placer application.\n\nThe replacement order code is sent by the filler application to another application indicating the exact replacement ordered service. It is used with the RP and RU order control codes as described above.\n\nThe rules for the order numbers in ORC segments with an order control value of RO are determined by the replacement type (RP or RU).\n\nIn the case of the RU type (i.e., unsolicited replacement by the filler), the filler order number is generated as usual by the filler application. The placer order number is identical to the placer order number of the first transmitted ORC with an order control value of RU.\n\nIn the case of the RP type (i.e., a replacement request from another application to the filler), the placer order number is generated by the placer application using the procedure for new orders. The filler order number is generated by the filler application using the procedure identical for new orders.\n\nIf a replacement sequence is used in an ORU message (i.e., during results reporting), the following are the recommended segments to be used for the replacement orders:\n\na) ORC with an order control value of RO\n\nb) Any OBR segments (can be replaced by any order detail segments)\n\nc) Optionally followed by observation result segments (OBX)\n\nd) NTE segments can appear after the OBR (or any order detail segment) or after an OBX segment as in a regular ORU message</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>RR\n                  <a name=\"RR\"> </a>\n                </td>\n                <td>Request received</td>\n                <td>Placer or Filler Applications.\nLeft in for backward compatibility. In the current version it is equivalent to an accept acknowledgment. The request-received code indicates that an order message has been received and will be processed later. The order has not yet undergone the processing that would permit a more exact response.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>RU\n                  <a name=\"RU\"> </a>\n                </td>\n                <td>Replaced unsolicited</td>\n                <td>Filler Applications.\nA replacement is the substitution of one or more orders for one or more previously ordered services. See comment 1 on RO – Replacement Order for further discussion.\n\nThe unsolicited replacement code permits the filler application to notify another application without being requested from the placer application.\n\nThe rules for the order numbers in ORC segments with an order control value of RO are determined by the replacement type (RP or RU).\n\nIn the case of the RU type (i.e., unsolicited replacement by the filler), the filler order number is generated as usual by the filler application. The placer order number is identical to the placer order number of the first transmitted ORC with an order control value of RU.\n\nIn the case of the RP type (i.e., a replacement request from another application to the filler), the placer order number is generated by the placer application using the procedure for new orders. The filler order number is generated by the filler application using the procedure identical for new orders.\n\nIf a replacement sequence is used in an ORU message (i.e., during results reporting), the following are the recommended segments to be used for the replacement orders:\n\na) ORC with an order control value of RO\n\nb) Any OBR segments (can be replaced by any order detail segments)\n\nc) Optionally followed by observation result segments (OBX)\n\nd) NTE segments can appear after the OBR (or any order detail segment) or after an OBX segment as in a regular ORU message</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>SC\n                  <a name=\"SC\"> </a>\n                </td>\n                <td>Status changed</td>\n                <td>Placer or Filler Applications.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>SN\n                  <a name=\"SN\"> </a>\n                </td>\n                <td>Send order/service number</td>\n                <td>Placer Applications.\nSee comments for NA - Number Assigned.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>SQ\n                  <a name=\"SQ\"> </a>\n                </td>\n                <td>Supplemented as requested</td>\n                <td/>\n                <td>added v2.9</td>\n              </tr>\n              <tr>\n                <td>SR\n                  <a name=\"SR\"> </a>\n                </td>\n                <td>Response to send order/service status request</td>\n                <td>Filler Applications.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>SS\n                  <a name=\"SS\"> </a>\n                </td>\n                <td>Send order/service status request</td>\n                <td>Placer Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>SU\n                  <a name=\"SU\"> </a>\n                </td>\n                <td>Supplement this order</td>\n                <td/>\n                <td>added v2.9</td>\n              </tr>\n              <tr>\n                <td>UA\n                  <a name=\"UA\"> </a>\n                </td>\n                <td>Unable to accept order/service</td>\n                <td>Filler Applications.\nAn unable to accept code is used when a new order cannot be accepted by the filler. Possible reasons include requesting a prescription for a drug which the patient is allergic to or for an order which requires certain equipment resources which are not available such that the order cannot be filled. Note that this is different from the communication level acceptance as defined within the MSA segment.</td>\n                <td>added v2.3</td>\n              </tr>\n              <tr>\n                <td>UC\n                  <a name=\"UC\"> </a>\n                </td>\n                <td>Unable to cancel</td>\n                <td>Filler or Placer Applications.\nAn unable-to-cancel code is used when the ordered service is at a point that it cannot be canceled by the placer or filler or when local rules prevent cancellation by the filler. The use of this code is dependent on the value of ORC-6-response flag.\nIf the filler initiated the request to cancel and the placer is unable to cancel while the filler cannot proceed with the fulfillment of that order, then the necessary communication to resolve the conflict is outside the scope of these messages.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>UD\n                  <a name=\"UD\"> </a>\n                </td>\n                <td>Unable to discontinue</td>\n                <td>Filler or Placer Applications.\nAn unable-to-discontinue code is used when the ordered service is at a point that it cannot be discontinued by the placer or filler or when local rules prevent discontinuance by the filler. The use of this code is dependent on the value of ORC-6-response flag.\nIf the filler initiated the request to discontinue and the placer is unable to discontinue while the filler cannot proceed with the fulfillment of that order, then the necessary communication to resolve the conflict is outside the scope of these messages.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>UF\n                  <a name=\"UF\"> </a>\n                </td>\n                <td>Unable to refill</td>\n                <td>Filler Applications.\nNegative response to RF Refill order/service request, indicating that the receiving application was not able to complete the refill request.</td>\n                <td>added v2.3</td>\n              </tr>\n              <tr>\n                <td>UH\n                  <a name=\"UH\"> </a>\n                </td>\n                <td>Unable to put on hold</td>\n                <td>Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>UM\n                  <a name=\"UM\"> </a>\n                </td>\n                <td>Unable to replace</td>\n                <td>Filler Applications.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>UN\n                  <a name=\"UN\"> </a>\n                </td>\n                <td>Unlink order/service from patient care problem or goal</td>\n                <td>Placer or Filler Applications.\nRefer to Chapter 12 Patient Care for complete discussion.</td>\n                <td>added v2.3.1</td>\n              </tr>\n              <tr>\n                <td>UR\n                  <a name=\"UR\"> </a>\n                </td>\n                <td>Unable to release</td>\n                <td>Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>UX\n                  <a name=\"UX\"> </a>\n                </td>\n                <td>Unable to change</td>\n                <td>Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>XO\n                  <a name=\"XO\"> </a>\n                </td>\n                <td>Change order/service request</td>\n                <td>Placer Applications.</td>\n                <td>added v2.2</td>\n              </tr>\n              <tr>\n                <td>XR\n                  <a name=\"XR\"> </a>\n                </td>\n                <td>Changed as requested</td>\n                <td>Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n              <tr>\n                <td>XX\n                  <a name=\"XX\"> </a>\n                </td>\n                <td>Order/service changed, unsol.</td>\n                <td>Filler Applications.</td>\n                <td>from v2.1</td>\n              </tr>\n            </table>\n\n          </div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status","valueCode":"external"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://terminology.hl7.org/CodeSystem/v2-0119","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.18.48"}],"version":"2.9","name":"v2.0119","title":"v2 ORDER CONTROL","status":"active","experimental":false,"publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":"FHIR Value set/code system definition for HL7 v2 table 0119 ( ORDER CONTROL)","content":"complete","concept":[{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nAF is a response to RF where the placer authorizing a refill or quantity of refills.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. AF is een antwoord op RF waarbij de placer een herhaling autoriseert of een bepaalde hoeveelheid om aan te vullen"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"AF","display":"Order/service refill request approval","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service herhaling verzoek goedgekeurd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nA cancellation is a request by the placer for the filler, or the filler to the placer, not to do a previously ordered service. Confirmation of the cancellation request is provided by the filler or placer, e.g., a message with an ORC-1-order control value of CR.\r\nTypical responses include, but are not limited to, CR – Cancelled as requested, UC – Unable to Cancel.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. Een annulering is een verzoek voor de placer aan de filler, of de filler aan de placer, om de eerder aangevraagde service niet te doen. Bevestiging van het annuleringverzoek wordt gegeven door de filler of de placer, bijv. een bericht met"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"CA","display":"Cancel order/service request","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag stornieren"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Annuleer aanvraag/service verzoek"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nUsed in conjunction with the PA - Parent order control code. Refer to PA order control code for discussion.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. Gebruikt in samenwerking met de code PA - Bovenliggende aanvraag/service. Zie PA voor verdere discussie."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"CH","display":"Child order/service","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"nachgeordneter Auftrag"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Onderliggende/deel aanvraag/service"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nThe combined result code provides a mechanism to transmit results that are associated with two or more orders. This situation occurs commonly in radiology reports when the radiologist dictates a single report for two or more exams represented as two or more orders. For example, knee and hand films for a rheumatoid arthritis patient might generate a single dictation on the part of the radiologist.\r\nWhen such results are reported the CN code replaces the RE code in all but the last ORC, and the results follow the last ORC and its OBR. An example follows of a single report following three ORCs:\r\nMSH|...<cr>\r\nPID|...<cr>\r\nORC|CN|...<cr>\r\nOBR|1|A4461XA^HIS|81641^RAD|73666^Bilateral Feet|...<cr>\r\nORC|CN|...<cr>\r\nOBR|2|A4461XB^HIS|81642^RAD|73642^Bilateral Hand PA|...<cr>\r\nORC|RE|...<cr>\r\nOBR|3|A4461XC^HIS|81643^RAD|73916^Bilateral Knees|...<cr>\r\nOBX|1|CE|73916&IMP|1|Radiologist’s Impression|...<cr>\r\nOBX|2|CE|73642&IMP|1|Radiologist’s Impression|...<cr>\r\nOBX|3|FT|73642&GDT|1|Description|...<cr>","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. De gecombineerde resultaatcode geeft een mechanisme om resultaten te sturen die zijn gekoppeld aan twee of meer aanvragen. Deze situatie komt vaak voor in radiologieverslagen als de radioloog één verslag dicteert voor twee of meer onderzoeken"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"CN","display":"Combined result","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kumulatives Ergebnis (zu mehreren Aufträgen)"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Gecombineerd resultaat"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nThe control code CP – Cancel process step should be used in the ORC-1 for communication Filler-to-Filler, e.g., LIS-to-Analyzer, to differentiate from code CA (Placer-to-Filler).\r\nThe Filler should response with an acceptance of the cancellation using ORC-1 = CR and ORC-5 = CA.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. De code CP - Annuleer processtap is bedoeld voor in ORC-1 bij Filler-naar-Filler communicatie, bijv. LIS-naar-Analyzer, om verschil te kunnen maken tussen code CDA (Placer-naar-Filler). De Filler moet antwoorden met een acceptatie van "}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"CP","display":"Cancel process step","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Annuleer processtap"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler or Placer Applications.\r\nA response by the filler or placer application that a request to cancel (CA by the placer application) was performed successfully.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler of Placer applicaties. Een antwoord van de filler of placer applicatie om aan te geven dat een verzoek om te annuleren (CA door de placer applicatie) succesvol is uitgevoerd."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"CR","display":"Canceled as requested","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag anweisungsgemäß storniert"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Geannuleerd zoals gevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nA request by the placer for the filler, or the filler to the placer,  to discontinue a previously requested service. The differentiation between discontinue and cancel is that discontinue effects the order/service and all future occurrences, cancel refers to just the present action. \r\nTypical responses include, but are not limited to, CR – Cancelled as requested, UC – Unable to Cancel.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filer applicaties. Een verzoek van de placer aan de filler, of van de filler aan de placer, om een eerder aangevraagde service af te breken. Het verschil tussen afbreken en annuleren is dat afbreken de aanvraag/service betreft en alle "}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"DC","display":"Discontinue order/service request","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsausführung abbrechen"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Breek aanvraag/service verzoek af"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"DE","display":"Data errors","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Datenfehler"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Gegevens fouten"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nIn response to a Filler application requesting refill authorization (RF), DF indicates that the placer does not authorize refills for the order. ORC-16 Order Control Code reason may be used to indicate the reason for the request denial. Some suggested values include:\r\nAA\tPatient unknown to the provider\r\nAB\tPatient never under provider care\r\nAC\tPatient no longer under provider care\r\nAD\tPatient has requested refill too soon\r\nAE\tMedication never prescribed for the patient\r\nAF\tPatient should contact provider first\r\nAG\tRefill not appropriate\r\nNote that these values originate from the NCPDP SCRIPT Response Segment Code List Qualifiers. Materials Reproduced with the consent of ©National Council for Prescription Drug Programs, Inc. 1988, 1992, 2002 NCPDP.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. In antwoord op een autorisatieverzoek om te herhalen (RF) door de filler applicatie, geeft DF aan dat de placer geen autorisatie geeft voor herhaling van de order. ORC-16 Order Control Code Reason kan worden gebruikt om de reden voor afkeuring aan te geven."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"DF","display":"Order/service refill request denied","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service herhaal verzoek afgekeurd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler or Placer Applications.\r\nThe filler or placer, in response to a request to discontinue (DC from the placer or filler application), has discontinued the order/service.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler of placer applicaties. De filler of placer heeft de aanvraag/service afgebroken, in antwoord op een verzoek deze af te breken (DC van de aplcer of filler applicatie)."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"DR","display":"Discontinued as requested","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsausführung anweisungsgemäß abgebrochen"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Afgebroken zoals gevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nFU notifies the placer that the filler issued a refill for the order at the patient's request.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. Deze code meldt aan de placer dat de filler een herhaling heeft gedaan voor de aanvraag op verzoek van de patiënt."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"FU","display":"Order/service refilled, unsolicited","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service herhaald, ongevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nTypical responses include, but are not limited to, CR - Cancelled as requested, UC - Unable to Cancel.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. De meest voorkomende, maar niet enige, antwoord zijn CR - Geannuleerd zoals gevraagd, UC - Kon niet annuleren."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"HD","display":"Hold order request","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsbearbeitung aussetzen"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Houd aanvraag aan verzoek"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"HR","display":"On hold as requested","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsbearbeitung anweisungsgemäß ausgesetzt"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aangehouden zoals gevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nRefer to Chapter 12 Patient Care for complete discussion.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. Zie Hoofdstuk 12 Patient Care voor vollledige discussie."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"LI","display":"Link order/service to patient care problem or goal","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Koppel aanvraag/service aan patiënt zorgprobleem of doel"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"applies to DFT^P03^DFT_P03 and DFT^P11^DFT_P11","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"van toepassing op DFT^P03^DFT_P03 en DFT^P11^DFT_P11"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"MC","display":"Miscellaneous Charge - not associated with an order","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Overige charge - niet gekoppeld aan een aanvraag"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nThere are three circumstances that involve requesting an order number (ORC-2-placer order number or ORC-3-filler order number): \r\n\r\n(1) When the filler application needs to request an ORC-3-filler order number from a centralized application (e.g., HIS).\r\nSN – The send order number code provides a mechanism for the filler to request an ORC-3-filler order number from some centralized application (called “other” in the table below), such as a central HIS, by sending an ORM message containing an ORC-1-order control value of SN. This ORC has a null ORC-3-filler order number and an ORC-2-placer order number created by the filler application when the filler originates the order.\r\n\r\nThe order (SN type) message can be acknowledged by either one of two methods:\r\na) By an order application acknowledgement message containing an ORC-1-order control value of OK. Then an unsolicited order message can be sent at a future time, containing an ORC with ORC-1-order control value of NA to provide the actual number assigned.\r\n\r\nb) By an order acknowledgement message containing an ORC-1-order control value of NA as described below.\r\n\r\nNA – The number assigned code allows the “other” application to notify the filler application of the newly-assigned filler order number. ORC-1-order control contains value of NA, ORC-2-placer order number (from the ORC with the SN value), and the newly-assigned filler order number. \r\nCode\tFrom\tORC-2-Placer Order Number\tORC-3-Filler Order Number\r\nSN\tfiller application\tplacer order number^filler application ID\tNull\r\nNA\tother application\tplacer order number^filler application ID\tfiller order number^filler application ID\r\nNote: Both the placer order number and the filler order number have the filler’s application ID\r\n\r\n(2) When the filler application needs to request an ORC-2-placer order number from some other application (e.g., Order Entry).\r\n\r\nSN – The send order number code provides a mechanism for the filler application to request an ORC-2-placer order number from another application (called “other” in the table below) by sending an order message containing an ORC-1-order control value of SN. This ORC has a null ORC-2-placer order number and an ORC-3-filler order number created by the filler application when the filler originates the order. \r\n\r\nThe order (SN type) message can be acknowledged by two methods:\r\na) By an order application acknowledgement message containing an ORC-1-order control value of OK. Then an unsolicited order message can be sent at a future time, containing an ORC-1-order control value of NA to provide the actual number assigned.\r\n \r\nb) By an order acknowledgement message containing an ORC-1-order control value of NA as described below.\r\nNA – The number assigned code allows the “other” application to notify the filler application of the newly-assigned ORC-2-placer order number. The ORC contains an ORC-1-order control value of NA, the newly-assigned ORC-2-placer order number, and the ORC-3-filler order number (from the ORC with the SN value).\r\nCode\tFrom\tORC-2-Placer Order Number\tORC-3-Filler Order Number\r\nSN\tfiller application\tnull\tfiller order number^filler application ID\r\nNA\tother application\tplacer order number^placer application ID\tfiller order number^filler application ID\r\nNote: The new ORC-2-placer order number has the placer’s application ID\r\n\r\n(3) When an application (not the filler application) wants to assign an ORC-3-filler order number for a new order.\r\nNW – When the application creating an order (not the filler application) wants to assign a filler order number for a new order.\r\nor \r\nRO – (RO following an RP). In this case, the “other” application completes ORC-3-filler order number, using the filler application ID as the second component of the filler order number.\r\nCode\tFrom\tORC-2-Placer Order Number\tORC-3-Filler Order Number\r\nNW or RO\tOther application to filler application\tplacer order number^placer application ID\tfiller order number^filler application ID","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. Er zijn drie omstandigheden waarin verzoeken van een aanvraagnummer (ORC-2 Placer aanvraagnummer of ORC-3 Filler aanvraagnummer): (1) Als de filler applicatie een ORC-3 Filler aanvraagnummer moet aanvragen van een centrale applicatie"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"NA","display":"Number assigned","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Nummer zugewiesen"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Nummer toegekend"}]},{"code":"NR","display":"Notification Received"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nSee comments for NA - Number Assigned.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. Zie opmerkingen voor NA - Nummer toegekend"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"NW","display":"New order/service","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Neuer Auftrag"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Nieuwe aanvraag/service"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"OC","display":"Order/service canceled","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag storniert"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service geannuleerd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"OD","display":"Order/service discontinued","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsausführung abgebrochen"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service afgebroken"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"OE","display":"Order/service released","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service vrijgegeven"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nOF directly responds to the placer system's request for a refill.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. OF is een direct antwoord op het verzoek voor herhaling van een placer system."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"OF","display":"Order/service refilled as requested","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service herhaald zoals gevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"OH","display":"Order/service held","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsbearbeitung ausgesetzt"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service aangehouden"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nSee comments for NA - Number Assigned.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. Zie opmerkingen voor NA - Nummer toegekend"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"OK","display":"Order/service accepted & OK","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag akzeptiert"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service geaccepteerd en OK"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nThese order control codes are used to communicate an order between systems where the order is intended for informational purposes. For example, an order that will be performed by a vendor outside the enterprise of communicating systems. The communicating systems may need to maintain information relative to the order for clinical continuity, but no actions to perform the ordered service are intended.\r\nOP represents an informational version of NW, PY represents the informational-only version of RO. NW and RO table notes also apply to OP and PY, respectively.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. Deze aanvraagbeheer codes worden gebruikt voor communicatie van aanvragen tussen systemen waarbij de aanvraag bedoeld is ter informatie. Een aanvraag wordt bijvoorbeeld uitgevoerd door een leverancier anders dan de communicerende systemen."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"OP","display":"Notification of order for outside dispense","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Notificatie van aanvraag voor verstrekking door derde"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"OR","display":"Released as requested","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsbearbeitung anweisungsgemäß wiederaufgenommen"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Vrijgegeven zoals gevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nThe parent (PA) and child (CH) order control codes allow the spawning of “child” orders from a “parent” order without changing the parent (original order). One or more ORC segments with an ORC-1-order control value of PA are followed by one or more ORC segments with an ORC-1-order control value of CH. Whether OBR segments must be present is determined by the value of ORC-6-response flag. \r\n\r\nFor example, suppose that a microbiology culture produced two organisms and corresponding susceptibility reports. Then the sequence of segments would be as follows: (see figure 4-4)\r\n\r\nThe assignment of placer order numbers in the parent-child paradigm depends on whether the placer or filler creates the child order and in the latter case, on whether the placer supports the SN/NA transaction. If the placer creates the child orders it will assign their placer order numbers according to its usual procedures. If the filler creates the child orders there are two possibilities: each child will inherit the placer order number of its parent, or the filler will use the SN/NA transaction to request that the placer assign a placer order number. In either case, the filler application creates the filler order numbers of the children according to its usual procedures.\r\n\r\nWhenever a child order is transmitted in a message the ORC segment’s ORC-8-parent is valued with the parent’s filler order number (if originating from the filler) and with the parent’s placer order number (if originating from the filler or if originating from the placer). \r\n\r\nThe parent child mechanism can be used to “expand” a parent order (e.g., an order for three EKGs on successive mornings).","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. De codes voor bovenliggende (PA) en onderliggende/deel (CH) ondersteunen het onderscheiden van \"onderliggende/deel\" aanvragen van een \"bovenliggende\" aanvraag zonder dat de bovenliggende (oorspronkelijke aanvraag) wijzigt. Een of meer ORC segmenten met een ORC-1 Aanvraagbeheer PA waarden worden gevolgd door"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"PA","display":"Parent order/service","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Hauptauftrag"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Bovenliggende aanvraag/service"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nPR indicates that this ORC is part of an ORU structure containing previous observation, which is embedded in the order.\r\n\r\nAt least two main use cases require that the complete results of the previous observations be transmitted with the order. \r\n\r\n•\tDiagnostic laboratories referring tests to another lab for either confirmation of results (HIV, etc.) or due to not being equipped to do the tests (genetic testing, etc.). \r\n\r\n•\tDiagnostic laboratories sending test results to Knowledge Bases for the automated generation of diagnostic comments for inclusion into the lab report.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. PR geeft aan dat deze ORC deel is van een ORU "}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"PR","display":"Previous Results with new order/service","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Vorige resultaten met nieuwe aanvraag/service"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nSee comments for OP - Notification of order for outside dispense.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicatie. Zie opmerkingen voor OP - Notificatie van aanvraag voor verstrekking door derde."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"PY","display":"Notification of replacement order for outside dispense","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Notificatie van vervangende aanvraag voor verstrekking door derde"}]},{"code":"RA","display":"Recommendation Accepted"},{"code":"RC","display":"Recommended Change"},{"code":"RD","display":"Recommendation Declined"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nThe observations-to-follow code is used to transmit patient-specific information with an order. An order detail segment (e.g., OBR) can be followed by one or more observation segments (OBX). Any observation that can be transmitted in an ORU message can be transmitted with this mechanism. When results are transmitted with an order, the results should immediately follow the order or orders that they support.\r\n\r\nThe following example shows the sequence of segments for three Pharmacy orders. It illustrates the use of the RE code:\r\nSegment\tOrder Control\tComment\r\nMSH\t\t\r\nPID\t\t\r\nORC\tNW\tFirst new order\r\nRXO\t\tFirst order segment\r\n\t\t\r\nORC\tNW\t2nd new order\r\nRXO\t\t2nd order segment\r\n[ORC\tRE\tPatient-specific observation, optional in V 2.2\r\n OBR]\t\tObservation OBR, optional in V 2.2\r\nOBX\t\tAn observation segment\r\nOBX\t\tAnother observation segment\r\nOBX\t\tAnother observation segment\r\nOBX\t\tAnother observation segment\r\n\t\t\r\nORC\tNW\t3rd order\r\nRXO\t\t3rd order segment\r\n\r\nIn this version of HL7, results can be transmitted with an order as one or more OBX segments without the necessity of including the ORC and OBR segments.\r\n\r\nObservations can be transmitted in an ORU message without using an ORC. There are times when it is necessary to transmit information not included in the OBR segments of the ORU message. In this case, it is recommended that the ORC be included in the ORU message.\r\n\r\nThe order control value of RE is required only in ORM messages to indicate that an order is followed by observation results (OBX). The RE code is not necessary in the ORU message because it is expected that the OBR segments can be followed by observation results (OBX).","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. Deze code wordt gebruikt voor het doorgeven van patiënt-specifieke informatie met een aanvraag. Een aanvraag-detailsegment (bijv. OBR) kan worden gevolgd door een of meer observatiesegmenten (OBX). Ieder observatie die kan worden ge"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"RE","display":"Observations/Performed Service to follow","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Untersuchungsergebnisse folgen (in späteren Segmenten dieser Nachricht)"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Observaties/uitgevoerde server volgen"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nRF accommodates requests by either the filler or the placer. The filler may be requesting refill authorization from the placer. A placer system may be requesting a refill to be done by the filler system.\r\n\r\nTypical responses include, but are not limited to: For a Filler request AF – Order/service refill request approval, DF – Order/service refill request denied; for a Placer request RE – Observations/Performed Service to follow, UF – Unable to refill.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. Deze code ondersteunt verzoeken door de filler of de placer. De filler kan een autorisatie voor herhaling vragen van de placer. Een placer-systeem kan een herhaling vragen van het filler-systeem. Meestal is het antwoord"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"RF","display":"Refill order/service request","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Herhaal aanvraag/service verzoek"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"RL","display":"Release previous hold","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsberabeitung wiederaufnehmen"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Geef vorige vastgehouden vrij"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nA replacement is the substitution of one or more orders for one or more previously ordered services.\r\n\r\nThe replaced orders are treated as though they were canceled. If and when an ordered service can be replaced are local site-specific determinations.\r\n\r\nUse the parent/child order control codes if the site specifies that the original order must remain intact. Do not use the replacement codes under this circumstance. \r\n\r\nFor each order to be replaced, use an ORC-1-order control value of RP (request for a replacement going to a filler) or RU (an unsolicited replacement created by the filler) used by the filler to notify the placer and/or other systems). By local agreement, the ORC segment (with RP or RU) may be followed by its original order detail segment. The ORC segments (with RP or RU) must be followed by an ORC segment with an ORC-1-order control value of RO (indicating the replacement order). By local agreement, the ORC with the RO value may be followed by an order detail segment. \r\n\r\nFor example, suppose that an ancillary application were replacing two OBR orders with three different orders. The sequence of segments would be as follows:\r\n\r\nSeg\tOrder Control\tComment\r\nORC\tRU\t1st replaced ORC\r\nOBR\t\t1st replaced order’s detail segment\r\n\t\t\r\nORC\tRU\t2nd replaced ORC\r\nOBR\t\t2nd replaced order’s detail segment\r\n\t\t\r\nORC\tRO\t1st replacement ORC\r\nOBR\t\t1st replacement order’s detail segment\r\n\t\t\r\nORC\tRO\t2nd replacement ORC\r\nOBR\t\t2nd replacement order’s detail segment\r\n\t\t\r\nORC\tRO\t3rd replacement ORC\r\nOBR\t\t3rd replacement order’s detail segment\r\n\r\nWhether the OBR segments must be present is determined by the value of ORC-6-response flag.\r\n\r\nThe described replacement method will handle all possible cases of replacement: one into one, many into one, one into many, and many into many. If the placer sent this request to the filler with two RPs, and this was a response back from the filler to the placer, the two RUs (replaced unsolicited) would be two RQs (replaced as requested). (see figure 4-3)\r\n\r\nSeg\tOrder Control\tComment\r\nORC\tRQ\t1st replaced ORC\r\nOBR\t\t1st replaced order’s detail segment\r\n\t\t\r\nORC\tRQ\t2nd replaced ORC\r\nOBR\t\t2nd replaced order’s detail segment\r\n\t\t\r\nORC\tRO\t1st replacement ORC\r\nOBR\t\t1st replacement order’s detail segment\r\n\t\t\r\nORC\tRO\t2nd replacement ORC\r\nOBR\t\t2nd replacement order’s detail segment\r\n\t\t\r\nORC\tRO\t3rd replacement ORC\r\nOBR\t\t3rd replacement order’s detail segment\r\n\r\nThe replacement order code is sent by the filler application to another application indicating the exact replacement ordered service. It is used with the RP and RU order control codes as described above.\r\n\r\nThe rules for the order numbers in ORC segments with an order control value of RO are determined by the replacement type (RP or RU).\r\n\r\nIn the case of the RU type (i.e., unsolicited replacement by the filler), the filler order number is generated as usual by the filler application. The placer order number is identical to the placer order number of the first transmitted ORC with an order control value of RU.\r\n\r\nIn the case of the RP type (i.e., a replacement request from another application to the filler), the placer order number is generated by the placer application using the procedure for new orders. The filler order number is generated by the filler application using the procedure identical for new orders.\r\n\r\nIf a replacement sequence is used in an ORU message (i.e., during results reporting), the following are the recommended segments to be used for the replacement orders:\r\n\r\nORC with an order control value of RO.\r\n\r\nAny OBR segments (can be replaced by any order detail segments).\r\n\r\nOptionally followed by observation result segments (OBX)\r\nNTE segments can appear after the OBR (or any order detail segment) or after an OBX segment as in a regular ORU message.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. Een vervanging is de substitutie van een of meer aanvragen voor een of meer eerder aangevraagde services. De vervangen aanvragen worden behandeld alsof ze zijn geannuleerd. Of en ondere welke omstandigheden een aanvraagde service vervangen kan worden hangt af van lokale "}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"RO","display":"Replacement order","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Ersatzauftrag"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Vervangende aanvraag"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nA replacement is the substitution of one or more orders for one or more previously ordered services. See comment 1 on RO – Replacement Order for further discussion.\r\n\r\nThe order replace request code permits the order filler to replace one or more new orders with one or more new orders, at the request of the placer application.\r\n\r\nThe rules for the order numbers in ORC segments with an order control value of RO are determined by the replacement type (RP or RU).\r\n\r\nIn the case of the RU type (i.e., unsolicited replacement by the filler), the filler order number is generated as usual by the filler application. The placer order number is identical to the placer order number of the first transmitted ORC with an order control value of RU.\r\n\r\nIn the case of the RP type (i.e., a replacement request from another application to the filler), the placer order number is generated by the placer application using the procedure for new orders. The filler order number is generated by the filler application using the procedure identical for new orders.\r\n\r\nIf a replacement sequence is used in an ORU message (i.e., during results reporting), the following are the recommended segments to be used for the replacement orders:\r\n\r\na) ORC with an order control value of RO\r\n\r\nb) Any OBR segments (can be replaced by any order detail segments)\r\n\r\nc) Optionally followed by observation result segments (OBX)\r\n\r\nd) NTE segments can appear after the OBR (or any order detail segment) or after an OBX segment as in a regular ORU message","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. Een vervanging is de substitutie van een of meer aanvragen voor eerder aangevraagde services. Zie opmerking 1 bij RO - Vervangende aanvraag voor verder discussie. De code voor vervangende aanvraag staat de filler toe om "}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"RP","display":"Order/service replace request","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag ersetzen"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aanvraag/service vervanging verzoek"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nA replacement is the substitution of one or more orders for one or more previously ordered services. See comment 1 on RO – Replacement Order for further discussion.\r\n\r\nThe order replace request code permits the order filler to replace one or more new orders with one or more new orders, at the request of the placer application.\r\n\r\nThe replacement order code is sent by the filler application to another application indicating the exact replacement ordered service. It is used with the RP and RU order control codes as described above.\r\n\r\nThe rules for the order numbers in ORC segments with an order control value of RO are determined by the replacement type (RP or RU).\r\n\r\nIn the case of the RU type (i.e., unsolicited replacement by the filler), the filler order number is generated as usual by the filler application. The placer order number is identical to the placer order number of the first transmitted ORC with an order control value of RU.\r\n\r\nIn the case of the RP type (i.e., a replacement request from another application to the filler), the placer order number is generated by the placer application using the procedure for new orders. The filler order number is generated by the filler application using the procedure identical for new orders.\r\n\r\nIf a replacement sequence is used in an ORU message (i.e., during results reporting), the following are the recommended segments to be used for the replacement orders:\r\n\r\na) ORC with an order control value of RO\r\n\r\nb) Any OBR segments (can be replaced by any order detail segments)\r\n\r\nc) Optionally followed by observation result segments (OBX)\r\n\r\nd) NTE segments can appear after the OBR (or any order detail segment) or after an OBX segment as in a regular ORU message","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. Een vervanging is de substitutie van een of meer aanvragen voor een of meer eerder aangevraagd services. Zie opmerking 1 bij RO - Vervangende aanvraag voor verder discussie. De code voor vervangende aanvraag staat de filler toe om "}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"RQ","display":"Replaced as requested","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag anweisungsgemäß ersetzt"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Vervangen zoals gevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nLeft in for backward compatibility. In the current version it is equivalent to an accept acknowledgment. The request-received code indicates that an order message has been received and will be processed later. The order has not yet undergone the processing that would permit a more exact response.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. Behouden vanwege backward compatibiliteit. In de huidige versie is deze equivalent aan een ontvangstbevestiging. De code RR geeft aan dat een aanvraagbericht is ontvangen en latere wordt verwerkt. De aanvraag heeft"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"RR","display":"Request received","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Anforderung erhalten"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Verzoek ontvangen"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nA replacement is the substitution of one or more orders for one or more previously ordered services. See comment 1 on RO – Replacement Order for further discussion.\r\n\r\nThe unsolicited replacement code permits the filler application to notify another application without being requested from the placer application.\r\n\r\nThe rules for the order numbers in ORC segments with an order control value of RO are determined by the replacement type (RP or RU).\r\n\r\nIn the case of the RU type (i.e., unsolicited replacement by the filler), the filler order number is generated as usual by the filler application. The placer order number is identical to the placer order number of the first transmitted ORC with an order control value of RU.\r\n\r\nIn the case of the RP type (i.e., a replacement request from another application to the filler), the placer order number is generated by the placer application using the procedure for new orders. The filler order number is generated by the filler application using the procedure identical for new orders.\r\n\r\nIf a replacement sequence is used in an ORU message (i.e., during results reporting), the following are the recommended segments to be used for the replacement orders:\r\n\r\na) ORC with an order control value of RO\r\n\r\nb) Any OBR segments (can be replaced by any order detail segments)\r\n\r\nc) Optionally followed by observation result segments (OBX)\r\n\r\nd) NTE segments can appear after the OBR (or any order detail segment) or after an OBX segment as in a regular ORU message","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. Een vervanging is de substitutie van een of meer aanvragen voor een of meer eerder aangevraagde services. Zie opmerking 1 bij RO - Vervangende aanvraag voor verder discussie. De code RU staat de filler applicatie toe om "}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"RU","display":"Replaced unsolicited","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag ersetzt (ohne Anweisung)"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Vervangen ongevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"SC","display":"Status changed","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Statusänderung"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Status gewijzigd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.\r\nSee comments for NA - Number Assigned.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties. Zie opmerkingen voor NA - Nummer toegekend."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"SN","display":"Send order/service number","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrags- bzw. Bearbeitungsnummer zuweisen / übermitteln"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Stuur aanvraag/service nummer"}]},{"code":"SQ","display":"Supplemented as requested"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"SR","display":"Response to send order/service status request","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsstatus (Antwort)"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Antwoord op stuur aanvraag/service status verzoek"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"SS","display":"Send order/service status request","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsstatus senden"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Stuur aanvraag/service status verzoek"}]},{"code":"SU","display":"Supplement this order"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nAn unable to accept code is used when a new order cannot be accepted by the filler. Possible reasons include requesting a prescription for a drug which the patient is allergic to or for an order which requires certain equipment resources which are not available such that the order cannot be filled. Note that this is different from the communication level acceptance as defined within the MSA segment.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. De code UA wordt gebruikt wanneer een nieuwe aanvraag niet worden geaccepteerd door de filler. Mogelijk redenen zijn voorschriften voor een medicijn waarvoor de patiënt allergisch is of een aanvraag waarvoor bepaalde apparatuur nodig is"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UA","display":"Unable to accept order/service","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsannahme nicht möglich"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kon aanvraag/service niet accepteren"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler or Placer Applications.\r\nAn unable-to-cancel code is used when the ordered service is at a point that it cannot be canceled by the placer or filler or when local rules prevent cancellation by the filler. The use of this code is dependent on the value of ORC-6-response flag.\r\nIf the filler initiated the request to cancel and the placer is unable to cancel while the filler cannot proceed with the fulfillment of that order, then the necessary communication to resolve the conflict is outside the scope of these messages.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. De code UC wordt gebruikt wanneer de aangevraagde service op een punt zit waarbij deze niet meer kan worden geannuleerd door de placer of de filler of als lokale regels annulering door de filler verhinderen. Gebruik van deze code is afhankelijk van de waarde"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UC","display":"Unable to cancel","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftragsstornierung nicht möglich"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kon niet annuleren"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler or Placer Applications.\r\nAn unable-to-discontinue code is used when the ordered service is at a point that it cannot be discontinued by the placer or filler or when local rules prevent discontinuance by the filler. The use of this code is dependent on the value of ORC-6-response flag.\r\nIf the filler initiated the request to discontinue and the placer is unable to discontinue while the filler cannot proceed with the fulfillment of that order, then the necessary communication to resolve the conflict is outside the scope of these messages.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler of placer applicaties. Deze code wordt gebruikt als de aangevraagde service op een punt zit dat afgebreken door de placer of filler niet meer mogelijk is of wanneer lokale regels afbreken door de filler verhinderen. Gebruik van deze code hangt af van"}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UD","display":"Unable to discontinue","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Abbrechen nicht möglich"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kon niet afbreken"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.\r\nNegative response to RF Refill order/service request, indicating that the receiving application was not able to complete the refill request.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties. Negatief antwoord op RF - Herhaal aanvraag/service verzoek, dat aangeeft dat de ontvangende applicatie het herhaalverzoek niet kon uitvoeren."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UF","display":"Unable to refill","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kon niet herhalen"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UH","display":"Unable to put on hold","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Aussetzen nicht möglich"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kon niet aanhouden"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UM","display":"Unable to replace","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Ersetzen nicht möglich"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kon niet vervangen"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer or Filler Applications.\r\nRefer to Chapter 12 Patient Care for complete discussion.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer of filler applicaties. Zie Hoofdstuk 12 Patient Care voor vollledige discussie."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UN","display":"Unlink order/service from patient care problem or goal","designation":[{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Ontkoppel aanvraag/service van patiënt zorgprobleem of doel"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UR","display":"Unable to release","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Wiederaufnahme nicht möglich"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kon niet vrijgeven"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"UX","display":"Unable to change","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Änderung nicht möglich"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Kon niet wijzigen"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Placer Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Placer applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"XO","display":"Change order/service request","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag ändern"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Wijzig aanvraag/service verzoek"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"XR","display":"Changed as requested","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag anweisungsgemäß geändert"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Gewijzigd zoals gevraagd"}]},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-concept-comments","valueString":"Filler Applications.","_valueString":{"extension":[{"extension":[{"url":"lang","valueString":"nl"},{"url":"content","valueString":"Filler applicaties."}],"url":"http://hl7.org/fhir/StructureDefinition/translation"}]}}],"code":"XX","display":"Order/service changed, unsol.","designation":[{"language":"de","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Auftrag geändert (ohne Anweisung)"},{"language":"nl","use":{"system":"http://terminology.hl7.org/CodeSystem/designation-usage","code":"display"},"value":"Order/service gewijzigd, ongevraagd"}]}]}