{"resourceType":"StructureDefinition","id":"de-ElementDefinition.mustSupport","meta":{"lastUpdated":"2018-12-27T22:37:54.724+11:00"},"url":"http://hl7.org/fhir/StructureDefinition/de-ElementDefinition.mustSupport","version":"4.0.0","name":"ElementDefinition.mustSupport","title":"ElementDefinition.mustSupport","status":"draft","experimental":true,"date":"2018-12-27T22:37:54+11:00","publisher":"HL7 FHIR Standard","contact":[{"telecom":[{"system":"url","value":"http://hl7.org/fhir"}]}],"description":"Data Element for ElementDefinition.mustSupport","purpose":"Data Elements are defined for each element to assist in questionnaire construction etc","fhirVersion":"4.0.0","mapping":[{"identity":"v2","uri":"http://hl7.org/v2","name":"HL7 v2 Mapping"},{"identity":"rim","uri":"http://hl7.org/v3","name":"RIM Mapping"},{"identity":"iso11179","uri":"http://metadata-standards.org/11179/","name":"ISO 11179"},{"identity":"dex","uri":"http://ihe.net/data-element-exchange","name":"IHE Data Element Exchange (DEX)"},{"identity":"loinc","uri":"http://loinc.org","name":"LOINC code for the element"}],"kind":"logical","abstract":false,"type":"ElementDefinition.mustSupport","baseDefinition":"http://hl7.org/fhir/StructureDefinition/Element","derivation":"specialization","snapshot":{"element":[{"id":"ElementDefinition.mustSupport","path":"ElementDefinition.mustSupport","short":"If the element must be supported","definition":"If true, implementations that produce or consume resources SHALL provide \"support\" for the element in some meaningful way.  If false, the element may be ignored and not supported. If false, whether to populate or use the data element in any way is at the discretion of the implementation.","comment":"\"Something useful\" is context dependent and impossible to describe in the base FHIR specification. For this reason, tue mustSupport flag is never set to true by the FHIR specification itself - it is only set to true in profiles.  A profile on a type can always make musSupport = true if it is false in the base type but cannot make mustSupport = false if it is true in the base type.   This is done in [Resource Profiles](profiling.html#mustsupport), where the profile labels an element as mustSupport=true. When a profile does this, it SHALL also make clear exactly what kind of \"support\" is required, as this can mean many things.    Note that an element that has the property IsModifier is not necessarily a \"key\" element (e.g. one of the important elements to make use of the resource), nor is it automatically mustSupport - however both of these things are more likely to be true for IsModifier elements than for other elements.","requirements":"Allows a profile to set expectations for system capabilities beyond merely respecting cardinality constraints.","min":0,"max":"1","base":{"path":"ElementDefinition.mustSupport","min":0,"max":"1"},"type":[{"code":"boolean"}],"meaningWhenMissing":"In a base type, where the element is being defined for the first time, the element is assumed to be mustSupport = false. In a profile (a constraint on an existing type), if mustSupport is not specific in either the differentil or the snapshot, the mustSupport value is not changed fro the base definition. Not, though, that the snapshot SHOULD always populate the mustSuppot value","isModifier":false,"isSummary":true,"mapping":[{"identity":"rim","map":"N/A (MIF territory)"},{"identity":"iso11179","map":"??"}]}]}}