{"resourceType":"CodeSystem","id":"v3-ParticipationType","meta":{"lastUpdated":"2016-11-11T00:00:00.000+11:00"},"text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n            <p>Release Date: 2016-11-11</p>\n\n            <table class=\"grid\">\n \n              <tr>\n                <td>\n                  <b>Level</b>\n                </td>\n                <td>\n                  <b>Code</b>\n                </td>\n                <td>\n                  <b>Display</b>\n                </td>\n                <td>\n                  <b>Definition</b>\n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>PART\n                  <a name=\"PART\"> </a>\n                </td>\n                <td>Participation</td>\n                <td>\n                        Indicates that the target of the participation is involved in some manner in the act, but does not qualify how.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_ParticipationAncillary)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ParticipationAncillary\"> </a>\n                </td>\n                <td>\n                        Participations related, but not primary to an act. The Referring, Admitting, and Discharging practitioners must be the same person as those authoring the ControlAct event for their respective trigger events.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ADM\n                  <a name=\"ADM\"> </a>\n                </td>\n                <td>admitter</td>\n                <td>\n                        The practitioner who is responsible for admitting a patient to a patient encounter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ATND\n                  <a name=\"ATND\"> </a>\n                </td>\n                <td>attender</td>\n                <td>\n                        The practitioner that has responsibility for overseeing a patient's care during a patient encounter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CALLBCK\n                  <a name=\"CALLBCK\"> </a>\n                </td>\n                <td>callback contact</td>\n                <td>\n                        A person or organization who should be contacted for follow-up questions about the act in place of the author.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CON\n                  <a name=\"CON\"> </a>\n                </td>\n                <td>consultant</td>\n                <td>\n                        An advisor participating in the service by performing evaluations and making recommendations.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DIS\n                  <a name=\"DIS\"> </a>\n                </td>\n                <td>discharger</td>\n                <td>\n                        The practitioner who is responsible for the discharge of a patient from a patient encounter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ESC\n                  <a name=\"ESC\"> </a>\n                </td>\n                <td>escort</td>\n                <td>\n                        Only with Transportation services.  A person who escorts the patient.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    REF\n                  <a name=\"REF\"> </a>\n                </td>\n                <td>referrer</td>\n                <td>\n                        A person having referred the subject of the service to the performer (referring physician).  Typically, a referring physician will receive a report.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_ParticipationInformationGenerator)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ParticipationInformationGenerator\"> </a>\n                </td>\n                <td>\n                        Parties that may or should contribute or have contributed information to the Act. Such information includes information leading to the decision to perform the Act and how to perform the Act (e.g., consultant), information that the Act itself seeks to reveal (e.g., informant of clinical history), or information about what Act was performed (e.g., informant witness).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    AUT\n                  <a name=\"AUT\"> </a>\n                </td>\n                <td>author (originator)</td>\n                <td>\n                        \n                           Definition: A party that originates the Act and therefore has responsibility for the information given in the Act and ownership of this Act.\n                  <br/>\n\n                        \n                           Example: the report writer, the person writing the act definition, the guideline author, the placer of an order, the EKG cart (device) creating a report etc. Every Act should have an author. Authorship is regardless of mood always actual authorship. \n                  <br/>\n\n                        Examples of such policies might include:\n                  <br/>\n\n                        \n                           \n                              The author and anyone they explicitly delegate may update the report;\n                  <br/>\n\n                           \n                           \n                              All administrators within the same clinic may cancel and reschedule appointments created by other administrators within that clinic;\n                  <br/>\n\n                           \n                        \n                        A party that is neither an author nor a party who is extended authorship maintenance rights by policy, may only amend, reverse, override, replace, or follow up in other ways on this Act, whereby the Act remains intact and is linked to another Act authored by that other party.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    INF\n                  <a name=\"INF\"> </a>\n                </td>\n                <td>informant</td>\n                <td>\n                        A source of reported information (e.g., a next of kin who answers questions about the patient's history).  For history questions, the patient is logically an informant, yet the informant of history questions is implicitly the subject.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    TRANS\n                  <a name=\"TRANS\"> </a>\n                </td>\n                <td>Transcriber</td>\n                <td>\n                        An entity entering the data into the originating system. The data entry entity is collected optionally for internal quality control purposes. This includes the transcriptionist for dictated text transcribed into electronic form.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      ENT\n                  <a name=\"ENT\"> </a>\n                </td>\n                <td>data entry person</td>\n                <td>\n                        A person entering the data into the originating system.  The data entry person is collected optionally for internal quality control purposes.  This includes the transcriptionist for dictated text.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    WIT\n                  <a name=\"WIT\"> </a>\n                </td>\n                <td>witness</td>\n                <td>\n                        Only with service events.  A person witnessing the action happening without doing anything.  A witness is not necessarily aware, much less approves of anything stated in the service event.  Example for a witness is students watching an operation or an advanced directive witness.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  CST\n                  <a name=\"CST\"> </a>\n                </td>\n                <td>custodian</td>\n                <td>\n                        An entity (person, organization or device) that is in charge of maintaining the information of this act (e.g., who maintains the report or the master service catalog item, etc.).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  DIR\n                  <a name=\"DIR\"> </a>\n                </td>\n                <td>direct target</td>\n                <td>\n                        Target participant  that is substantially present in the act  and which is directly involved in the action (includes consumed material, devices, etc.).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ALY\n                  <a name=\"ALY\"> </a>\n                </td>\n                <td>analyte</td>\n                <td>\n                        The target of an Observation action. Links an observation to a Role whose player is the substance or most specific component entity (material, micro-organism, etc.) being measured within the subject.\n                  <br/>\n\n                        \n                           Examples: A &quot;plasma porcelain substance concentration&quot; has analyte a Role with player substance Entity &quot;porcelain&quot;.\n                  <br/>\n\n                        \n                           UsageNotes: The Role that this participation connects to may be any Role whose player is that substance measured. Very often, the scoper may indicate the system in which the component is being measured. E.g., for &quot;plasma porcelain&quot; the scoper could be &quot;Plasma&quot;.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    BBY\n                  <a name=\"BBY\"> </a>\n                </td>\n                <td>baby</td>\n                <td>\n                        In an obstetric service, the baby.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CAT\n                  <a name=\"CAT\"> </a>\n                </td>\n                <td>catalyst</td>\n                <td>\n                        The catalyst of a chemical reaction, such as an enzyme or a platinum surface. In biochemical reactions, connects the enzyme with the molecular interaction\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CSM\n                  <a name=\"CSM\"> </a>\n                </td>\n                <td>consumable</td>\n                <td>\n                        Participant material that is taken up, diminished, altered, or disappears in the act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      TPA\n                  <a name=\"TPA\"> </a>\n                </td>\n                <td>therapeutic agent</td>\n                <td>\n                        Something incorporated in the subject of a therapy service to achieve a physiologic effect (e.g., heal, relieve, provoke a condition, etc.) on the subject.  In an administration service the therapeutic agent is a consumable, in a preparation or dispense service, it is a product.  Thus, consumable or product must be specified in accordance with the kind of service.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DEV\n                  <a name=\"DEV\"> </a>\n                </td>\n                <td>device</td>\n                <td>\n                        Participant used in performing the act without being substantially affected by the act (i.e. durable or inert with respect to that particular service).\n                  <br/>\n\n                        \n                           Examples: monitoring equipment, tools, but also access/drainage lines, prostheses, pace maker, etc.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      NRD\n                  <a name=\"NRD\"> </a>\n                </td>\n                <td>non-reuseable device</td>\n                <td>\n                        A device that changes ownership due to the service, e.g., a pacemaker, a prosthesis, an insulin injection equipment (pen), etc.  Such material may need to be restocked after he service.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      RDV\n                  <a name=\"RDV\"> </a>\n                </td>\n                <td>reusable device</td>\n                <td>\n                        A device that does not change ownership due to the service, i.e., a surgical instrument or tool or an endoscope.  The distinction between reuseable and non-reuseable must be made in order to know whether material must be re-stocked.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DON\n                  <a name=\"DON\"> </a>\n                </td>\n                <td>donor</td>\n                <td>\n                        In some organ transplantation services and rarely in transfusion services a donor will be a target participant in the service.  However, in most cases transplantation is decomposed in three services: explantation, transport, and implantation.  The identity of the donor (recipient) is often irrelevant for the explantation (implantation) service.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    EXPAGNT\n                  <a name=\"EXPAGNT\"> </a>\n                </td>\n                <td>ExposureAgent</td>\n                <td>\n                        \n                           Description: The entity playing the associated role is the physical (including energy), chemical or biological substance that is participating in the exposure.  For example in communicable diseases, the associated playing entity is the disease causing pathogen.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    EXPART\n                  <a name=\"EXPART\"> </a>\n                </td>\n                <td>ExposureParticipation</td>\n                <td>\n                        \n                           Description:Direct participation in an exposure act where it is unknown that the participant is the source or subject of the exposure.  If the participant is known to be the contact of an exposure then the SBJ participation type should be used.  If the participant is known to be the source then the EXSRC participation type should be used.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      EXPTRGT\n                  <a name=\"EXPTRGT\"> </a>\n                </td>\n                <td>ExposureTarget</td>\n                <td>\n                        \n                           Description: The entity playing the associated role is the target (contact) of exposure.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      EXSRC\n                  <a name=\"EXSRC\"> </a>\n                </td>\n                <td>ExposureSource</td>\n                <td>\n                        \n                           Description:The entity playing the associated role is the source of exposure.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PRD\n                  <a name=\"PRD\"> </a>\n                </td>\n                <td>product</td>\n                <td>\n                        Participant material that is brought forth (produced) in the act (e.g., specimen in a specimen collection, access or drainage in a placement service, medication package in a dispense service). It does not matter whether the material produced had existence prior to the service, or whether it is created in the service (e.g., in supply services the product is taken from a stock). \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SBJ\n                  <a name=\"SBJ\"> </a>\n                </td>\n                <td>subject</td>\n                <td>\n                        The principle target on which the action happens.\n                  <br/>\n\n                        \n                           Examples: The patient in physical examination, a specimen in a lab observation. May also be a patient's family member (teaching) or a device or room (cleaning, disinfecting, housekeeping). \n                  <br/>\n\n                        \n                           UsageNotes: Not all direct targets are subjects. Consumables and devices used as tools for an act are not subjects. However, a device may be a subject of a maintenance action.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SPC\n                  <a name=\"SPC\"> </a>\n                </td>\n                <td>specimen</td>\n                <td>\n                        The subject of non-clinical (e.g. laboratory) observation services is a specimen.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  IND\n                  <a name=\"IND\"> </a>\n                </td>\n                <td>indirect target</td>\n                <td>\n                        Target that is not substantially present in the act and which is not directly affected by the act, but which will be a focus of the record or documentation of the act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    BEN\n                  <a name=\"BEN\"> </a>\n                </td>\n                <td>beneficiary</td>\n                <td>\n                        Target on behalf of whom the service happens, but that is not necessarily present in the service.  Can occur together with direct target to indicate that a target is both, as in the case where the patient is the indirect beneficiary of a service rendered to a family member, e.g. counseling or given home care instructions.  This concept includes a participant, such as a covered party, who derives benefits from a service act covered by a coverage act.\n                  <br/>\n\n                        Note that the semantic role of the intended recipient who benefits from the happening denoted by the verb in the clause.  Thus, a patient who has no coverage under a policy or program may be a beneficiary of a health service while not being the beneficiary of coverage for that service.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CAGNT\n                  <a name=\"CAGNT\"> </a>\n                </td>\n                <td>causative agent</td>\n                <td>\n                        Definition: A factor, such as a microorganism, chemical substance, or form of radiation, whose presence, excessive presence, or (in deficiency diseases) relative absence is essential, in whole or in part, for the occurrence of a condition.\n                  <br/>\n\n                        Constraint:  The use of this participation is limited to observations.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    COV\n                  <a name=\"COV\"> </a>\n                </td>\n                <td>coverage target</td>\n                <td>\n                        The target participation for an individual in a health care coverage act in which the target role is either the policy holder of the coverage, or a covered party under the coverage.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GUAR\n                  <a name=\"GUAR\"> </a>\n                </td>\n                <td>guarantor party</td>\n                <td>\n                        The target person or organization contractually recognized by the issuer as a participant who has assumed fiscal responsibility for another personaTMs financial obligations by guaranteeing to pay for amounts owed to a particular account\n                  <br/>\n\n                        \n                           Example:The subscriber of the patientaTMs health insurance policy signs a contract with the provider to be fiscally responsible for the patient billing account balance amount owed.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    HLD\n                  <a name=\"HLD\"> </a>\n                </td>\n                <td>holder</td>\n                <td>\n                        Participant who posses an instrument such as a financial contract (insurance policy) usually based on some agreement with the author.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    RCT\n                  <a name=\"RCT\"> </a>\n                </td>\n                <td>record target</td>\n                <td>\n                        The record target indicates whose medical record holds the documentation of this act.  This is especially important when the subject of a service is not the patient himself.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    RCV\n                  <a name=\"RCV\"> </a>\n                </td>\n                <td>receiver</td>\n                <td>\n                        The person (or organization) who receives the product of an Act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  IRCP\n                  <a name=\"IRCP\"> </a>\n                </td>\n                <td>information recipient</td>\n                <td>\n                        A party, who may or should receive or who has recieved the Act or subsequent or derivative information of that Act. Information recipient is inert, i.e., independent of mood.&quot; Rationale: this is a generalization of a too diverse family that the definition can't be any more specific, and the concept is abstract so one of the specializations should be used.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    NOT\n                  <a name=\"NOT\"> </a>\n                </td>\n                <td>ugent notification contact</td>\n                <td>\n                        An information recipient to notify for urgent matters about this Act. (e.g., in a laboratory order, critical results are being called by phone right away, this is the contact to call; or for an inpatient encounter, a next of kin to notify when the patient becomes critically ill).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PRCP\n                  <a name=\"PRCP\"> </a>\n                </td>\n                <td>primary information recipient</td>\n                <td>\n                        Information recipient to whom an act statement is primarily directed. E.g., a primary care provider receiving a discharge letter from a hospitalist, a health department receiving information on a suspected case of infectious disease. Multiple of these participations may exist on the same act without requiring that recipients be ranked as primary vs. secondary.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    REFB\n                  <a name=\"REFB\"> </a>\n                </td>\n                <td>Referred By</td>\n                <td>\n                        A participant (e.g. provider) who has referred the subject of an act (e.g. patient).\n                  <br/>\n\n                        Typically, a referred by participant will provide a report (e.g. referral).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    REFT\n                  <a name=\"REFT\"> </a>\n                </td>\n                <td>Referred to</td>\n                <td>\n                        The person who receives the patient\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    TRC\n                  <a name=\"TRC\"> </a>\n                </td>\n                <td>tracker</td>\n                <td>\n                        A secondary information recipient, who receives copies (e.g., a primary care provider receiving copies of results as ordered by specialist).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  LOC\n                  <a name=\"LOC\"> </a>\n                </td>\n                <td>location</td>\n                <td>\n                        The facility where the service is done.  May be a static building (or room therein) or a moving location (e.g., ambulance, helicopter, aircraft, train, truck, ship, etc.)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DST\n                  <a name=\"DST\"> </a>\n                </td>\n                <td>destination</td>\n                <td>\n                        The destination for services.  May be a static building (or room therein) or a movable facility (e.g., ship).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ELOC\n                  <a name=\"ELOC\"> </a>\n                </td>\n                <td>entry location</td>\n                <td>\n                        A location where data about an Act was entered.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ORG\n                  <a name=\"ORG\"> </a>\n                </td>\n                <td>origin</td>\n                <td>\n                        The location of origin for services.  May be a static building (or room therein) or a movable facility (e.g., ship).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    RML\n                  <a name=\"RML\"> </a>\n                </td>\n                <td>remote</td>\n                <td>\n                        Some services take place at multiple concurrent locations (e.g., telemedicine, telephone consultation).  The location where the principal performing actor is located is taken as the primary location (LOC) while the other location(s) are considered &quot;remote.&quot;\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    VIA\n                  <a name=\"VIA\"> </a>\n                </td>\n                <td>via</td>\n                <td>\n                        For services, an intermediate location that specifies a path between origin an destination.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  PRF\n                  <a name=\"PRF\"> </a>\n                </td>\n                <td>performer</td>\n                <td>\n                        \n                           Definition: A person, non-person living subject, organization or device that who actually and principally carries out the action. Device should only be assigned as a performer in circumstances where the device is performing independent of human intervention.  Need not be the principal responsible actor.\n                  <br/>\n\n                        \n                           Exampe: A surgery resident operating under supervision of attending surgeon, a search and rescue dog locating survivors, an electronic laboratory analyzer or the laboratory discipline requested to perform a laboratory test. The performer may also be the patient in self-care, e.g. fingerstick blood sugar. The traditional order filler is a performer. This information should accompany every service event.\n                  <br/>\n\n                        \n                           Note: that existing HL7 designs assign an organization as the playing entity of the Role that is the performer.  These designs should be revised in subsequent releases to make this the scooping entity for the role involved.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DIST\n                  <a name=\"DIST\"> </a>\n                </td>\n                <td>distributor</td>\n                <td>\n                        Distributes material used in or generated during the act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PPRF\n                  <a name=\"PPRF\"> </a>\n                </td>\n                <td>primary performer</td>\n                <td>\n                        The principal or primary performer of the act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SPRF\n                  <a name=\"SPRF\"> </a>\n                </td>\n                <td>secondary performer</td>\n                <td>\n                        A person assisting in an act through his substantial presence and involvement   This includes: assistants, technicians, associates, or whatever the job titles may be.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  RESP\n                  <a name=\"RESP\"> </a>\n                </td>\n                <td>responsible party</td>\n                <td>\n                        The person or organization that has primary responsibility for the act.  The responsible party is not necessarily present in an action, but is accountable for the action through the power to delegate, and the duty to review actions with the performing actor after the fact.  This responsibility may be ethical, legal, contractual, fiscal, or fiduciary in nature.\n                  <br/>\n\n                        \n                           Example: A person who is the head of a biochemical laboratory; a sponsor for a policy or government program.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  VRF\n                  <a name=\"VRF\"> </a>\n                </td>\n                <td>verifier</td>\n                <td>\n                        A person who verifies the correctness and appropriateness of the service (plan, order, event, etc.) and hence takes on accountability.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    AUTHEN\n                  <a name=\"AUTHEN\"> </a>\n                </td>\n                <td>authenticator</td>\n                <td>\n                        A verifier who attests to the accuracy of an act, but who does not have privileges to legally authenticate the act. An example would be a resident physician who sees a patient and dictates a note, then later signs it. Their signature constitutes an authentication.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    LA\n                  <a name=\"LA\"> </a>\n                </td>\n                <td>legal authenticator</td>\n                <td>\n                        A verifier who legally authenticates the accuracy of an act. An example would be a staff physician who sees a patient and dictates a note, then later signs it. Their signature constitutes a legal authentication.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n\n            </table>\n\n          </div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-ballot-status","valueString":"External"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://hl7.org/fhir/v3/ParticipationType","identifier":{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.5.90"},"version":"2016-11-11","name":"v3 Code System ParticipationType","status":"active","experimental":false,"date":"2016-11-11T00:00:00+11:00","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":"**** MISSING DEFINITIONS ****","caseSensitive":true,"valueSet":"http://hl7.org/fhir/ValueSet/v3-ParticipationType","hierarchyMeaning":"is-a","content":"complete","property":[{"code":"notSelectable","uri":"http://hl7.org/fhir/concept-properties#notSelectable","description":"Indicates that the code is abstract - only intended to be used as a selector for other concepts","type":"boolean"},{"code":"inactive","uri":"http://hl7.org/fhir/concept-properties#inactive","description":"True if the concept is not considered active - e.g. not a valid concept any more","type":"boolean"}],"concept":[{"code":"PART","display":"Participation","definition":"Indicates that the target of the participation is involved in some manner in the act, but does not qualify how.","concept":[{"code":"_ParticipationAncillary","display":"ParticipationAncillary","definition":"Participations related, but not primary to an act. The Referring, Admitting, and Discharging practitioners must be the same person as those authoring the ControlAct event for their respective trigger events.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"ADM","display":"admitter","definition":"The practitioner who is responsible for admitting a patient to a patient encounter."},{"code":"ATND","display":"attender","definition":"The practitioner that has responsibility for overseeing a patient's care during a patient encounter."},{"code":"CALLBCK","display":"callback contact","definition":"A person or organization who should be contacted for follow-up questions about the act in place of the author."},{"code":"CON","display":"consultant","definition":"An advisor participating in the service by performing evaluations and making recommendations."},{"code":"DIS","display":"discharger","definition":"The practitioner who is responsible for the discharge of a patient from a patient encounter."},{"code":"ESC","display":"escort","definition":"Only with Transportation services.  A person who escorts the patient."},{"code":"REF","display":"referrer","definition":"A person having referred the subject of the service to the performer (referring physician).  Typically, a referring physician will receive a report."}]},{"code":"_ParticipationInformationGenerator","display":"ParticipationInformationGenerator","definition":"Parties that may or should contribute or have contributed information to the Act. Such information includes information leading to the decision to perform the Act and how to perform the Act (e.g., consultant), information that the Act itself seeks to reveal (e.g., informant of clinical history), or information about what Act was performed (e.g., informant witness).","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"AUT","display":"author (originator)","definition":"Definition: A party that originates the Act and therefore has responsibility for the information given in the Act and ownership of this Act.\r\n\n                        \n                           Example: the report writer, the person writing the act definition, the guideline author, the placer of an order, the EKG cart (device) creating a report etc. Every Act should have an author. Authorship is regardless of mood always actual authorship. \r\n\n                        Examples of such policies might include:\r\n\n                        \n                           \n                              The author and anyone they explicitly delegate may update the report;\r\n\n                           \n                           \n                              All administrators within the same clinic may cancel and reschedule appointments created by other administrators within that clinic;\r\n\n                           \n                        \n                        A party that is neither an author nor a party who is extended authorship maintenance rights by policy, may only amend, reverse, override, replace, or follow up in other ways on this Act, whereby the Act remains intact and is linked to another Act authored by that other party."},{"code":"INF","display":"informant","definition":"A source of reported information (e.g., a next of kin who answers questions about the patient's history).  For history questions, the patient is logically an informant, yet the informant of history questions is implicitly the subject."},{"code":"TRANS","display":"Transcriber","definition":"An entity entering the data into the originating system. The data entry entity is collected optionally for internal quality control purposes. This includes the transcriptionist for dictated text transcribed into electronic form.","concept":[{"code":"ENT","display":"data entry person","definition":"A person entering the data into the originating system.  The data entry person is collected optionally for internal quality control purposes.  This includes the transcriptionist for dictated text."}]},{"code":"WIT","display":"witness","definition":"Only with service events.  A person witnessing the action happening without doing anything.  A witness is not necessarily aware, much less approves of anything stated in the service event.  Example for a witness is students watching an operation or an advanced directive witness."}]},{"code":"CST","display":"custodian","definition":"An entity (person, organization or device) that is in charge of maintaining the information of this act (e.g., who maintains the report or the master service catalog item, etc.)."},{"code":"DIR","display":"direct target","definition":"Target participant  that is substantially present in the act  and which is directly involved in the action (includes consumed material, devices, etc.).","concept":[{"code":"ALY","display":"analyte","definition":"The target of an Observation action. Links an observation to a Role whose player is the substance or most specific component entity (material, micro-organism, etc.) being measured within the subject.\r\n\n                        \n                           Examples: A \"plasma porcelain substance concentration\" has analyte a Role with player substance Entity \"porcelain\".\r\n\n                        \n                           UsageNotes: The Role that this participation connects to may be any Role whose player is that substance measured. Very often, the scoper may indicate the system in which the component is being measured. E.g., for \"plasma porcelain\" the scoper could be \"Plasma\"."},{"code":"BBY","display":"baby","definition":"In an obstetric service, the baby."},{"code":"CAT","display":"catalyst","definition":"The catalyst of a chemical reaction, such as an enzyme or a platinum surface. In biochemical reactions, connects the enzyme with the molecular interaction"},{"code":"CSM","display":"consumable","definition":"Participant material that is taken up, diminished, altered, or disappears in the act.","concept":[{"code":"TPA","display":"therapeutic agent","definition":"Something incorporated in the subject of a therapy service to achieve a physiologic effect (e.g., heal, relieve, provoke a condition, etc.) on the subject.  In an administration service the therapeutic agent is a consumable, in a preparation or dispense service, it is a product.  Thus, consumable or product must be specified in accordance with the kind of service.","property":[{"code":"inactive","valueBoolean":true}]}]},{"code":"DEV","display":"device","definition":"Participant used in performing the act without being substantially affected by the act (i.e. durable or inert with respect to that particular service).\r\n\n                        \n                           Examples: monitoring equipment, tools, but also access/drainage lines, prostheses, pace maker, etc.","concept":[{"code":"NRD","display":"non-reuseable device","definition":"A device that changes ownership due to the service, e.g., a pacemaker, a prosthesis, an insulin injection equipment (pen), etc.  Such material may need to be restocked after he service."},{"code":"RDV","display":"reusable device","definition":"A device that does not change ownership due to the service, i.e., a surgical instrument or tool or an endoscope.  The distinction between reuseable and non-reuseable must be made in order to know whether material must be re-stocked."}]},{"code":"DON","display":"donor","definition":"In some organ transplantation services and rarely in transfusion services a donor will be a target participant in the service.  However, in most cases transplantation is decomposed in three services: explantation, transport, and implantation.  The identity of the donor (recipient) is often irrelevant for the explantation (implantation) service."},{"code":"EXPAGNT","display":"ExposureAgent","definition":"Description: The entity playing the associated role is the physical (including energy), chemical or biological substance that is participating in the exposure.  For example in communicable diseases, the associated playing entity is the disease causing pathogen."},{"code":"EXPART","display":"ExposureParticipation","definition":"Description:Direct participation in an exposure act where it is unknown that the participant is the source or subject of the exposure.  If the participant is known to be the contact of an exposure then the SBJ participation type should be used.  If the participant is known to be the source then the EXSRC participation type should be used.","concept":[{"code":"EXPTRGT","display":"ExposureTarget","definition":"Description: The entity playing the associated role is the target (contact) of exposure."},{"code":"EXSRC","display":"ExposureSource","definition":"Description:The entity playing the associated role is the source of exposure."}]},{"code":"PRD","display":"product","definition":"Participant material that is brought forth (produced) in the act (e.g., specimen in a specimen collection, access or drainage in a placement service, medication package in a dispense service). It does not matter whether the material produced had existence prior to the service, or whether it is created in the service (e.g., in supply services the product is taken from a stock)."},{"code":"SBJ","display":"subject","definition":"The principle target on which the action happens.\r\n\n                        \n                           Examples: The patient in physical examination, a specimen in a lab observation. May also be a patient's family member (teaching) or a device or room (cleaning, disinfecting, housekeeping). \r\n\n                        \n                           UsageNotes: Not all direct targets are subjects. Consumables and devices used as tools for an act are not subjects. However, a device may be a subject of a maintenance action.","concept":[{"code":"SPC","display":"specimen","definition":"The subject of non-clinical (e.g. laboratory) observation services is a specimen."}]}]},{"code":"IND","display":"indirect target","definition":"Target that is not substantially present in the act and which is not directly affected by the act, but which will be a focus of the record or documentation of the act.","concept":[{"code":"BEN","display":"beneficiary","definition":"Target on behalf of whom the service happens, but that is not necessarily present in the service.  Can occur together with direct target to indicate that a target is both, as in the case where the patient is the indirect beneficiary of a service rendered to a family member, e.g. counseling or given home care instructions.  This concept includes a participant, such as a covered party, who derives benefits from a service act covered by a coverage act.\r\n\n                        Note that the semantic role of the intended recipient who benefits from the happening denoted by the verb in the clause.  Thus, a patient who has no coverage under a policy or program may be a beneficiary of a health service while not being the beneficiary of coverage for that service."},{"code":"CAGNT","display":"causative agent","definition":"Definition: A factor, such as a microorganism, chemical substance, or form of radiation, whose presence, excessive presence, or (in deficiency diseases) relative absence is essential, in whole or in part, for the occurrence of a condition.\r\n\n                        Constraint:  The use of this participation is limited to observations."},{"code":"COV","display":"coverage target","definition":"The target participation for an individual in a health care coverage act in which the target role is either the policy holder of the coverage, or a covered party under the coverage."},{"code":"GUAR","display":"guarantor party","definition":"The target person or organization contractually recognized by the issuer as a participant who has assumed fiscal responsibility for another personaTMs financial obligations by guaranteeing to pay for amounts owed to a particular account\r\n\n                        \n                           Example:The subscriber of the patientaTMs health insurance policy signs a contract with the provider to be fiscally responsible for the patient billing account balance amount owed."},{"code":"HLD","display":"holder","definition":"Participant who posses an instrument such as a financial contract (insurance policy) usually based on some agreement with the author."},{"code":"RCT","display":"record target","definition":"The record target indicates whose medical record holds the documentation of this act.  This is especially important when the subject of a service is not the patient himself."},{"code":"RCV","display":"receiver","definition":"The person (or organization) who receives the product of an Act."}]},{"code":"IRCP","display":"information recipient","definition":"A party, who may or should receive or who has recieved the Act or subsequent or derivative information of that Act. Information recipient is inert, i.e., independent of mood.\" Rationale: this is a generalization of a too diverse family that the definition can't be any more specific, and the concept is abstract so one of the specializations should be used.","concept":[{"code":"NOT","display":"ugent notification contact","definition":"An information recipient to notify for urgent matters about this Act. (e.g., in a laboratory order, critical results are being called by phone right away, this is the contact to call; or for an inpatient encounter, a next of kin to notify when the patient becomes critically ill)."},{"code":"PRCP","display":"primary information recipient","definition":"Information recipient to whom an act statement is primarily directed. E.g., a primary care provider receiving a discharge letter from a hospitalist, a health department receiving information on a suspected case of infectious disease. Multiple of these participations may exist on the same act without requiring that recipients be ranked as primary vs. secondary."},{"code":"REFB","display":"Referred By","definition":"A participant (e.g. provider) who has referred the subject of an act (e.g. patient).\r\n\n                        Typically, a referred by participant will provide a report (e.g. referral)."},{"code":"REFT","display":"Referred to","definition":"The person who receives the patient"},{"code":"TRC","display":"tracker","definition":"A secondary information recipient, who receives copies (e.g., a primary care provider receiving copies of results as ordered by specialist)."}]},{"code":"LOC","display":"location","definition":"The facility where the service is done.  May be a static building (or room therein) or a moving location (e.g., ambulance, helicopter, aircraft, train, truck, ship, etc.)","concept":[{"code":"DST","display":"destination","definition":"The destination for services.  May be a static building (or room therein) or a movable facility (e.g., ship)."},{"code":"ELOC","display":"entry location","definition":"A location where data about an Act was entered."},{"code":"ORG","display":"origin","definition":"The location of origin for services.  May be a static building (or room therein) or a movable facility (e.g., ship)."},{"code":"RML","display":"remote","definition":"Some services take place at multiple concurrent locations (e.g., telemedicine, telephone consultation).  The location where the principal performing actor is located is taken as the primary location (LOC) while the other location(s) are considered \"remote.\""},{"code":"VIA","display":"via","definition":"For services, an intermediate location that specifies a path between origin an destination."}]},{"code":"PRF","display":"performer","definition":"Definition: A person, non-person living subject, organization or device that who actually and principally carries out the action. Device should only be assigned as a performer in circumstances where the device is performing independent of human intervention.  Need not be the principal responsible actor.\r\n\n                        \n                           Exampe: A surgery resident operating under supervision of attending surgeon, a search and rescue dog locating survivors, an electronic laboratory analyzer or the laboratory discipline requested to perform a laboratory test. The performer may also be the patient in self-care, e.g. fingerstick blood sugar. The traditional order filler is a performer. This information should accompany every service event.\r\n\n                        \n                           Note: that existing HL7 designs assign an organization as the playing entity of the Role that is the performer.  These designs should be revised in subsequent releases to make this the scooping entity for the role involved.","concept":[{"code":"DIST","display":"distributor","definition":"Distributes material used in or generated during the act."},{"code":"PPRF","display":"primary performer","definition":"The principal or primary performer of the act."},{"code":"SPRF","display":"secondary performer","definition":"A person assisting in an act through his substantial presence and involvement   This includes: assistants, technicians, associates, or whatever the job titles may be."}]},{"code":"RESP","display":"responsible party","definition":"The person or organization that has primary responsibility for the act.  The responsible party is not necessarily present in an action, but is accountable for the action through the power to delegate, and the duty to review actions with the performing actor after the fact.  This responsibility may be ethical, legal, contractual, fiscal, or fiduciary in nature.\r\n\n                        \n                           Example: A person who is the head of a biochemical laboratory; a sponsor for a policy or government program."},{"code":"VRF","display":"verifier","definition":"A person who verifies the correctness and appropriateness of the service (plan, order, event, etc.) and hence takes on accountability.","concept":[{"code":"AUTHEN","display":"authenticator","definition":"A verifier who attests to the accuracy of an act, but who does not have privileges to legally authenticate the act. An example would be a resident physician who sees a patient and dictates a note, then later signs it. Their signature constitutes an authentication."},{"code":"LA","display":"legal authenticator","definition":"A verifier who legally authenticates the accuracy of an act. An example would be a staff physician who sees a patient and dictates a note, then later signs it. Their signature constitutes a legal authentication."}]}]}]}