{"resourceType":"CodeSystem","id":"v3-ActRelationshipType","meta":{"lastUpdated":"2016-11-11T00:00:00.000+11:00"},"text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n            <p>Release Date: 2016-11-11</p>\n\n            <table class=\"grid\">\n \n              <tr>\n                <td>\n                  <b>Level</b>\n                </td>\n                <td>\n                  <b>Code</b>\n                </td>\n                <td>\n                  <b>Display</b>\n                </td>\n                <td>\n                  <b>Definition</b>\n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>ART\n                  <a name=\"ART\"> </a>\n                </td>\n                <td>act relationship type</td>\n                <td>\n                        \n                           Description: A directed association between a source Act and a target Act.\n                  <br/>\n\n                        \n                           Usage Note: This code should never be transmitted in an instance as the value of ActRelationship.typeCode (attribute)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_ActClassTemporallyPertains)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ActClassTemporallyPertains\"> </a>\n                </td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_ActRelationshipAccounting)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ActRelationshipAccounting\"> </a>\n                </td>\n                <td>\n                        Codes that describe the relationship between an Act and a financial instrument such as a financial transaction, account or invoice element.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_ActRelationshipCostTracking)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ActRelationshipCostTracking\"> </a>\n                </td>\n                <td>\n                        Expresses values for describing the relationship relationship between an InvoiceElement or InvoiceElementGroup and a billable act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      CHRG\n                  <a name=\"CHRG\"> </a>\n                </td>\n                <td>has charge</td>\n                <td>\n                        A relationship that provides an ability to associate a financial transaction (target) as a charge to a clinical act (source).  A clinical act may have a charge associated with the execution or delivery of the service.\n                  <br/>\n\n                        The financial transaction will define the charge (bill) for delivery or performance of the service.\n                  <br/>\n\n                        Charges and costs are distinct terms.  A charge defines what is charged or billed to another organization or entity within an organization.  The cost defines what it costs an organization to perform or deliver a service or product.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      COST\n                  <a name=\"COST\"> </a>\n                </td>\n                <td>has cost</td>\n                <td>\n                        A relationship that provides an ability to associate a financial transaction (target) as a cost to a clinical act (source).  A clinical act may have an inherit cost associated with the execution or delivery of the service.\n                  <br/>\n\n                        The financial transaction will define the cost of delivery or performance of the service.\n                  <br/>\n\n                        Charges and costs are distinct terms.  A charge defines what is charged or billed to another organization or entity within an organization.  The cost defines what it costs an organization to perform or deliver a service or product.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_ActRelationshipPosting)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ActRelationshipPosting\"> </a>\n                </td>\n                <td>\n                        Expresses values for describing the relationship between a FinancialTransaction and an Account.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      CREDIT\n                  <a name=\"CREDIT\"> </a>\n                </td>\n                <td>has credit</td>\n                <td>\n                        A credit relationship ties a financial transaction (target) to an account (source). A credit, once applied (posted), may have either a positive or negative effect on the account balance, depending on the type of account. An asset account credit will decrease the account balance. A non-asset account credit will decrease the account balance.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DEBIT\n                  <a name=\"DEBIT\"> </a>\n                </td>\n                <td>has debit</td>\n                <td>\n                        A debit relationship ties a financial transaction (target) to an account (source).  A debit, once applied (posted), may have either a positive or negative effect on the account balance, depending on the type of account.  An asset account debit will increase the account balance.  A non-asset account debit will decrease the account balance.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_ActRelationshipConditional)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ActRelationshipConditional\"> </a>\n                </td>\n                <td>\n                        Specifies under what circumstances (target Act) the source-Act may, must, must not or has occurred\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CIND\n                  <a name=\"CIND\"> </a>\n                </td>\n                <td>has contra-indication</td>\n                <td>\n                        A contraindication is just a negation of a reason, i.e. it gives a condition under which the action is not to be done. Both, source and target can be any kind of service; target service is in criterion mood. How the strength of a contraindication is expressed (e.g., relative, absolute) is left as an open issue. The priorityNumber attribute could be used.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PRCN\n                  <a name=\"PRCN\"> </a>\n                </td>\n                <td>has pre-condition</td>\n                <td>\n                        A requirement to be true before a service is performed. The target can be any service in criterion mood.  For multiple pre-conditions a conjunction attribute (AND, OR, XOR) is applicable.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    RSON\n                  <a name=\"RSON\"> </a>\n                </td>\n                <td>has reason</td>\n                <td>\n                        \n                           Description: The reason or rationale for a service. A reason link is weaker than a trigger, it only suggests that some service may be or might have been a reason for some action, but not that this reason requires/required the action to be taken. Also, as opposed to the trigger, there is no strong timely relation between the reason and the action.  As well as providing various types of information about the rationale for a service, the RSON act relationship is routinely used between a SBADM act and an OBS act to describe the indication for use of a medication.  Child concepts may be used to describe types of indication. \n                  <br/>\n\n                        \n                           Discussion: In prior releases, the code &quot;SUGG&quot; (suggests) was expressed as &quot;an inversion of the reason link.&quot; That code has been retired in favor of the inversion indicator that is an attribute of ActRelationship.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      BLOCK\n                  <a name=\"BLOCK\"> </a>\n                </td>\n                <td>blocks</td>\n                <td>\n                        \n                           Definition: The source act is performed to block the effects of the target act.  This act relationship should be used when describing near miss type incidents where potential harm could have occurred, but the action described in the source act blocked the potential harmful effects of the incident actually occurring.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DIAG\n                  <a name=\"DIAG\"> </a>\n                </td>\n                <td>diagnoses</td>\n                <td>\n                        \n                           Description: The source act is intended to help establish the presence of a (an adverse) situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature. \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      IMM\n                  <a name=\"IMM\"> </a>\n                </td>\n                <td>immunization against</td>\n                <td>\n                        \n                           Description: The source act is intented to provide immunity against the effects of the target act (the target act describes an infectious disease) \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ACTIMM\n                  <a name=\"ACTIMM\"> </a>\n                </td>\n                <td>active immunization against</td>\n                <td>\n                        \n                           Description: The source act is intended to provide active immunity against the effects of the target act (the target act describes an infectious disease) \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PASSIMM\n                  <a name=\"PASSIMM\"> </a>\n                </td>\n                <td>passive immunization against</td>\n                <td>\n                        \n                           Description: The source act is intended to provide passive immunity against the effects of the target act (the target act describes an infectious disease).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      MITGT\n                  <a name=\"MITGT\"> </a>\n                </td>\n                <td>mitigates</td>\n                <td>\n                        The source act removes or lessens the occurrence or effect of the target act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        RCVY\n                  <a name=\"RCVY\"> </a>\n                </td>\n                <td>recovers</td>\n                <td>\n                        \n                           Definition: The source act is performed to recover from the effects of the target act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      PRYLX\n                  <a name=\"PRYLX\"> </a>\n                </td>\n                <td>prophylaxis of</td>\n                <td>\n                        \n                           Description: The source act is intended to reduce the risk of of an adverse situation to emerge as described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature. \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      TREAT\n                  <a name=\"TREAT\"> </a>\n                </td>\n                <td>treats</td>\n                <td>\n                        \n                           Description: The source act is intended to improve a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ADJUNCT\n                  <a name=\"ADJUNCT\"> </a>\n                </td>\n                <td>adjunctive treatment</td>\n                <td>\n                        \n                           Description: The source act is intended to offer an additional treatment for the management or cure of a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature.  It is not a requirement that the non-adjunctive treatment is explicitly specified.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MTREAT\n                  <a name=\"MTREAT\"> </a>\n                </td>\n                <td>maintenance treatment</td>\n                <td>\n                        \n                           Description: The source act is intended to provide long term maintenance improvement or management of a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PALLTREAT\n                  <a name=\"PALLTREAT\"> </a>\n                </td>\n                <td>palliates</td>\n                <td>\n                        \n                           Description: The source act is intended to provide palliation for the effects of the target act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SYMP\n                  <a name=\"SYMP\"> </a>\n                </td>\n                <td>symptomatic relief</td>\n                <td>\n                        \n                           Description: The source act is intented to provide symptomatic relief for the effects of the target act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    TRIG\n                  <a name=\"TRIG\"> </a>\n                </td>\n                <td>has trigger</td>\n                <td>\n                        A pre-condition that if true should result in the source Act being executed.  The target is in typically in criterion mood.  When reported after the fact (i.e. the criterion has been met) it may be in Event mood.  A delay between the trigger and the triggered action can be specified.\n                  <br/>\n\n                        \n                           Discussion: This includes the concept of a  required act for a service or financial instrument such as an insurance plan or policy. In such cases, the trigger is the occurrence of a specific condition such as coverage limits being exceeded.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_ActRelationshipTemporallyPertains)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ActRelationshipTemporallyPertains\"> </a>\n                </td>\n                <td>\n                        Abstract collector for ActRelationhsip types that relate two acts by their timing.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_ActRelationshipTemporallyPertainsApproximates)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ActRelationshipTemporallyPertainsApproximates\"> </a>\n                </td>\n                <td>\n                        Abstract collector for ActRelationship types that relate two acts by their approximate timing.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      ENE\n                  <a name=\"ENE\"> </a>\n                </td>\n                <td>ends near end</td>\n                <td>\n                        A relationship in which the source act's effective time ends near the end of the target act's effective time. Near is defined separately as a time interval.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is ENS\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ECW\n                  <a name=\"ECW\"> </a>\n                </td>\n                <td>ends concurrent with</td>\n                <td>\n                        A relationship in which the source act's effective time ends with the end of the target act's effective time.\n                  <br/>\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          CONCURRENT\n                  <a name=\"CONCURRENT\"> </a>\n                </td>\n                <td>concurrent with</td>\n                <td>\n                        A relationship in which the source act's effective time is the same as the target act's effective time.\n                  <br/>\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SBSECWE\n                  <a name=\"SBSECWE\"> </a>\n                </td>\n                <td>starts before start of, ends with</td>\n                <td>\n                        The source Act starts before the start of the target Act, and ends with the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SASECWE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      ENS\n                  <a name=\"ENS\"> </a>\n                </td>\n                <td>ends near start</td>\n                <td>\n                        A relationship in which the source act's effective time ends near the start of the target act's effective time. Near is defined separately as a time interval.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is ENE\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ECWS\n                  <a name=\"ECWS\"> </a>\n                </td>\n                <td>ends concurrent with start of</td>\n                <td>\n                        The source Act ends when the target act starts (i.e. if we say &quot;ActOne ECWS ActTwo&quot;, it means that ActOne ends when ActTwo starts, therefore ActOne is the source and ActTwo is the target).\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SCWE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SNE\n                  <a name=\"SNE\"> </a>\n                </td>\n                <td>starts near end</td>\n                <td>\n                        A relationship in which the source act's effective time starts near the end of the target act's effective time. Near is defined separately as a time interval.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is SNS\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SCWE\n                  <a name=\"SCWE\"> </a>\n                </td>\n                <td>starts concurrent with end of</td>\n                <td>\n                        The source Act starts when the target act ends (i.e. if we say &quot;ActOne SCWE ActTwo&quot;, it means that ActOne starts when ActTwo ends, therefore ActOne is the source and ActTwo is the target).\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBSECWS\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SNS\n                  <a name=\"SNS\"> </a>\n                </td>\n                <td>starts near start</td>\n                <td>\n                        A relationship in which the source act's effective time starts near the start of the target act's effective time. Near is defined separately as a time interval.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is SNE\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SCW\n                  <a name=\"SCW\"> </a>\n                </td>\n                <td>starts concurrent with</td>\n                <td>\n                        A relationship in which the source act's effective time starts with the start of the target act's effective time.\n                  <br/>\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#CONCURRENT\">CONCURRENT</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SCWSEBE\n                  <a name=\"SCWSEBE\"> </a>\n                </td>\n                <td>starts with. ends before end of</td>\n                <td>\n                        The source Act starts with.the target Act and ends before the end of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SCWSEAE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SCWSEAE\n                  <a name=\"SCWSEAE\"> </a>\n                </td>\n                <td>starts with, ends after end of</td>\n                <td>The source Act starts with the target Act, and ends after the end of the target Act.</td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    EAS\n                  <a name=\"EAS\"> </a>\n                </td>\n                <td>ends after start of</td>\n                <td>\n                        A relationship in which the source act ends after the target act starts.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      EAE\n                  <a name=\"EAE\"> </a>\n                </td>\n                <td>ends after end of</td>\n                <td>\n                        A relationship in which the source act ends after the target act ends.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is EBE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SASEAE\n                  <a name=\"SASEAE\"> </a>\n                </td>\n                <td>starts after start of, ends after end of</td>\n                <td>\n                        The source Act starts after start of the target Act and ends after end of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBSEBE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SBEEAE\n                  <a name=\"SBEEAE\"> </a>\n                </td>\n                <td>contains end of</td>\n                <td>\n                        The source Act contains the end of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is EDU\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            SASSBEEAS\n                  <a name=\"SASSBEEAS\"> </a>\n                </td>\n                <td>start after start of, contains end of</td>\n                <td>\n                        The source Act start after the start of the target Act, and contains the end of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBSEASEBE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            SBSEAE\n                  <a name=\"SBSEAE\"> </a>\n                </td>\n                <td>contains time of</td>\n                <td>\n                        The source Act contains the time of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is DURING\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            \n                  <a href=\"#SCWSEAE\">SCWSEAE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#SASSBEEAS\">SASSBEEAS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SAS\n                  <a name=\"SAS\"> </a>\n                </td>\n                <td>starts after start of</td>\n                <td>\n                        The source Act starts after the start of the target Act (i.e. if we say &quot;ActOne SAS ActTwo&quot;, it means that ActOne starts after the start of ActTwo, therefore ActOne is the source and ActTwo is the target).\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBS\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SASEAE\">SASEAE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SAE\n                  <a name=\"SAE\"> </a>\n                </td>\n                <td>starts after end of</td>\n                <td>\n                        A relationship in which the source act starts after the target act ends.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is EBS\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        DURING\n                  <a name=\"DURING\"> </a>\n                </td>\n                <td>occurs during</td>\n                <td>\n                        A relationship in which the source act's effective time is wholly within the target act's effective time (including end points, as defined in the act's effective times)\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBSEAE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SASECWE\n                  <a name=\"SASECWE\"> </a>\n                </td>\n                <td>starts after start of, ends with</td>\n                <td>\n                        The source Act starts after start of the target Act, and ends with the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBSECWE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    EASORECWS\n                  <a name=\"EASORECWS\"> </a>\n                </td>\n                <td>ends after or concurrent with start of</td>\n                <td>\n                        A relationship in which the source act's effective time ends after or concurrent with the start of the target act's effective time.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is EBSORECWS\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#EAS\">EAS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      EAEORECW\n                  <a name=\"EAEORECW\"> </a>\n                </td>\n                <td>ends after or concurrent with end of</td>\n                <td>\n                        A relationship in which the source act's effective time ends after or concurrent with the end of the target act's effective time.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is EBEORECW\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#EAE\">EAE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#ECW\">ECW</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#ECWS\">ECWS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    INDEPENDENT\n                  <a name=\"INDEPENDENT\"> </a>\n                </td>\n                <td>independent of time of</td>\n                <td>\n                        The source Act is independent of the time of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SAEORSCWE\n                  <a name=\"SAEORSCWE\"> </a>\n                </td>\n                <td>starts after or concurrent with end of</td>\n                <td>\n                        A relationship in which the source act's effective time starts after or concurrent with the end of the target act's effective time.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is SBEORSCWE\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#SCWE\">SCWE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#SAE\">SAE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SASORSCW\n                  <a name=\"SASORSCW\"> </a>\n                </td>\n                <td>starts after or concurrent with start of</td>\n                <td>\n                        A relationship in which the source act's effective time starts after or concurrent with the start of the target act's effective time.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is SBSORSCW\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#SAS\">SAS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#SCW\">SCW</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SBEORSCWE\n                  <a name=\"SBEORSCWE\"> </a>\n                </td>\n                <td>starts before or concurrent with end of</td>\n                <td>\n                        A relationship in which the source act's effective time starts before or concurrent with the end of the target act's effective time.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is SAEORSCWE\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      OVERLAP\n                  <a name=\"OVERLAP\"> </a>\n                </td>\n                <td>overlaps with</td>\n                <td>\n                        A relationship in which the source act's effective time overlaps the target act's effective time in any way.\n                  <br/>\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#ECW\">ECW</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        EDU\n                  <a name=\"EDU\"> </a>\n                </td>\n                <td>ends during</td>\n                <td>\n                        A relationship in which the source act ends within the target act's effective time (including end points, as defined in the act's effective times)\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBEEAE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SBSEASEBE\n                  <a name=\"SBSEASEBE\"> </a>\n                </td>\n                <td>contains start of, ends before end of</td>\n                <td>\n                        The source Act contains the start of the target Act,  and ends before the end of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SASSBEEAS\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#SCWSEBE\">SCWSEBE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SBEEAE\">SBEEAE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SBSEAS\n                  <a name=\"SBSEAS\"> </a>\n                </td>\n                <td>contains start of</td>\n                <td>\n                        The source Act contains the start of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SDU\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#SBSECWE\">SBSECWE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#SBSEASEBE\">SBSEASEBE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#SBSEAE\">SBSEAE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SCW\">SCW</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SCWE\">SCWE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SDU\n                  <a name=\"SDU\"> </a>\n                </td>\n                <td>starts during</td>\n                <td>\n                        A relationship in which the source act starts within the target act's effective time (including end points, as defined in the act's effective times)\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SBSEAS\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#SASSBEEAS\">SASSBEEAS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SBE\n                  <a name=\"SBE\"> </a>\n                </td>\n                <td>starts before end of</td>\n                <td>The source Act starts before the end of the target Act (i.e. if we say &quot;ActOne SBE ActTwo&quot;, it means that ActOne starts before the end of ActTwo, therefore ActOne is the source and ActTwo is the target).\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is EAS\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        EBE\n                  <a name=\"EBE\"> </a>\n                </td>\n                <td>ends before end of</td>\n                <td>The source Act ends before the end of the target Act (i.e. if we say &quot;ActOne EBE ActTwo&quot;, it means that ActOne ends before the end of ActTwo, therefore ActOne is the source and ActTwo is the target).\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is EAE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SBSEBE\n                  <a name=\"SBSEBE\"> </a>\n                </td>\n                <td>starts before start of, ends before end of</td>\n                <td>\n                        The source Act starts before the start of the target Act, and ends before the end of the target Act.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SASEAE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            \n                  <a href=\"#SBSEASEBE\">SBSEASEBE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            EBSORECWS\n                  <a name=\"EBSORECWS\"> </a>\n                </td>\n                <td>ends before or concurrent with start of</td>\n                <td>\n                        A relationship in which the source act's effective time ends before or concurrent with the start of the target act's effective time.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is EASORECWS\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>8</td>\n                <td>              \n                  <a href=\"#ECWS\">ECWS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>8</td>\n                <td>              EBS\n                  <a name=\"EBS\"> </a>\n                </td>\n                <td>ends before start of</td>\n                <td>\n                        A relationship in which the source act ends before the target act starts.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SAE\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SBSEASEBE\">SBSEASEBE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SCWSEBE\">SCWSEBE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        EBEORECW\n                  <a name=\"EBEORECW\"> </a>\n                </td>\n                <td>ends before or concurrent with end of</td>\n                <td>\n                        A relationship in which the source act's effective time ends before or concurrent with the end of the target act's effective time.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is EAEORECW\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#ECW\">ECW</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#EBE\">EBE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SBSORSCW\n                  <a name=\"SBSORSCW\"> </a>\n                </td>\n                <td>starts before or concurrent with start of</td>\n                <td>\n                        A relationship in which the source act's effective time starts before or concurrent with the start of the target act's effective time.\n                  <br/>\n\n                        \n                           Usage Note: Inverse code is SASORSCW\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#SCW\">SCW</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SBS\n                  <a name=\"SBS\"> </a>\n                </td>\n                <td>starts before start of</td>\n                <td>\n                        A relationship in which the source act begins before the target act begins.\n                  <br/>\n\n                        \n                           UsageNote: Inverse code is SAS\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            \n                  <a href=\"#SBSEBE\">SBSEBE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            \n                  <a href=\"#SBSEAS\">SBSEAS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  AUTH\n                  <a name=\"AUTH\"> </a>\n                </td>\n                <td>authorized by</td>\n                <td>\n                        A relationship in which the target act authorizes or certifies the source act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  CAUS\n                  <a name=\"CAUS\"> </a>\n                </td>\n                <td>is etiology for</td>\n                <td>\n                        \n                           Description: An assertion that an act was the cause of another act.This is stronger and more specific than the support link. The source (cause) is typically an observation, but may be any act, while the target may be any act.\n                  <br/>\n\n                        \n                           Examples:\n                        \n                  <br/>\n\n                        \n                           a growth of Staphylococcus aureus may be considered the cause of an abscess\n                           contamination of the infusion bag was deemed to be the cause of the infection that the patient experienced\n                           lack of staff on the shift was deemed to be a supporting factor (proximal factor) causing the patient safety incident where the patient fell out of bed because the  bed-sides had not been put up which caused the night patient to fall out of bed\n                        \n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  COMP\n                  <a name=\"COMP\"> </a>\n                </td>\n                <td>has component</td>\n                <td>\n                        The target act is a component of the source act, with no semantics regarding composition or aggregation implied.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CTRLV\n                  <a name=\"CTRLV\"> </a>\n                </td>\n                <td>has control variable</td>\n                <td>\n                        A relationship from an Act to a Control Variable.  For example, if a Device makes an Observation, this relates the Observation to its Control Variables documenting  the device's settings that influenced the observation.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    MBR\n                  <a name=\"MBR\"> </a>\n                </td>\n                <td>has member</td>\n                <td>\n                        The target Acts are aggregated by the source Act.  Target Acts may have independent existence, participate in multiple ActRelationships, and do not contribute to the meaning of the source.\n                  <br/>\n\n                        \n                           UsageNotes: This explicitly represents the conventional notion of aggregation.  The target Act is part of a collection of Acts (no implication is made of cardinality, a source of Acts may contain zero, one, or more member target Acts).\n                  <br/>\n\n                        It is expected that this will be primarily used with _ActClassRecordOrganizer, BATTERY, and LIST\n\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      STEP\n                  <a name=\"STEP\"> </a>\n                </td>\n                <td>has step</td>\n                <td>\n                        A collection of sub-services as steps or subtasks performed for the source service. Services may be performed sequentially or concurrently.\n                  <br/>\n\n                        \n                           UsageNotes: Sequence of steps may be indicated by use of _ActRelationshipTemporallyPertains, as well as via  ActRelationship.sequenceNumber, ActRelationship.pauseQuantity, Target.priorityCode.\n                  <br/>\n\n                        \n                           OpenIssue: Need Additional guidelines on when each approach should be used.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ARR\n                  <a name=\"ARR\"> </a>\n                </td>\n                <td>arrival</td>\n                <td>\n                        The relationship that links to a Transportation Act (target) from another Act (source) indicating that the subject of the source Act entered into the source Act by means of the target Transportation act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        DEP\n                  <a name=\"DEP\"> </a>\n                </td>\n                <td>departure</td>\n                <td>\n                        The relationship that links to a Transportation Act (target) from another Act (source) indicating that the subject of the source Act departed from the source Act by means of the target Transportation act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PART\n                  <a name=\"PART\"> </a>\n                </td>\n                <td>has part</td>\n                <td>\n                        The source Act is a composite of the target Acts. The target Acts do not have an existence independent of the source Act.\n                  <br/>\n\n                        \n                           UsageNote: In UML 1.1, this is a &quot;composition&quot; defined as: \n                           &quot;A form of aggregation with strong ownership and coincident lifetime as part of the whole. Parts with non-fixed multiplicity may be created after the composite itself, but once created they live and die with it (i.e., they share lifetimes). Such parts can also be explicitly removed before the death of the composite. Composition may be recursive.&quot;\n                        \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  COVBY\n                  <a name=\"COVBY\"> </a>\n                </td>\n                <td>covered by</td>\n                <td>\n                        A relationship in which the source act is covered by or is under the authority of a target act.  A financial instrument such as an Invoice Element is covered by one or more specific instances of an Insurance Policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  DRIV\n                  <a name=\"DRIV\"> </a>\n                </td>\n                <td>is derived from</td>\n                <td>\n                        Associates a derived Act with its input parameters. E.G., an anion-gap observation can be associated as being derived from given sodium-, (potassium-,), chloride-, and bicarbonate-observations. The narrative content (Act.text) of a source act is wholly machine-derived from the collection of target acts.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  ELNK\n                  <a name=\"ELNK\"> </a>\n                </td>\n                <td>episodeLink</td>\n                <td>\n                        Expresses an association that links two instances of the same act over time, indicating that the instance are part of the same episode, e.g. linking two condition nodes for episode of illness; linking two encounters for episode of encounter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  EVID\n                  <a name=\"EVID\"> </a>\n                </td>\n                <td>provides evidence for</td>\n                <td>\n                        Indicates that the target Act provides evidence in support of the action represented by the source Act. The target is not a 'reason' for the source act, but rather gives supporting information on why the source act is an appropriate course of action. Possible targets might be clinical trial results, journal articles, similar successful therapies, etc.\n                  <br/>\n\n                        \n                           Rationale: Provides a mechanism for conveying clinical justification for non-approved or otherwise non-traditional therapies.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  EXACBY\n                  <a name=\"EXACBY\"> </a>\n                </td>\n                <td>exacerbated by</td>\n                <td>\n                        \n                           Description:The source act is aggravated by the target act. (Example &quot;chest pain&quot; EXACBY &quot;exercise&quot;)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  EXPL\n                  <a name=\"EXPL\"> </a>\n                </td>\n                <td>has explanation</td>\n                <td>\n                        This is the inversion of support.  Used to indicate that a given observation is explained by another observation or condition.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  INTF\n                  <a name=\"INTF\"> </a>\n                </td>\n                <td>interfered by</td>\n                <td>\n                        the target act documents a set of circumstances (events, risks) which prevent successful completion, or degradation of quality of, the source Act.\n                  <br/>\n\n                        \n                           UsageNote: This provides the semantics to document barriers to care\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  ITEMSLOC\n                  <a name=\"ITEMSLOC\"> </a>\n                </td>\n                <td>items located</td>\n                <td>\n                        Items located\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  LIMIT\n                  <a name=\"LIMIT\"> </a>\n                </td>\n                <td>limited by</td>\n                <td>\n                        A relationship that limits or restricts the source act by the elements of the target act.  For example, an authorization may be limited by a financial amount (up to $500). Target Act must be in EVN.CRIT mood.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  META\n                  <a name=\"META\"> </a>\n                </td>\n                <td>has metadata</td>\n                <td>\n                        \n                           Definition: Indicates that the attributes and associations of the target act provide metadata (for example, identifiers, authorship, etc.) for the source act.\n                  <br/>\n\n                        \n                           Constraint:  Source act must have either a mood code that is not &quot;EVN&quot; (event) or its &quot;isCriterion&quot; attribute must set to &quot;true&quot;.  Target act must be an Act with a mood code of EVN and with isCriterionInd attribute set to &quot;true&quot;.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  MFST\n                  <a name=\"MFST\"> </a>\n                </td>\n                <td>is manifestation of</td>\n                <td>\n                        An assertion that a new observation may be the manifestation of another existing observation or action.  This assumption is attributed to the same actor who asserts the manifestation.  This is stronger and more specific than an inverted support link.  For example, an agitated appearance can be asserted to be the manifestation (effect) of a known hyperthyroxia.  This expresses that one might not have realized a symptom if it would not be a common manifestation of a known condition.  The target (cause) may be any service, while the source (manifestation) must be an observation.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  NAME\n                  <a name=\"NAME\"> </a>\n                </td>\n                <td>assigns name</td>\n                <td>\n                        Used to assign a &quot;name&quot; to a condition thread. Source is a condition node, target can be any service.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  OUTC\n                  <a name=\"OUTC\"> </a>\n                </td>\n                <td>has outcome</td>\n                <td>\n                        An observation that should follow or does actually follow as a result or consequence of a condition or action (sometimes called &quot;post-conditional&quot;.) Target must be an observation as a goal, risk or any criterion. For complex outcomes a conjunction attribute (AND, OR, XOR) can be used.  An outcome link is often inverted to describe an outcome assessment.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_ActRelationsipObjective)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ActRelationsipObjective\"> </a>\n                </td>\n                <td>\n                        The target act is a desired outcome of the source act. Source is any act (typically an intervention). Target must be an observation in criterion mood.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      OBJC\n                  <a name=\"OBJC\"> </a>\n                </td>\n                <td>has continuing objective</td>\n                <td>\n                        A desired state that a service action aims to maintain.  E.g., keep systolic blood pressure between 90 and 110 mm Hg.  Source is an intervention service.  Target must be an observation in criterion mood.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      OBJF\n                  <a name=\"OBJF\"> </a>\n                </td>\n                <td>has final objective</td>\n                <td>\n                        A desired outcome that a service action aims to meet finally.  Source is any service (typically an intervention).  Target must be an observation in criterion mood.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GOAL\n                  <a name=\"GOAL\"> </a>\n                </td>\n                <td>has goal</td>\n                <td>\n                        A goal that one defines given a patient's health condition.  Subsequently planned actions aim to meet that goal.  Source is an observation or condition node, target must be an observation in goal mood.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    RISK\n                  <a name=\"RISK\"> </a>\n                </td>\n                <td>has risk</td>\n                <td>\n                        A noteworthy undesired outcome of a patient's condition that is either likely enough to become an issue or is less likely but dangerous enough to be addressed.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  PERT\n                  <a name=\"PERT\"> </a>\n                </td>\n                <td>has pertinent information</td>\n                <td>\n                        This is a very unspecific relationship from one item of clinical information to another.  It does not judge about the role the pertinent information plays.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  PREV\n                  <a name=\"PREV\"> </a>\n                </td>\n                <td>has previous instance</td>\n                <td>\n                        A relationship in which the target act is a predecessor instance to the source act.  Generally each of these instances is similar, but no identical.  In healthcare coverage it is used to link a claim item to a previous claim item that might have claimed for the same set of services.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  REFR\n                  <a name=\"REFR\"> </a>\n                </td>\n                <td>refers to</td>\n                <td>\n                        A relationship in which the target act is referred to by the source act.  This permits a simple reference relationship that distinguishes between the referent and the referee.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    USE\n                  <a name=\"USE\"> </a>\n                </td>\n                <td>uses</td>\n                <td>\n                        Indicates that the source act makes use of (or will make use of) the information content of the target act.\n                  <br/>\n\n                        \n                           UsageNotes: A usage relationship only makes sense if the target act is authored and occurs independently of the source act.  Otherwise a simpler relationship such as COMP would be appropriate.\n                  <br/>\n\n                        \n                           Rationale: There is a need when defining a clinical trial protocol to indicate that the protocol makes use of other protocol or treatment specifications.  This is stronger than the assertion of &quot;references&quot;.  References may exist without usage, and in a clinical trial protocol is common to assert both: what other specifications does this trial use and what other specifications does it merely reference.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  REFV\n                  <a name=\"REFV\"> </a>\n                </td>\n                <td>has reference values</td>\n                <td>\n                        Reference ranges are essentially descriptors of a class of result values assumed to be &quot;normal&quot;, &quot;abnormal&quot;, or &quot;critical.&quot;  Those can vary by sex, age, or any other criterion. Source and target are observations, the target is in criterion mood.  This link type can act as a trigger in case of alarms being triggered by critical results.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  RELVBY\n                  <a name=\"RELVBY\"> </a>\n                </td>\n                <td>relieved by</td>\n                <td>\n                        \n                           Description:The source act is wholly or partially alleviated by the target act. (Example &quot;chest pain&quot; RELVBY &quot;sublingual nitroglycerin administration&quot;)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  SEQL\n                  <a name=\"SEQL\"> </a>\n                </td>\n                <td>is sequel</td>\n                <td>\n                        An act relationship indicating that the source act follows the target act. The source act should in principle represent the same kind of act as the target. Source and target need not have the same mood code (mood will often differ). The target of a sequel is called antecedent. Examples for sequel relationships are: revision, transformation, derivation from a prototype (as a specialization is a derivation of a generalization), followup, realization, instantiation.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    APND\n                  <a name=\"APND\"> </a>\n                </td>\n                <td>is appendage</td>\n                <td>\n                        An addendum (source) to an existing service object (target), containing supplemental information.  The addendum is itself an original service object linked to the supplemented service object.  The supplemented service object remains in place and its content and status are unaltered.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    BSLN\n                  <a name=\"BSLN\"> </a>\n                </td>\n                <td>has baseline</td>\n                <td>\n                        Indicates that the target observation(s) provide an initial reference for the source observation or observation group.\n                  <br/>\n\n                        \n                           UsageConstraints: Both source and target must be Observations or specializations thereof.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    COMPLY\n                  <a name=\"COMPLY\"> </a>\n                </td>\n                <td>complies with</td>\n                <td>\n                        \n                           Description:The source act complies with, adheres to, conforms to, or is permissible under (in whole or in part) the policy, contract, agreement, law, conformance criteria, certification guidelines or requirement conveyed by the target act.\n                  <br/>\n\n                        Examples for compliance relationships are: audits of adherence with a security policy, certificate of conformance to system certification requirements, or consent directive in compliance with or permissible under a privacy policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DOC\n                  <a name=\"DOC\"> </a>\n                </td>\n                <td>documents</td>\n                <td>\n                        The source act documents the target act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    FLFS\n                  <a name=\"FLFS\"> </a>\n                </td>\n                <td>fulfills</td>\n                <td>\n                        The source act fulfills (in whole or in part) the target act. Source act must be in a mood equal or more actual than the target act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      OCCR\n                  <a name=\"OCCR\"> </a>\n                </td>\n                <td>occurrence</td>\n                <td>\n                        The source act is a single occurrence of a repeatable target act. The source and target act can be in any mood on the &quot;completion track&quot; but the source act must be as far as or further along the track than the target act (i.e., the occurrence of an intent can be an event but not vice versa).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      OREF\n                  <a name=\"OREF\"> </a>\n                </td>\n                <td>references order</td>\n                <td>\n                        Relates either an appointment request or an appointment to the order for the service being scheduled.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SCH\n                  <a name=\"SCH\"> </a>\n                </td>\n                <td>schedules request</td>\n                <td>\n                        Associates a specific time (and associated resources) with a scheduling request or other intent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GEN\n                  <a name=\"GEN\"> </a>\n                </td>\n                <td>has generalization</td>\n                <td>\n                        The generalization relationship can be used to express categorical knowledge about services (e.g., amilorid, triamterene, and spironolactone have the common generalization potassium sparing diuretic).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GEVL\n                  <a name=\"GEVL\"> </a>\n                </td>\n                <td>evaluates (goal)</td>\n                <td>\n                        A goal-evaluation links an observation (intent or actual) to a goal to indicate that the observation evaluates the goal. Given the goal and the observation, a &quot;goal distance&quot; (e.g., goal to observation) can be &quot;calculated&quot; and need not be sent explicitly.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    INST\n                  <a name=\"INST\"> </a>\n                </td>\n                <td>instantiates (master)</td>\n                <td>\n                        Used to capture the link between a potential service (&quot;master&quot; or plan) and an actual service, where the actual service instantiates the potential service. The instantiation may override the master's defaults.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    MOD\n                  <a name=\"MOD\"> </a>\n                </td>\n                <td>modifies</td>\n                <td>\n                        Definition: Used to link a newer version or 'snapshot' of a business object (source) to an older version or 'snapshot' of the same business object (target).\n                  <br/>\n\n                        \n                           Usage:The identifier of the Act should be the same for both source and target. If the identifiers are distinct, RPLC should be used instead.\n                  <br/>\n\n                        Name from source to target = &quot;modifiesPrior&quot;\n                  <br/>\n\n                        Name from target to source = &quot;modifiesByNew&quot;\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    MTCH\n                  <a name=\"MTCH\"> </a>\n                </td>\n                <td>matches (trigger)</td>\n                <td>\n                        A trigger-match links an actual service (e.g., an observation or procedure that took place) with a service in criterion mood.  For example if the trigger is &quot;observation of pain&quot; and pain is actually observed, and if that pain-observation caused the trigger to fire, that pain-observation can be linked with the trigger.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    OPTN\n                  <a name=\"OPTN\"> </a>\n                </td>\n                <td>has option</td>\n                <td>\n                        A relationship between a source Act that provides more detailed properties to the target Act.\n                  <br/>\n\n                        The source act thus is a specialization of the target act, but instead of mentioning all the inherited properties it only mentions new property bindings or refinements.\n                  <br/>\n\n                        The typical use case is to specify certain alternative variants of one kind of Act. The priorityNumber attribute is used to weigh refinements as preferred over other alternative refinements.\n                  <br/>\n\n                        Example: several routing options for a drug are specified as one SubstanceAdministration for the general treatment with attached refinements for the various routing options.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    RCHAL\n                  <a name=\"RCHAL\"> </a>\n                </td>\n                <td>re-challenge</td>\n                <td>\n                        \n                           Description:A relationship in which the target act is carried out to determine whether an effect attributed to the source act can be recreated.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    REV\n                  <a name=\"REV\"> </a>\n                </td>\n                <td>reverses</td>\n                <td>\n                        A relationship between a source Act that seeks to reverse or undo the action of the prior target Act.\n                  <br/>\n\n                        Example: A posted financial transaction (e.g., a debit transaction) was applied in error and must be reversed (e.g., by a credit transaction) the credit transaction is identified as an undo (or reversal) of the prior target transaction.\n                  <br/>\n\n                        Constraints: the &quot;completion track&quot; mood of the target Act must be equally or more &quot;actual&quot; than the source act. I.e., when the target act is EVN the source act can be EVN, or any INT. If the target act is INT, the source act can be INT.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    RPLC\n                  <a name=\"RPLC\"> </a>\n                </td>\n                <td>replaces</td>\n                <td>\n                        A replacement source act replaces an existing target act. The state of the target act being replaced becomes obselete, but the act is typically still retained in the system for historical reference.  The source and target must be of the same type.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SUCC\n                  <a name=\"SUCC\"> </a>\n                </td>\n                <td>succeeds</td>\n                <td>\n                        \n                           Definition:  A new act that carries forward the intention of the original act, but does not completely replace it.  The status of the predecessor act must be 'completed'.  The original act is the target act and the successor is the source act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    UPDT\n                  <a name=\"UPDT\"> </a>\n                </td>\n                <td>updates (condition)</td>\n                <td>\n                        A condition thread relationship specifically links condition nodes together to form a condition thread. The source is the new condition node and the target links to the most recent node of the existing condition thread.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    XCRPT\n                  <a name=\"XCRPT\"> </a>\n                </td>\n                <td>Excerpts</td>\n                <td>\n                        The source is an excerpt from the target.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      VRXCRPT\n                  <a name=\"VRXCRPT\"> </a>\n                </td>\n                <td>Excerpt verbatim</td>\n                <td>\n                        The source is a direct quote from the target.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    XFRM\n                  <a name=\"XFRM\"> </a>\n                </td>\n                <td>transformation</td>\n                <td>\n                        Used when the target Act is a transformation of the source Act. (For instance, used to show that a CDA document is a transformation of a DICOM SR document.)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  SPRT\n                  <a name=\"SPRT\"> </a>\n                </td>\n                <td>has support</td>\n                <td>\n                        Used to indicate that an existing service is suggesting evidence for a new observation. The assumption of support is attributed to the same actor who asserts the observation. Source must be an observation, target may be any service  (e.g., to indicate a status post).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SPRTBND\n                  <a name=\"SPRTBND\"> </a>\n                </td>\n                <td>has bounded support</td>\n                <td>\n                        A specialization of &quot;has support&quot; (SPRT), used to relate a secondary observation to a Region of Interest on a multidimensional observation, if the ROI specifies the true boundaries of the secondary observation as opposed to only marking the approximate area.  For example, if the start and end of an ST elevation episode is visible in an EKG, this relation would indicate the ROI bounds the  &quot;ST elevation&quot; observation -- the ROI defines the true beginning and ending of the episode.  Conversely, if a ROI simply contains ST elevation, but it does not define the bounds (start and end) of the episode, the more general &quot;has support&quot; relation is used.  Likewise, if a ROI on an image defines the true bounds of a &quot;1st degree burn&quot;, the relation &quot;has bounded support&quot; is used; but if the ROI only points to the approximate area of the burn, the general &quot;has support&quot; relation is used.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  SUBJ\n                  <a name=\"SUBJ\"> </a>\n                </td>\n                <td>has subject</td>\n                <td>\n                        Relates an Act to its subject Act that the first Act is primarily concerned with.\n                  <br/>\n\n                        Examples\n                  <br/>\n\n                        \n                           \n                              The first Act may be a ControlAct manipulating the subject Act \n                  <br/>\n\n                           \n                           \n                              The first act is a region of interest (ROI) that defines a region within the subject Act.\n                  <br/>\n\n                           \n                           \n                              The first act is a reporting or notification Act, that echos the subject Act for a specific new purpose.\n                  <br/>\n\n                           \n                        \n                        Constraints\n                  <br/>\n\n                        An Act may have multiple subject acts.\n                  <br/>\n\n                        Rationale\n                  <br/>\n\n                        The ActRelationshipType &quot;has subject&quot; is similar to the ParticipationType &quot;subject&quot;, Acts that primarily operate on physical subjects use the Participation, those Acts that primarily operate on other Acts (other information) use the ActRelationship.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    QUALF\n                  <a name=\"QUALF\"> </a>\n                </td>\n                <td>has qualifier</td>\n                <td>\n                        The target observation qualifies (refines) the semantics of the source observation.\n                  <br/>\n\n                        \n                           UsageNote: This is not intended to replace concept refinement and qualification via vocabulary.  It is used when there are multiple components which together provide the complete understanding of the source Act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  SUMM\n                  <a name=\"SUMM\"> </a>\n                </td>\n                <td>summarized by</td>\n                <td>\n                        An act that contains summary values for a list or set of subordinate acts.  For example, a summary of transactions for a particular accounting period.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  VALUE\n                  <a name=\"VALUE\"> </a>\n                </td>\n                <td>has value</td>\n                <td>\n                        \n                           Description:Indicates that the target Act represents the result of the source observation Act.\n                  <br/>\n\n                        \n                           FormalConstraint: Source Act must be an Observation or specialization there-of. Source Act must not have the value attribute specified\n                  <br/>\n\n                        \n                           UsageNote: This relationship allows the result of an observation to be fully expressed as RIM acts as opposed to being embedded in the value attribute.  For example, sending a Document act as the result of an imaging observation, sending a list of Procedures and/or other acts as the result of a medical history observation.\n                  <br/>\n\n                        The valueNegationInd attribute on the source Act has the same semantics of &quot;negated finding&quot; when it applies to the target of a VALUE ActRelationship as it does to the value attribute.  On the other hand, if the ActRelationship.negationInd is true for a VALUE ActRelationship, that means the specified observation does not have the indicated value but does not imply a negated finding.  Because the semantics are extremely close, it is recommended that Observation.valueNegationInd be used, not ActRelationship.negationInd.\n                  <br/>\n\n                        \n                           OpenIssue: The implications of negationInd on ActRelationship and the valueNegationind on Observation.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>CURE\n                  <a name=\"CURE\"> </a>\n                </td>\n                <td>curative indication</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>CURE.ADJ\n                  <a name=\"CURE.46ADJ\"> </a>\n                </td>\n                <td>adjunct curative indication</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>MTGT.ADJ\n                  <a name=\"MTGT.46ADJ\"> </a>\n                </td>\n                <td>adjunct mitigation</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>RACT\n                  <a name=\"RACT\"> </a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>SUGG\n                  <a name=\"SUGG\"> </a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n\n            </table>\n\n          </div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-ballot-status","valueString":"External"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://hl7.org/fhir/v3/ActRelationshipType","identifier":{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.5.1002"},"version":"2016-11-11","name":"v3 Code System ActRelationshipType","status":"active","experimental":false,"date":"2016-11-11T00:00:00+11:00","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":" The source is an excerpt from the target.","caseSensitive":true,"valueSet":"http://hl7.org/fhir/ValueSet/v3-ActRelationshipType","hierarchyMeaning":"is-a","content":"complete","property":[{"code":"notSelectable","uri":"http://hl7.org/fhir/concept-properties#notSelectable","description":"Indicates that the code is abstract - only intended to be used as a selector for other concepts","type":"boolean"},{"code":"inactive","uri":"http://hl7.org/fhir/concept-properties#inactive","description":"True if the concept is not considered active - e.g. not a valid concept any more","type":"boolean"}],"concept":[{"code":"ART","display":"act relationship type","definition":"Description: A directed association between a source Act and a target Act.\r\n\n                        \n                           Usage Note: This code should never be transmitted in an instance as the value of ActRelationship.typeCode (attribute)","concept":[{"code":"_ActClassTemporallyPertains","display":"ActClassTemporallyPertains","definition":"ActClassTemporallyPertains","property":[{"code":"notSelectable","valueBoolean":true}]},{"code":"_ActRelationshipAccounting","display":"ActRelationshipAccounting","definition":"Codes that describe the relationship between an Act and a financial instrument such as a financial transaction, account or invoice element.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"_ActRelationshipCostTracking","display":"ActRelationshipCostTracking","definition":"Expresses values for describing the relationship relationship between an InvoiceElement or InvoiceElementGroup and a billable act.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"CHRG","display":"has charge","definition":"A relationship that provides an ability to associate a financial transaction (target) as a charge to a clinical act (source).  A clinical act may have a charge associated with the execution or delivery of the service.\r\n\n                        The financial transaction will define the charge (bill) for delivery or performance of the service.\r\n\n                        Charges and costs are distinct terms.  A charge defines what is charged or billed to another organization or entity within an organization.  The cost defines what it costs an organization to perform or deliver a service or product."},{"code":"COST","display":"has cost","definition":"A relationship that provides an ability to associate a financial transaction (target) as a cost to a clinical act (source).  A clinical act may have an inherit cost associated with the execution or delivery of the service.\r\n\n                        The financial transaction will define the cost of delivery or performance of the service.\r\n\n                        Charges and costs are distinct terms.  A charge defines what is charged or billed to another organization or entity within an organization.  The cost defines what it costs an organization to perform or deliver a service or product."}]},{"code":"_ActRelationshipPosting","display":"ActRelationshipPosting","definition":"Expresses values for describing the relationship between a FinancialTransaction and an Account.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"CREDIT","display":"has credit","definition":"A credit relationship ties a financial transaction (target) to an account (source). A credit, once applied (posted), may have either a positive or negative effect on the account balance, depending on the type of account. An asset account credit will decrease the account balance. A non-asset account credit will decrease the account balance."},{"code":"DEBIT","display":"has debit","definition":"A debit relationship ties a financial transaction (target) to an account (source).  A debit, once applied (posted), may have either a positive or negative effect on the account balance, depending on the type of account.  An asset account debit will increase the account balance.  A non-asset account debit will decrease the account balance."}]}]},{"code":"_ActRelationshipConditional","display":"ActRelationshipConditional","definition":"Specifies under what circumstances (target Act) the source-Act may, must, must not or has occurred","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"CIND","display":"has contra-indication","definition":"A contraindication is just a negation of a reason, i.e. it gives a condition under which the action is not to be done. Both, source and target can be any kind of service; target service is in criterion mood. How the strength of a contraindication is expressed (e.g., relative, absolute) is left as an open issue. The priorityNumber attribute could be used."},{"code":"PRCN","display":"has pre-condition","definition":"A requirement to be true before a service is performed. The target can be any service in criterion mood.  For multiple pre-conditions a conjunction attribute (AND, OR, XOR) is applicable."},{"code":"RSON","display":"has reason","definition":"Description: The reason or rationale for a service. A reason link is weaker than a trigger, it only suggests that some service may be or might have been a reason for some action, but not that this reason requires/required the action to be taken. Also, as opposed to the trigger, there is no strong timely relation between the reason and the action.  As well as providing various types of information about the rationale for a service, the RSON act relationship is routinely used between a SBADM act and an OBS act to describe the indication for use of a medication.  Child concepts may be used to describe types of indication. \r\n\n                        \n                           Discussion: In prior releases, the code \"SUGG\" (suggests) was expressed as \"an inversion of the reason link.\" That code has been retired in favor of the inversion indicator that is an attribute of ActRelationship.","concept":[{"code":"BLOCK","display":"blocks","definition":"Definition: The source act is performed to block the effects of the target act.  This act relationship should be used when describing near miss type incidents where potential harm could have occurred, but the action described in the source act blocked the potential harmful effects of the incident actually occurring."},{"code":"DIAG","display":"diagnoses","definition":"Description: The source act is intended to help establish the presence of a (an adverse) situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature."},{"code":"IMM","display":"immunization against","definition":"Description: The source act is intented to provide immunity against the effects of the target act (the target act describes an infectious disease)","concept":[{"code":"ACTIMM","display":"active immunization against","definition":"Description: The source act is intended to provide active immunity against the effects of the target act (the target act describes an infectious disease)"},{"code":"PASSIMM","display":"passive immunization against","definition":"Description: The source act is intended to provide passive immunity against the effects of the target act (the target act describes an infectious disease)."}]},{"code":"MITGT","display":"mitigates","definition":"The source act removes or lessens the occurrence or effect of the target act.","concept":[{"code":"RCVY","display":"recovers","definition":"Definition: The source act is performed to recover from the effects of the target act."}]},{"code":"PRYLX","display":"prophylaxis of","definition":"Description: The source act is intended to reduce the risk of of an adverse situation to emerge as described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature."},{"code":"TREAT","display":"treats","definition":"Description: The source act is intended to improve a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature.","concept":[{"code":"ADJUNCT","display":"adjunctive treatment","definition":"Description: The source act is intended to offer an additional treatment for the management or cure of a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature.  It is not a requirement that the non-adjunctive treatment is explicitly specified."},{"code":"MTREAT","display":"maintenance treatment","definition":"Description: The source act is intended to provide long term maintenance improvement or management of a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature."},{"code":"PALLTREAT","display":"palliates","definition":"Description: The source act is intended to provide palliation for the effects of the target act."},{"code":"SYMP","display":"symptomatic relief","definition":"Description: The source act is intented to provide symptomatic relief for the effects of the target act."}]}]},{"code":"TRIG","display":"has trigger","definition":"A pre-condition that if true should result in the source Act being executed.  The target is in typically in criterion mood.  When reported after the fact (i.e. the criterion has been met) it may be in Event mood.  A delay between the trigger and the triggered action can be specified.\r\n\n                        \n                           Discussion: This includes the concept of a  required act for a service or financial instrument such as an insurance plan or policy. In such cases, the trigger is the occurrence of a specific condition such as coverage limits being exceeded."}]},{"code":"_ActRelationshipTemporallyPertains","display":"ActRelationshipTemporallyPertains","definition":"Abstract collector for ActRelationhsip types that relate two acts by their timing.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"_ActRelationshipTemporallyPertainsApproximates","display":"ActRelationshipTemporallyPertainsApproximates","definition":"Abstract collector for ActRelationship types that relate two acts by their approximate timing.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"ENE","display":"ends near end","definition":"A relationship in which the source act's effective time ends near the end of the target act's effective time. Near is defined separately as a time interval.\r\n\n                        \n                           Usage Note: Inverse code is ENS","concept":[{"code":"ECW","display":"ends concurrent with","definition":"A relationship in which the source act's effective time ends with the end of the target act's effective time.\r\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself.","concept":[{"code":"CONCURRENT","display":"concurrent with","definition":"A relationship in which the source act's effective time is the same as the target act's effective time.\r\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself."},{"code":"SBSECWE","display":"starts before start of, ends with","definition":"The source Act starts before the start of the target Act, and ends with the target Act.\r\n\n                        \n                           UsageNote: Inverse code is SASECWE"}]}]},{"code":"ENS","display":"ends near start","definition":"A relationship in which the source act's effective time ends near the start of the target act's effective time. Near is defined separately as a time interval.\r\n\n                        \n                           Usage Note: Inverse code is ENE","concept":[{"code":"ECWS","display":"ends concurrent with start of","definition":"The source Act ends when the target act starts (i.e. if we say \"ActOne ECWS ActTwo\", it means that ActOne ends when ActTwo starts, therefore ActOne is the source and ActTwo is the target).\r\n\n                        \n                           UsageNote: Inverse code is SCWE"}]},{"code":"SNE","display":"starts near end","definition":"A relationship in which the source act's effective time starts near the end of the target act's effective time. Near is defined separately as a time interval.\r\n\n                        \n                           Usage Note: Inverse code is SNS","concept":[{"code":"SCWE","display":"starts concurrent with end of","definition":"The source Act starts when the target act ends (i.e. if we say \"ActOne SCWE ActTwo\", it means that ActOne starts when ActTwo ends, therefore ActOne is the source and ActTwo is the target).\r\n\n                        \n                           UsageNote: Inverse code is SBSECWS"}]},{"code":"SNS","display":"starts near start","definition":"A relationship in which the source act's effective time starts near the start of the target act's effective time. Near is defined separately as a time interval.\r\n\n                        \n                           Usage Note: Inverse code is SNE","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"CONCURRENT"}],"code":"SCW","display":"starts concurrent with","definition":"A relationship in which the source act's effective time starts with the start of the target act's effective time.\r\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself.","concept":[{"code":"SCWSEBE","display":"starts with. ends before end of","definition":"The source Act starts with.the target Act and ends before the end of the target Act.\r\n\n                        \n                           UsageNote: Inverse code is SCWSEAE"},{"code":"SCWSEAE","display":"starts with, ends after end of","definition":"The source Act starts with the target Act, and ends after the end of the target Act."}]}]}]},{"code":"EAS","display":"ends after start of","definition":"A relationship in which the source act ends after the target act starts.\r\n\n                        \n                           UsageNote: Inverse code is SBE","concept":[{"code":"EAE","display":"ends after end of","definition":"A relationship in which the source act ends after the target act ends.\r\n\n                        \n                           UsageNote: Inverse code is EBE","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SASSBEEAS"}],"code":"SASEAE","display":"starts after start of, ends after end of","definition":"The source Act starts after start of the target Act and ends after end of the target Act.\r\n\n                        \n                           UsageNote: Inverse code is SBSEBE","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SCWSEAE"}],"code":"SBEEAE","display":"contains end of","definition":"The source Act contains the end of the target Act.\r\n\n                        \n                           UsageNote: Inverse code is EDU","concept":[{"code":"SASSBEEAS","display":"start after start of, contains end of","definition":"The source Act start after the start of the target Act, and contains the end of the target Act.\r\n\n                        \n                           UsageNote: Inverse code is SBSEASEBE"},{"code":"SBSEAE","display":"contains time of","definition":"The source Act contains the time of the target Act.\r\n\n                        \n                           UsageNote: Inverse code is DURING"}]}]}]},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SASEAE"}],"code":"SAS","display":"starts after start of","definition":"The source Act starts after the start of the target Act (i.e. if we say \"ActOne SAS ActTwo\", it means that ActOne starts after the start of ActTwo, therefore ActOne is the source and ActTwo is the target).\r\n\n                        \n                           UsageNote: Inverse code is SBS","concept":[{"code":"SAE","display":"starts after end of","definition":"A relationship in which the source act starts after the target act ends.\r\n\n                        \n                           UsageNote: Inverse code is EBS"},{"code":"DURING","display":"occurs during","definition":"A relationship in which the source act's effective time is wholly within the target act's effective time (including end points, as defined in the act's effective times)\r\n\n                        \n                           UsageNote: Inverse code is SBSEAE"},{"code":"SASECWE","display":"starts after start of, ends with","definition":"The source Act starts after start of the target Act, and ends with the target Act.\r\n\n                        \n                           UsageNote: Inverse code is SBSECWE"}]}]},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"EAS"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"ECWS"}],"code":"EASORECWS","display":"ends after or concurrent with start of","definition":"A relationship in which the source act's effective time ends after or concurrent with the start of the target act's effective time.\r\n\n                        \n                           Usage Note: Inverse code is EBSORECWS","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"EAE"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"ECW"}],"code":"EAEORECW","display":"ends after or concurrent with end of","definition":"A relationship in which the source act's effective time ends after or concurrent with the end of the target act's effective time.\r\n\n                        \n                           Usage Note: Inverse code is EBEORECW"}]},{"code":"INDEPENDENT","display":"independent of time of","definition":"The source Act is independent of the time of the target Act.\r\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself."},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SCWE"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SAE"}],"code":"SAEORSCWE","display":"starts after or concurrent with end of","definition":"A relationship in which the source act's effective time starts after or concurrent with the end of the target act's effective time.\r\n\n                        \n                           Usage Note: Inverse code is SBEORSCWE"},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SAS"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SCW"}],"code":"SASORSCW","display":"starts after or concurrent with start of","definition":"A relationship in which the source act's effective time starts after or concurrent with the start of the target act's effective time.\r\n\n                        \n                           Usage Note: Inverse code is SBSORSCW"},{"code":"SBEORSCWE","display":"starts before or concurrent with end of","definition":"A relationship in which the source act's effective time starts before or concurrent with the end of the target act's effective time.\r\n\n                        \n                           Usage Note: Inverse code is SAEORSCWE","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"ECW"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SBEEAE"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SCW"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SCWE"}],"code":"OVERLAP","display":"overlaps with","definition":"A relationship in which the source act's effective time overlaps the target act's effective time in any way.\r\n\n                        \n                           UsageNote: This code is reflexive.  Therefore its inverse code is itself.","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SCWSEBE"}],"code":"EDU","display":"ends during","definition":"A relationship in which the source act ends within the target act's effective time (including end points, as defined in the act's effective times)\r\n\n                        \n                           UsageNote: Inverse code is SBEEAE","concept":[{"code":"SBSEASEBE","display":"contains start of, ends before end of","definition":"The source Act contains the start of the target Act,  and ends before the end of the target Act.\r\n\n                        \n                           UsageNote: Inverse code is SASSBEEAS"}]},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SBSECWE"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SBSEASEBE"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SBSEAE"}],"code":"SBSEAS","display":"contains start of","definition":"The source Act contains the start of the target Act.\r\n\n                        \n                           UsageNote: Inverse code is SDU"},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SASSBEEAS"}],"code":"SDU","display":"starts during","definition":"A relationship in which the source act starts within the target act's effective time (including end points, as defined in the act's effective times)\r\n\n                        \n                           UsageNote: Inverse code is SBSEAS"}]},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SBSEASEBE"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SCWSEBE"}],"code":"SBE","display":"starts before end of","definition":"The source Act starts before the end of the target Act (i.e. if we say \"ActOne SBE ActTwo\", it means that ActOne starts before the end of ActTwo, therefore ActOne is the source and ActTwo is the target).\r\n\n                        \n                           UsageNote: Inverse code is EAS","concept":[{"code":"EBE","display":"ends before end of","definition":"The source Act ends before the end of the target Act (i.e. if we say \"ActOne EBE ActTwo\", it means that ActOne ends before the end of ActTwo, therefore ActOne is the source and ActTwo is the target).\r\n\n                        \n                           UsageNote: Inverse code is EAE","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SBSEASEBE"}],"code":"SBSEBE","display":"starts before start of, ends before end of","definition":"The source Act starts before the start of the target Act, and ends before the end of the target Act.\r\n\n                        \n                           UsageNote: Inverse code is SASEAE","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"ECWS"}],"code":"EBSORECWS","display":"ends before or concurrent with start of","definition":"A relationship in which the source act's effective time ends before or concurrent with the start of the target act's effective time.\r\n\n                        \n                           Usage Note: Inverse code is EASORECWS","concept":[{"code":"EBS","display":"ends before start of","definition":"A relationship in which the source act ends before the target act starts.\r\n\n                        \n                           UsageNote: Inverse code is SAE"}]}]}]},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"ECW"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"EBE"}],"code":"EBEORECW","display":"ends before or concurrent with end of","definition":"A relationship in which the source act's effective time ends before or concurrent with the end of the target act's effective time.\r\n\n                        \n                           Usage Note: Inverse code is EAEORECW"},{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SCW"}],"code":"SBSORSCW","display":"starts before or concurrent with start of","definition":"A relationship in which the source act's effective time starts before or concurrent with the start of the target act's effective time.\r\n\n                        \n                           Usage Note: Inverse code is SASORSCW","concept":[{"modifierExtension":[{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SBSEBE"},{"url":"http://hl7.org/fhir/StructureDefinition/codesystem-subsumes","valueCode":"SBSEAS"}],"code":"SBS","display":"starts before start of","definition":"A relationship in which the source act begins before the target act begins.\r\n\n                        \n                           UsageNote: Inverse code is SAS"}]}]}]}]},{"code":"AUTH","display":"authorized by","definition":"A relationship in which the target act authorizes or certifies the source act."},{"code":"CAUS","display":"is etiology for","definition":"Description: An assertion that an act was the cause of another act.This is stronger and more specific than the support link. The source (cause) is typically an observation, but may be any act, while the target may be any act.\r\n\n                        \n                           Examples:\n                        \r\n\n                        \n                           a growth of Staphylococcus aureus may be considered the cause of an abscess\n                           contamination of the infusion bag was deemed to be the cause of the infection that the patient experienced\n                           lack of staff on the shift was deemed to be a supporting factor (proximal factor) causing the patient safety incident where the patient fell out of bed because the  bed-sides had not been put up which caused the night patient to fall out of bed"},{"code":"COMP","display":"has component","definition":"The target act is a component of the source act, with no semantics regarding composition or aggregation implied.","concept":[{"code":"CTRLV","display":"has control variable","definition":"A relationship from an Act to a Control Variable.  For example, if a Device makes an Observation, this relates the Observation to its Control Variables documenting  the device's settings that influenced the observation."},{"code":"MBR","display":"has member","definition":"The target Acts are aggregated by the source Act.  Target Acts may have independent existence, participate in multiple ActRelationships, and do not contribute to the meaning of the source.\r\n\n                        \n                           UsageNotes: This explicitly represents the conventional notion of aggregation.  The target Act is part of a collection of Acts (no implication is made of cardinality, a source of Acts may contain zero, one, or more member target Acts).\r\n\n                        It is expected that this will be primarily used with _ActClassRecordOrganizer, BATTERY, and LIST","concept":[{"code":"STEP","display":"has step","definition":"A collection of sub-services as steps or subtasks performed for the source service. Services may be performed sequentially or concurrently.\r\n\n                        \n                           UsageNotes: Sequence of steps may be indicated by use of _ActRelationshipTemporallyPertains, as well as via  ActRelationship.sequenceNumber, ActRelationship.pauseQuantity, Target.priorityCode.\r\n\n                        \n                           OpenIssue: Need Additional guidelines on when each approach should be used.","concept":[{"code":"ARR","display":"arrival","definition":"The relationship that links to a Transportation Act (target) from another Act (source) indicating that the subject of the source Act entered into the source Act by means of the target Transportation act."},{"code":"DEP","display":"departure","definition":"The relationship that links to a Transportation Act (target) from another Act (source) indicating that the subject of the source Act departed from the source Act by means of the target Transportation act."}]}]},{"code":"PART","display":"has part","definition":"The source Act is a composite of the target Acts. The target Acts do not have an existence independent of the source Act.\r\n\n                        \n                           UsageNote: In UML 1.1, this is a \"composition\" defined as: \n                           \"A form of aggregation with strong ownership and coincident lifetime as part of the whole. Parts with non-fixed multiplicity may be created after the composite itself, but once created they live and die with it (i.e., they share lifetimes). Such parts can also be explicitly removed before the death of the composite. Composition may be recursive.\""}]},{"code":"COVBY","display":"covered by","definition":"A relationship in which the source act is covered by or is under the authority of a target act.  A financial instrument such as an Invoice Element is covered by one or more specific instances of an Insurance Policy."},{"code":"DRIV","display":"is derived from","definition":"Associates a derived Act with its input parameters. E.G., an anion-gap observation can be associated as being derived from given sodium-, (potassium-,), chloride-, and bicarbonate-observations. The narrative content (Act.text) of a source act is wholly machine-derived from the collection of target acts."},{"code":"ELNK","display":"episodeLink","definition":"Expresses an association that links two instances of the same act over time, indicating that the instance are part of the same episode, e.g. linking two condition nodes for episode of illness; linking two encounters for episode of encounter."},{"code":"EVID","display":"provides evidence for","definition":"Indicates that the target Act provides evidence in support of the action represented by the source Act. The target is not a 'reason' for the source act, but rather gives supporting information on why the source act is an appropriate course of action. Possible targets might be clinical trial results, journal articles, similar successful therapies, etc.\r\n\n                        \n                           Rationale: Provides a mechanism for conveying clinical justification for non-approved or otherwise non-traditional therapies."},{"code":"EXACBY","display":"exacerbated by","definition":"Description:The source act is aggravated by the target act. (Example \"chest pain\" EXACBY \"exercise\")"},{"code":"EXPL","display":"has explanation","definition":"This is the inversion of support.  Used to indicate that a given observation is explained by another observation or condition."},{"code":"INTF","display":"interfered by","definition":"the target act documents a set of circumstances (events, risks) which prevent successful completion, or degradation of quality of, the source Act.\r\n\n                        \n                           UsageNote: This provides the semantics to document barriers to care"},{"code":"ITEMSLOC","display":"items located","definition":"Items located"},{"code":"LIMIT","display":"limited by","definition":"A relationship that limits or restricts the source act by the elements of the target act.  For example, an authorization may be limited by a financial amount (up to $500). Target Act must be in EVN.CRIT mood."},{"code":"META","display":"has metadata","definition":"Definition: Indicates that the attributes and associations of the target act provide metadata (for example, identifiers, authorship, etc.) for the source act.\r\n\n                        \n                           Constraint:  Source act must have either a mood code that is not \"EVN\" (event) or its \"isCriterion\" attribute must set to \"true\".  Target act must be an Act with a mood code of EVN and with isCriterionInd attribute set to \"true\"."},{"code":"MFST","display":"is manifestation of","definition":"An assertion that a new observation may be the manifestation of another existing observation or action.  This assumption is attributed to the same actor who asserts the manifestation.  This is stronger and more specific than an inverted support link.  For example, an agitated appearance can be asserted to be the manifestation (effect) of a known hyperthyroxia.  This expresses that one might not have realized a symptom if it would not be a common manifestation of a known condition.  The target (cause) may be any service, while the source (manifestation) must be an observation."},{"code":"NAME","display":"assigns name","definition":"Used to assign a \"name\" to a condition thread. Source is a condition node, target can be any service."},{"code":"OUTC","display":"has outcome","definition":"An observation that should follow or does actually follow as a result or consequence of a condition or action (sometimes called \"post-conditional\".) Target must be an observation as a goal, risk or any criterion. For complex outcomes a conjunction attribute (AND, OR, XOR) can be used.  An outcome link is often inverted to describe an outcome assessment.","concept":[{"code":"_ActRelationsipObjective","display":"Act Relationsip Objective","definition":"The target act is a desired outcome of the source act. Source is any act (typically an intervention). Target must be an observation in criterion mood.","property":[{"code":"notSelectable","valueBoolean":true}],"concept":[{"code":"OBJC","display":"has continuing objective","definition":"A desired state that a service action aims to maintain.  E.g., keep systolic blood pressure between 90 and 110 mm Hg.  Source is an intervention service.  Target must be an observation in criterion mood."},{"code":"OBJF","display":"has final objective","definition":"A desired outcome that a service action aims to meet finally.  Source is any service (typically an intervention).  Target must be an observation in criterion mood."}]},{"code":"GOAL","display":"has goal","definition":"A goal that one defines given a patient's health condition.  Subsequently planned actions aim to meet that goal.  Source is an observation or condition node, target must be an observation in goal mood."},{"code":"RISK","display":"has risk","definition":"A noteworthy undesired outcome of a patient's condition that is either likely enough to become an issue or is less likely but dangerous enough to be addressed."}]},{"code":"PERT","display":"has pertinent information","definition":"This is a very unspecific relationship from one item of clinical information to another.  It does not judge about the role the pertinent information plays."},{"code":"PREV","display":"has previous instance","definition":"A relationship in which the target act is a predecessor instance to the source act.  Generally each of these instances is similar, but no identical.  In healthcare coverage it is used to link a claim item to a previous claim item that might have claimed for the same set of services."},{"code":"REFR","display":"refers to","definition":"A relationship in which the target act is referred to by the source act.  This permits a simple reference relationship that distinguishes between the referent and the referee.","concept":[{"code":"USE","display":"uses","definition":"Indicates that the source act makes use of (or will make use of) the information content of the target act.\r\n\n                        \n                           UsageNotes: A usage relationship only makes sense if the target act is authored and occurs independently of the source act.  Otherwise a simpler relationship such as COMP would be appropriate.\r\n\n                        \n                           Rationale: There is a need when defining a clinical trial protocol to indicate that the protocol makes use of other protocol or treatment specifications.  This is stronger than the assertion of \"references\".  References may exist without usage, and in a clinical trial protocol is common to assert both: what other specifications does this trial use and what other specifications does it merely reference."}]},{"code":"REFV","display":"has reference values","definition":"Reference ranges are essentially descriptors of a class of result values assumed to be \"normal\", \"abnormal\", or \"critical.\"  Those can vary by sex, age, or any other criterion. Source and target are observations, the target is in criterion mood.  This link type can act as a trigger in case of alarms being triggered by critical results."},{"code":"RELVBY","display":"relieved by","definition":"Description:The source act is wholly or partially alleviated by the target act. (Example \"chest pain\" RELVBY \"sublingual nitroglycerin administration\")"},{"code":"SEQL","display":"is sequel","definition":"An act relationship indicating that the source act follows the target act. The source act should in principle represent the same kind of act as the target. Source and target need not have the same mood code (mood will often differ). The target of a sequel is called antecedent. Examples for sequel relationships are: revision, transformation, derivation from a prototype (as a specialization is a derivation of a generalization), followup, realization, instantiation.","concept":[{"code":"APND","display":"is appendage","definition":"An addendum (source) to an existing service object (target), containing supplemental information.  The addendum is itself an original service object linked to the supplemented service object.  The supplemented service object remains in place and its content and status are unaltered."},{"code":"BSLN","display":"has baseline","definition":"Indicates that the target observation(s) provide an initial reference for the source observation or observation group.\r\n\n                        \n                           UsageConstraints: Both source and target must be Observations or specializations thereof."},{"code":"COMPLY","display":"complies with","definition":"Description:The source act complies with, adheres to, conforms to, or is permissible under (in whole or in part) the policy, contract, agreement, law, conformance criteria, certification guidelines or requirement conveyed by the target act.\r\n\n                        Examples for compliance relationships are: audits of adherence with a security policy, certificate of conformance to system certification requirements, or consent directive in compliance with or permissible under a privacy policy."},{"code":"DOC","display":"documents","definition":"The source act documents the target act."},{"code":"FLFS","display":"fulfills","definition":"The source act fulfills (in whole or in part) the target act. Source act must be in a mood equal or more actual than the target act.","concept":[{"code":"OCCR","display":"occurrence","definition":"The source act is a single occurrence of a repeatable target act. The source and target act can be in any mood on the \"completion track\" but the source act must be as far as or further along the track than the target act (i.e., the occurrence of an intent can be an event but not vice versa)."},{"code":"OREF","display":"references order","definition":"Relates either an appointment request or an appointment to the order for the service being scheduled."},{"code":"SCH","display":"schedules request","definition":"Associates a specific time (and associated resources) with a scheduling request or other intent."}]},{"code":"GEN","display":"has generalization","definition":"The generalization relationship can be used to express categorical knowledge about services (e.g., amilorid, triamterene, and spironolactone have the common generalization potassium sparing diuretic)."},{"code":"GEVL","display":"evaluates (goal)","definition":"A goal-evaluation links an observation (intent or actual) to a goal to indicate that the observation evaluates the goal. Given the goal and the observation, a \"goal distance\" (e.g., goal to observation) can be \"calculated\" and need not be sent explicitly."},{"code":"INST","display":"instantiates (master)","definition":"Used to capture the link between a potential service (\"master\" or plan) and an actual service, where the actual service instantiates the potential service. The instantiation may override the master's defaults."},{"code":"MOD","display":"modifies","definition":"Definition: Used to link a newer version or 'snapshot' of a business object (source) to an older version or 'snapshot' of the same business object (target).\r\n\n                        \n                           Usage:The identifier of the Act should be the same for both source and target. If the identifiers are distinct, RPLC should be used instead.\r\n\n                        Name from source to target = \"modifiesPrior\"\r\n\n                        Name from target to source = \"modifiesByNew\""},{"code":"MTCH","display":"matches (trigger)","definition":"A trigger-match links an actual service (e.g., an observation or procedure that took place) with a service in criterion mood.  For example if the trigger is \"observation of pain\" and pain is actually observed, and if that pain-observation caused the trigger to fire, that pain-observation can be linked with the trigger."},{"code":"OPTN","display":"has option","definition":"A relationship between a source Act that provides more detailed properties to the target Act.\r\n\n                        The source act thus is a specialization of the target act, but instead of mentioning all the inherited properties it only mentions new property bindings or refinements.\r\n\n                        The typical use case is to specify certain alternative variants of one kind of Act. The priorityNumber attribute is used to weigh refinements as preferred over other alternative refinements.\r\n\n                        Example: several routing options for a drug are specified as one SubstanceAdministration for the general treatment with attached refinements for the various routing options."},{"code":"RCHAL","display":"re-challenge","definition":"Description:A relationship in which the target act is carried out to determine whether an effect attributed to the source act can be recreated."},{"code":"REV","display":"reverses","definition":"A relationship between a source Act that seeks to reverse or undo the action of the prior target Act.\r\n\n                        Example: A posted financial transaction (e.g., a debit transaction) was applied in error and must be reversed (e.g., by a credit transaction) the credit transaction is identified as an undo (or reversal) of the prior target transaction.\r\n\n                        Constraints: the \"completion track\" mood of the target Act must be equally or more \"actual\" than the source act. I.e., when the target act is EVN the source act can be EVN, or any INT. If the target act is INT, the source act can be INT."},{"code":"RPLC","display":"replaces","definition":"A replacement source act replaces an existing target act. The state of the target act being replaced becomes obselete, but the act is typically still retained in the system for historical reference.  The source and target must be of the same type."},{"code":"SUCC","display":"succeeds","definition":"Definition:  A new act that carries forward the intention of the original act, but does not completely replace it.  The status of the predecessor act must be 'completed'.  The original act is the target act and the successor is the source act."},{"code":"UPDT","display":"updates (condition)","definition":"A condition thread relationship specifically links condition nodes together to form a condition thread. The source is the new condition node and the target links to the most recent node of the existing condition thread."},{"code":"XCRPT","display":"Excerpts","definition":"The source is an excerpt from the target.","concept":[{"code":"VRXCRPT","display":"Excerpt verbatim","definition":"The source is a direct quote from the target."}]},{"code":"XFRM","display":"transformation","definition":"Used when the target Act is a transformation of the source Act. (For instance, used to show that a CDA document is a transformation of a DICOM SR document.)"}]},{"code":"SPRT","display":"has support","definition":"Used to indicate that an existing service is suggesting evidence for a new observation. The assumption of support is attributed to the same actor who asserts the observation. Source must be an observation, target may be any service  (e.g., to indicate a status post).","concept":[{"code":"SPRTBND","display":"has bounded support","definition":"A specialization of \"has support\" (SPRT), used to relate a secondary observation to a Region of Interest on a multidimensional observation, if the ROI specifies the true boundaries of the secondary observation as opposed to only marking the approximate area.  For example, if the start and end of an ST elevation episode is visible in an EKG, this relation would indicate the ROI bounds the  \"ST elevation\" observation -- the ROI defines the true beginning and ending of the episode.  Conversely, if a ROI simply contains ST elevation, but it does not define the bounds (start and end) of the episode, the more general \"has support\" relation is used.  Likewise, if a ROI on an image defines the true bounds of a \"1st degree burn\", the relation \"has bounded support\" is used; but if the ROI only points to the approximate area of the burn, the general \"has support\" relation is used."}]},{"code":"SUBJ","display":"has subject","definition":"Relates an Act to its subject Act that the first Act is primarily concerned with.\r\n\n                        Examples\r\n\n                        \n                           \n                              The first Act may be a ControlAct manipulating the subject Act \r\n\n                           \n                           \n                              The first act is a region of interest (ROI) that defines a region within the subject Act.\r\n\n                           \n                           \n                              The first act is a reporting or notification Act, that echos the subject Act for a specific new purpose.\r\n\n                           \n                        \n                        Constraints\r\n\n                        An Act may have multiple subject acts.\r\n\n                        Rationale\r\n\n                        The ActRelationshipType \"has subject\" is similar to the ParticipationType \"subject\", Acts that primarily operate on physical subjects use the Participation, those Acts that primarily operate on other Acts (other information) use the ActRelationship.","concept":[{"code":"QUALF","display":"has qualifier","definition":"The target observation qualifies (refines) the semantics of the source observation.\r\n\n                        \n                           UsageNote: This is not intended to replace concept refinement and qualification via vocabulary.  It is used when there are multiple components which together provide the complete understanding of the source Act."}]},{"code":"SUMM","display":"summarized by","definition":"An act that contains summary values for a list or set of subordinate acts.  For example, a summary of transactions for a particular accounting period."},{"code":"VALUE","display":"has value","definition":"Description:Indicates that the target Act represents the result of the source observation Act.\r\n\n                        \n                           FormalConstraint: Source Act must be an Observation or specialization there-of. Source Act must not have the value attribute specified\r\n\n                        \n                           UsageNote: This relationship allows the result of an observation to be fully expressed as RIM acts as opposed to being embedded in the value attribute.  For example, sending a Document act as the result of an imaging observation, sending a list of Procedures and/or other acts as the result of a medical history observation.\r\n\n                        The valueNegationInd attribute on the source Act has the same semantics of \"negated finding\" when it applies to the target of a VALUE ActRelationship as it does to the value attribute.  On the other hand, if the ActRelationship.negationInd is true for a VALUE ActRelationship, that means the specified observation does not have the indicated value but does not imply a negated finding.  Because the semantics are extremely close, it is recommended that Observation.valueNegationInd be used, not ActRelationship.negationInd.\r\n\n                        \n                           OpenIssue: The implications of negationInd on ActRelationship and the valueNegationind on Observation."}]},{"code":"CURE","display":"curative indication","definition":"curative indication","property":[{"code":"inactive","valueBoolean":true}]},{"code":"CURE.ADJ","display":"adjunct curative indication","definition":"adjunct curative indication","property":[{"code":"inactive","valueBoolean":true}]},{"code":"MTGT.ADJ","display":"adjunct mitigation","definition":"adjunct mitigation","property":[{"code":"inactive","valueBoolean":true}]},{"code":"RACT","property":[{"code":"inactive","valueBoolean":true}]},{"code":"SUGG","property":[{"code":"inactive","valueBoolean":true}]}]}