{"resourceType":"DataElement","id":"AllergyIntolerance.reaction.substance","meta":{"lastUpdated":"2017-04-19T07:44:43.294+10:00"},"url":"http://hl7.org/fhir/DataElement/AllergyIntolerance.reaction.substance","status":"draft","experimental":true,"stringency":"fully-specified","element":[{"id":"AllergyIntolerance.reaction.substance","path":"AllergyIntolerance.reaction.substance","short":"Specific substance or pharmaceutical product considered to be responsible for event","definition":"Identification of the specific substance (or pharmaceutical product) considered to be responsible for the Adverse Reaction event. Note: the substance for a specific reaction may be different from the substance identified as the cause of the risk, but it must be consistent with it. For instance, it may be a more specific substance (e.g. a brand medication) or a composite product that includes the identified substance. It must be clinically safe to only process the 'code' and ignore the 'reaction.substance'.","comment":"Coding of the specific substance (or pharmaceutical product) with a terminology capable of triggering decision support should be used wherever possible.  The 'code' element allows for the use of a specific substance or pharmaceutical product, or a group or class of substances. In the case of an allergy or intolerance to a class of substances, (for example, \"penicillins\"), the 'reaction.substance' element could be used to code the specific substance that was identifed as having caused the reaction (for example, \"amoxycillin\"). Duplication of the value in the 'code' and 'reaction.substance' elements is acceptable when a specific substance has been recorded in 'code'.","min":0,"max":"1","type":[{"code":"CodeableConcept"}],"binding":{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/elementdefinition-bindingName","valueString":"SubstanceCode"}],"strength":"example","description":"Codes defining the type of the substance (including pharmaceutical products).","valueSetReference":{"reference":"http://hl7.org/fhir/ValueSet/substance-code"}},"mapping":[{"identity":"rim","map":"outBoundRelationship[typeCode=SAS].target[classCode=SBADM, code <= ExposureCode].participation[typeCode=CSM].role[classCode=ADMM].player[classCode=MAT, determinerCode=KIND, code <= ExposureAgentEntityType]"}]}]}