{"resourceType":"DataElement","id":"Observation.subject","meta":{"lastUpdated":"2017-04-19T07:44:43.294+10:00"},"url":"http://hl7.org/fhir/DataElement/Observation.subject","status":"draft","experimental":true,"stringency":"fully-specified","element":[{"id":"Observation.subject","path":"Observation.subject","short":"Who and/or what this is about","definition":"The patient, or group of patients, location, or device whose characteristics (direct or indirect) are described by the observation and into whose record the observation is placed.  Comments: Indirect characteristics may be those of a specimen, fetus, donor,  other observer (for example a relative or EMT), or any observation made about the subject.","comment":"One would expect this element to be a cardinality  of 1..1.  The only circumstance in which the subject can be missing is when the observation is made by a device that does not know the patient. In this case, the observation SHALL be matched to a patient through some context/channel matching technique, and at this point, the observation should be updated.\r\rIf the target of the observation is different than the subject, the general extension [observation-focal-subject](extension-observation-focal-subject.html).  may be used.  However, the distinction between the patient's own value for an observation versus that of the fetus, or the donor or blood product unit, etc., are often specified in the observation code.","requirements":"Observations have no value if you don't know who or what they're about.","min":0,"max":"1","type":[{"code":"Reference","targetProfile":"http://hl7.org/fhir/StructureDefinition/Patient"},{"code":"Reference","targetProfile":"http://hl7.org/fhir/StructureDefinition/Group"},{"code":"Reference","targetProfile":"http://hl7.org/fhir/StructureDefinition/Device"},{"code":"Reference","targetProfile":"http://hl7.org/fhir/StructureDefinition/Location"}],"isSummary":true,"mapping":[{"identity":"workflow","map":"Event.subject"},{"identity":"v2","map":"PID-3"},{"identity":"rim","map":"participation[typeCode=SBJ]"},{"identity":"w5","map":"who.focus"}]}]}