{"resourceType":"DataElement","id":"Contract.securityLabel","meta":{"lastUpdated":"2017-04-19T07:44:43.294+10:00"},"url":"http://hl7.org/fhir/DataElement/Contract.securityLabel","status":"draft","experimental":true,"stringency":"fully-specified","element":[{"id":"Contract.securityLabel","path":"Contract.securityLabel","short":"Security Labels that define affected resources","definition":"A set of security labels that define which resources are controlled by this consent. If more than one label is specified, all resources must have all the specified labels.","min":0,"max":"*","type":[{"code":"Coding"}],"isSummary":true,"binding":{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/elementdefinition-bindingName","valueString":"SecurityLabels"},{"url":"http://hl7.org/fhir/StructureDefinition/elementdefinition-isCommonBinding","valueBoolean":true}],"strength":"extensible","description":"Security Labels from the Healthcare Privacy and Security Classification System.","valueSetReference":{"reference":"http://hl7.org/fhir/ValueSet/security-labels"}},"mapping":[{"identity":"rim","map":"ActCode ObservationType:SECOBS [abstract term]\rDescription: An observation identifying security metadata about an IT resource (data, information object, service, or system capability), which may be used to make access control decisions. Security metadata are used to name security labels. \rRationale: According to ISO/TS 22600-3:2009(E) A.9.1.7 SECURITY LABEL MATCHING, Security label matching compares the initiator's clearance to the target's security label. All of the following must be true for authorization to be granted:\rThe security policy identifiers shall be identical.  The classification level of the initiator shall be greater than or equal to that of the target (that is, there shall be at least one value in the classification list of the clearance greater than or equal to the classification of the target), and For each security category in the target label, there shall be a security category of the same type in the initiator's clearance and the initiator's classification level shall dominate that of the target. Examples: SecurityObservationType security label fields include: Confidentiality classification; Compartment category; Sensitivity category\rSecurity mechanisms used to ensure data integrity or to perform authorized data transformation Indicators of an IT resource completeness, veracity, reliability, trustworthiness, or provenance. Usage Note: SecurityObservationType codes designate security label field types, which are valued with an applicable SecurityObservationValue code as the \"security label tag\".  _SecurityObservationValue [abstract term] Description: Observation values used to indicate security observation metadata."}]}]}