{"resourceType":"ValueSet","id":"security-role-type","meta":{"lastUpdated":"2017-04-19T07:44:43.294+10:00"},"text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\"> This value set includes example contract singer\n            codes. \n            <hr/>\n            <h2>SecurityRoleType</h2>\n            <div>\n              <p>This example FHIR value set is comprised of example Actor Type codes, which can be used to value FHIR agents, actors, and other role         elements such as those specified in financial transactions. The FHIR Actor value set is based on    DICOM Audit Message, C402;   ASTM Standard, E1762-95 [2013]; selected codes and          derived actor roles from HL7 RoleClass OID 2.16.840.1.113883.5.110;    HL7 Role Code 2.16.840.1.113883.5.111, including AgentRoleType;          HL7 ParticipationType OID: 2.16.840.1.113883.5.90; and    HL7 ParticipationFunction codes OID: 2.16.840.1.113883.5.88.           This value set includes, by reference, role codes from external code systems: NUCC Health Care Provider Taxonomy OID: 2.16.840.1.113883.6.101;          North American Industry Classification System [NAICS]OID: 2.16.840.1.113883.6.85; IndustryClassificationSystem 2.16.840.1.113883.1.11.16039;          and US Census Occupation Code OID: 2.16.840.1.113883.6.243 for relevant recipient or custodian codes not included in this value set.            If no source is indicated in the definition comments, then these are example FHIR codes.          It can be extended with appropriate roles described by SNOMED as well as those described in the HL7 Role Based Access Control Catalog and the          HL7 Healthcare (Security and Privacy) Access Control Catalog.            In Role-Based Access Control (RBAC), permissions are operations on an object that a user wishes to access. Permissions are grouped into roles.          A role characterizes the functions a user is allowed to perform. Roles are assigned to users. If the user's role has the appropriate permissions          to access an object, then that user is granted access to the object. FHIR readily enables RBAC, as FHIR Resources are object types and the CRUDE          events (the FHIR equivalent to permissions in the RBAC scheme) are operations on those objects.          In Attribute-Based Access Control (ABAC), a user requests to perform operations on objects. That user's access request is granted or denied          based on a set of access control policies that are specified in terms of attributes and conditions. FHIR readily enables ABAC, as instances of          a Resource in FHIR (again, Resources are object types) can have attributes associated with them. These attributes include security tags,          environment conditions, and a host of user and object characteristics, which are the same attributes as those used in ABAC. Attributes help          define the access control policies that determine the operations a user may perform on a Resource (in FHIR) or object (in ABAC). For example,          a tag (or attribute) may specify that the identified Resource (object) is not to be further disclosed without explicit consent from the patient.</p>\n\n            </div>\n            <p>\n              <b>Copyright Statement:</b> This is an example FHIR value set based on ASTM Standard, E1762-95 (2013) HL7 RoleClass OID 2.16.840.1.113883.5.110,          HL7 Role Code 2.16.840.1.113883.5.111, HL7 ParticipationType OID: 2.16.840.1.113883.5.90, HL7 ParticipationFunction codes at OID: 2.16.840.1.113883.5.88,          and HL7 Security and Privacy Domain Analysis Model roles classes.   These codes are excerpted from Digital Imaging and Communications in Medicine (DICOM) Standard, Part 16: Content Mapping Resource, Copyright © 2011 by the National Electrical Manufacturers Association.\n            </p>\n            <p>This value set includes codes from the following code systems:</p>\n            <ul>\n              <li>Include these codes as defined in \n                <a href=\"codesystem-contract-signer-type.html\">\n                  <code>http://www.hl7.org/fhir/contractsignertypecodes</code>\n                </a>\n                <table class=\"none\">\n                  <tr>\n                    <td>\n                      <b>Code</b>\n                    </td>\n                    <td>\n                      <b>Display</b>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-AMENDER\">AMENDER</a>\n                    </td>\n                    <td>Amender</td>\n                    <td>A person who has corrected, edited, or amended pre-existing information.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-COAUTH\">COAUTH</a>\n                    </td>\n                    <td>Co-Author</td>\n                    <td>The entity that co-authored content. There can be multiple co-authors of content,which may take such forms as a  such as a contract, a healthcare record entry or document, a policy, or a consent directive.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-CONT\">CONT</a>\n                    </td>\n                    <td>Contact</td>\n                    <td>A person or an organization that provides or receives information regarding another entity. Examples; patient NOK and emergency contacts; guarantor contact; employer contact.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-EVTWIT\">EVTWIT</a>\n                    </td>\n                    <td>Event Witness</td>\n                    <td>A person who attests to observing an occurrence.  For example, the witness has observed a procedure and is attesting to this fact.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-PRIMAUTH\">PRIMAUTH</a>\n                    </td>\n                    <td>Primary Author</td>\n                    <td>An entity that is the primary or sole author of information content.  In the healthcare context, there can be only one primary author of health information content in a record entry or document.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-REVIEWER\">REVIEWER</a>\n                    </td>\n                    <td>Reviewer</td>\n                    <td>A person, device, or algorithm that has used approved criteria for filtered data for inclusion into the patient record.  Examples: (1) a medical records clerk who scans a document for inclusion in the medical record, enters header information, or catalogues and classifies the data, or a combination thereof; (2) a gateway that receives data from another computer system and interprets that data or changes its format, or both, before entering it into the patient record.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-SOURCE\">SOURCE</a>\n                    </td>\n                    <td>Source</td>\n                    <td>An automated data source that generates a signature along with content. Examples: (1) the signature for an image that is generated by a device for inclusion in the patient record; (2) the signature for an ECG derived by an ECG system for inclusion in the patient record; (3) the data from a biomedical monitoring device or system that is for inclusion in the patient record.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-TRANS\">TRANS</a>\n                    </td>\n                    <td>Transcriber</td>\n                    <td>An entity entering the data into the originating system. This includes the transcriptionist for dictated text transcribed into electronic form.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-VALID\">VALID</a>\n                    </td>\n                    <td>Validator</td>\n                    <td>A person who validates a health information document for inclusion in the patient record. For example, a medical student or resident is credentialed to perform history or physical examinations and to write progress notes. The attending physician signs the history and physical examination to validate the entry for inclusion in the patient's medical record.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-contract-signer-type.html#contract-signer-type-VERF\">VERF</a>\n                    </td>\n                    <td>Verifier</td>\n                    <td>A person who asserts the correctness and appropriateness of an act or the recording of the act, and is accountable for the assertion that the act or the recording of the act complies with jurisdictional or organizational policy. For example, a physician is required to countersign a verbal order that has previously been recorded in the medical record by a registered nurse who has carried out the verbal order.</td>\n                  </tr>\n                </table>\n              </li>\n              <li>Include these codes as defined in \n                <a href=\"v3/RoleClass/cs.html\">\n                  <code>http://hl7.org/fhir/v3/RoleClass</code>\n                </a>\n                <table class=\"none\">\n                  <tr>\n                    <td>\n                      <b>Code</b>\n                    </td>\n                    <td>\n                      <b>Display</b>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-AFFL\">AFFL</a>\n                    </td>\n                    <td>affiliate</td>\n                    <td>Player of the Affiliate role has a business/professional relationship with scoper.  Player and scoper may be persons or organization.  The Affiliate relationship does not imply membership in a group, nor does it exist for resource scheduling purposes.\n                      <br/>\n                        \n                           Example: A healthcare provider is affiliated with another provider as a business associate.\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-AGNT\">AGNT</a>\n                    </td>\n                    <td>agent</td>\n                    <td>An entity (player) that acts or is authorized to act on behalf of another entity (scoper).</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-ASSIGNED\">ASSIGNED</a>\n                    </td>\n                    <td>assigned entity</td>\n                    <td>An agent role in which the agent is an Entity acting in the employ of an organization.  The focus is on functional role on behalf of the organization, unlike the Employee role where the focus is on the 'Human Resources' relationship between the employee and the organization.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-CLAIM\">CLAIM</a>\n                    </td>\n                    <td>claimant</td>\n                    <td>Description: A role played by a party making a claim for coverage under a policy or program.  A claimant must be either a person or organization, or a group of persons or organizations.  A claimant is not a named insured or a program eligible.\n                      <br/>\n                        \n                           Discussion: With respect to liability insurance such as property and casualty insurance, a claimant must file a claim requesting indemnification for a loss that the claimant considers covered under the policy of a named insured.  The claims adjuster for the policy underwriter will review the claim to determine whether the loss meets the benefit coverage criteria under a policy, and base any indemnification or coverage payment on that review.  If a third party is liable in whole or part for the loss, the underwriter may pursue third party liability recovery.  A claimant may be involved in civil or criminal legal proceedings involving claims against a defendant party that is indemnified by an insurance policy or to protest the finding of a claims adjustor. With respect to life insurance, a beneficiary designated by a named insured becomes a claimant of the proceeds of coverage, as in the case of a life insurance policy.  However, a claimant for coverage under life insurance is not necessarily a designated beneficiary.\n                      <br/>\n                        \n                           Note: A claimant is not a named insured.  However, a named insured may make a claim under a policy, e.g., an insured driver may make a claim for an injury under his or her comprehensive automobile insurance policy.  Similarly, a program eligible may make a claim under program, e.g., an unemployed worker may claim benefits under an unemployment insurance program, but parties playing these covered party role classes are not, for purposes of this vocabulary and in an effort to clearly distinguish role classes, considered claimants.\n                      <br/>\n                        In the case of a named insured making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that either a named insured or an individual insured has filed a claim for a loss.  In the case of a program eligible, a role type code INJWKR (injured worker) subtypes the class to indicate that the covered party in a workers compensation program is an injured worker, and as such, has filed a &quot;claim&quot; under the program for benefits.  Likewise, a covered role type code UNEMP (unemployed worker) subtypes the program eligible class to indicate that the covered party in an unemployment insurance program has filed a claim for unemployment benefits.\n                      <br/>\n                        \n                           Example: A claimant under automobile policy that is not the named insured.\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-COVPTY\">COVPTY</a>\n                    </td>\n                    <td>covered party</td>\n                    <td>A role class played by a person who receives benefit coverage under the terms of a particular insurance policy.  The underwriter of that policy is the scoping entity.  The covered party receives coverage because of some contractual or other relationship with the holder of that policy.\n                      <br/>\n                        \n                           Discussion:This reason for coverage is captured in 'Role.code' and a relationship link with type code of indirect authority should be included using the policy holder role as the source, and the covered party role as the target.\n                      <br/>\n                        Note that a particular policy may cover several individuals one of whom may be, but need not be, the policy holder.  Thus the notion of covered party is a role that is distinct from that of the policy holder.\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-DEPEN\">DEPEN</a>\n                    </td>\n                    <td>dependent</td>\n                    <td>Description: A role played by a person covered under a policy or program based on an association with a subscriber, which is recognized by the policy holder.\n                      <br/>\n                        \n                           Note:  The party playing the role of a dependent is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant).  However, a dependent may make a claim under a policy, e.g., a dependent under a health insurance policy may become the claimant for coverage under that policy for wellness examines or if injured and there is no liable third party.  In the case of a dependent making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that the dependent has filed a claim for services covered under the health insurance policy.\n                      <br/>\n                        \n                           Example: The dependent has an association with the subscriber such as a financial dependency or personal relationship such as that of a spouse, or a natural or adopted child.  The policy holder may be required by law to recognize certain associations or may have discretion about the associations.  For example, a policy holder may dictate the criteria for the dependent status of adult children who are students, such as requiring full time enrollment, or may recognize domestic partners as dependents.  Under certain circumstances, the dependent may be under the indirect authority of a responsible party acting as a surrogate for the subscriber, for example, if the subscriber is differently abled or deceased, a guardian ad Lidem or estate executor may be appointed to assume the subscriberaTMs legal standing in the relationship with the dependent.\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-ECON\">ECON</a>\n                    </td>\n                    <td>emergency contact</td>\n                    <td>An entity to be contacted in the event of an emergency.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-EMP\">EMP</a>\n                    </td>\n                    <td>employee</td>\n                    <td>A relationship between a person or organization and a person or organization formed for the purpose of exchanging work for compensation.  The purpose of the role is to identify the type of relationship the employee has to the employer, rather than the nature of the work actually performed.  (Contrast with AssignedEntity.)</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-GUARD\">GUARD</a>\n                    </td>\n                    <td>guardian</td>\n                    <td>Guardian of a ward</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-INVSBJ\">INVSBJ</a>\n                    </td>\n                    <td>Investigation Subject</td>\n                    <td>An entity that is the subject of an investigation. This role is scoped by the party responsible for the investigation.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-NAMED\">NAMED</a>\n                    </td>\n                    <td>named insured</td>\n                    <td>Description: A role played by a party to an insurance policy to which the insurer agrees to indemnify for losses, provides benefits for, or renders services.  A named insured may be either a person, non-person living subject, or an organization, or a group of persons, non-person living subjects, or organizations.\n                      <br/>\n                        \n                           Discussion: The coded concept NAMED should not be used where a more specific child concept in this Specializable value set applies.  In some cases, the named insured may not be the policy holder, e.g., where a policy holder purchases life insurance policy in which another party is the named insured and the policy holder is the beneficiary of the policy.\n                      <br/>\n                        \n                           Note: The party playing the role of a named insured is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant).  However, a named insured may make a claim under a policy, e.g., e.g., a party that is the named insured and policy holder under a comprehensive automobile insurance policy may become the claimant for coverage under that policy e.g., if injured in an automobile accident and there is no liable third party.  In the case of a named insured making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that a named insured has filed a claim for a loss.\n                      <br/>\n                        \n                           Example: The named insured under a comprehensive automobile, disability, or property and casualty policy that is the named insured and may or may not be the policy holder.\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-NOK\">NOK</a>\n                    </td>\n                    <td>next of kin</td>\n                    <td>An individual designated for notification as the next of kin for a given entity.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-PAT\">PAT</a>\n                    </td>\n                    <td>patient</td>\n                    <td>A Role of a LivingSubject (player) as an actual or potential recipient of health care services from a healthcare provider organization (scoper).\n                      <br/>\n                        \n                           Usage Note: Communication about relationships between patients and specific healthcare practitioners (people) is not done via scoper.  Instead this is generally done using the CareProvision act.  This allows linkage between patient and a particular healthcare practitioner role and also allows description of the type of care involved in the relationship.\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-PROV\">PROV</a>\n                    </td>\n                    <td>healthcare provider</td>\n                    <td>An Entity (player) that is authorized to provide health care services by some authorizing agency (scoper).</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleClass/cs.html#v3-RoleClass-NOT\">NOT</a>\n                    </td>\n                    <td>notary public</td>\n                    <td>notary public</td>\n                  </tr>\n                </table>\n              </li>\n              <li>Include these codes as defined in \n                <a href=\"v3/RoleCode/cs.html\">\n                  <code>http://hl7.org/fhir/v3/RoleCode</code>\n                </a>\n                <table class=\"none\">\n                  <tr>\n                    <td>\n                      <b>Code</b>\n                    </td>\n                    <td>\n                      <b>Display</b>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-CLASSIFIER\">CLASSIFIER</a>\n                    </td>\n                    <td>classifier</td>\n                    <td>An individual authorized to assign an original classification to information, including compilations of unclassified information, based on a determination that the information requires protection against unauthorized disclosure. The individual marks the information with immutable, computable, and human readable security labels in accordance with applicable security labeling policies.  The labeling policies provide instructions on whether and if so how the security labels may be later reclassified [i.e., upgraded, downgraded, used in derivative classification, or declassified] in a manner that preserves the overridden original classification binding and provenance.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-CONSENTER\">CONSENTER</a>\n                    </td>\n                    <td>consenter</td>\n                    <td>An entity or an entity's delegatee who is the grantee in an agreement such as a consent for services, advanced directive, or a privacy consent directive in accordance with jurisdictional, organizational, or patient policy.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-CONSWIT\">CONSWIT</a>\n                    </td>\n                    <td>consent witness</td>\n                    <td>An entity which has witnessed and attests to observing another entity being counseled about an agreement such as a consent for services, advanced directive, or a privacy consent directive.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-COPART\">COPART</a>\n                    </td>\n                    <td>co-participant</td>\n                    <td>An entity which participates in the generation of and attest to veracity of content, but is not an author or coauthor. For example a surgeon who is required by institutional, regulatory, or legal rules to sign an operative report, but who was not involved in the authorship of that report.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-DECLASSIFIER\">DECLASSIFIER</a>\n                    </td>\n                    <td>declassifier</td>\n                    <td>An individual which is authorized to declassify information based on a determination that the information no longer requires protection against unauthorized disclosure.  The individual marks the information being declassified using computable and human readable security labels indicating that this is copy of previously classified information is unclassified in accordance with applicable security labeling policies.  The labeling policies provide instructions on whether and if so how the security labels may be later reclassified [i.e., upgraded or used in derivative classification] in a manner that preserves the overridden original classification binding and provenance.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-DELEGATEE\">DELEGATEE</a>\n                    </td>\n                    <td>delegatee</td>\n                    <td>A party to whom some right or authority is granted by a delegator.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-DELEGATOR\">DELEGATOR</a>\n                    </td>\n                    <td>delegator</td>\n                    <td>A party that grants all or some portion its right or authority to another party.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-DOWNGRDER\">DOWNGRDER</a>\n                    </td>\n                    <td>downgrader</td>\n                    <td>An individual authorized to lower the classification level of labeled content and provide rationale for doing so as directed by a classification guide.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-DPOWATT\">DPOWATT</a>\n                    </td>\n                    <td>durable power of attorney</td>\n                    <td>A relationship between two people in which one person authorizes another, usually a family member or relative, to act for him or her in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts that is often limited in the kinds of powers that can be assigned.  Unlike ordinary powers of attorney, durable powers can survive for long periods of time, and again, unlike standard powers of attorney, durable powers can continue after incompetency.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-EXCEST\">EXCEST</a>\n                    </td>\n                    <td>executor of estate</td>\n                    <td>The role played by a person acting as the estate executor for a deceased subscriber or policyholder who was the responsible party</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-GRANTEE\">GRANTEE</a>\n                    </td>\n                    <td>grantee</td>\n                    <td>An entity which accepts certain rights or authority from a grantor.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-GRANTOR\">GRANTOR</a>\n                    </td>\n                    <td>grantor</td>\n                    <td>An entity which agrees to confer certain rights or authority to a grantee.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-GT\">GT</a>\n                    </td>\n                    <td>Guarantor</td>\n                    <td>An individual or organization that makes or gives a promise, assurance, pledge to pay or has paid the healthcare service provider.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-GUADLTM\">GUADLTM</a>\n                    </td>\n                    <td>guardian ad lidem</td>\n                    <td>The role played by a person appointed by the court to look out for the best interests of a minor child during the course of legal proceedings.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-HPOWATT\">HPOWATT</a>\n                    </td>\n                    <td>healthcare power of attorney</td>\n                    <td>A relationship between two people in which one person authorizes another to act for him or her in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts that continues (by its terms) to be effective even though the grantor has become mentally incompetent after signing the document.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-INTPRTER\">INTPRTER</a>\n                    </td>\n                    <td>interpreter</td>\n                    <td>An entity which converts spoken or written language into the language of key participants in an event such as when a provider is obtaining a patient's consent to treatment or permission to disclose information.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-POWATT\">POWATT</a>\n                    </td>\n                    <td>power of attorney</td>\n                    <td>A relationship between two people in which one person authorizes another to act for him in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-RESPRSN\">RESPRSN</a>\n                    </td>\n                    <td>responsible party</td>\n                    <td>The role played by a party who has legal responsibility for another party.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/RoleCode/cs.html#v3-RoleCode-SPOWATT\">SPOWATT</a>\n                    </td>\n                    <td>special power of attorney</td>\n                    <td>A relationship between two people in which one person authorizes another to act for him or her in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts that is often limited in the kinds of powers that can be assigned.</td>\n                  </tr>\n                </table>\n              </li>\n              <li>Include codes from \n                <a href=\"v3/RoleCode/cs.html\">\n                  <code>http://hl7.org/fhir/v3/RoleCode</code>\n                </a> where concept  is-a  \n                <a href=\"v3/RoleCode/cs.html#v3-RoleCode-_CitizenRoleType\">_CitizenRoleType</a>\n              </li>\n              <li>Include these codes as defined in \n                <a href=\"v3/ParticipationFunction/cs.html\">\n                  <code>http://hl7.org/fhir/v3/ParticipationFunction</code>\n                </a>\n                <table class=\"none\">\n                  <tr>\n                    <td>\n                      <b>Code</b>\n                    </td>\n                    <td>\n                      <b>Display</b>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationFunction/cs.html#v3-ParticipationFunction-AUCG\">AUCG</a>\n                    </td>\n                    <td>caregiver information receiver</td>\n                    <td>Description:Caregiver authorized to receive patient health information.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationFunction/cs.html#v3-ParticipationFunction-AULR\">AULR</a>\n                    </td>\n                    <td>legitimate relationship information receiver</td>\n                    <td>Description:Provider with legitimate relationship authorized to receive patient health information.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationFunction/cs.html#v3-ParticipationFunction-AUTM\">AUTM</a>\n                    </td>\n                    <td>care team information receiver</td>\n                    <td>Description:Member of care team authorized to receive patient health information.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationFunction/cs.html#v3-ParticipationFunction-AUWA\">AUWA</a>\n                    </td>\n                    <td>work area information receiver</td>\n                    <td>Description:Entities within specified work area authorized to receive patient health information.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationFunction/cs.html#v3-ParticipationFunction-PROMSK\">PROMSK</a>\n                    </td>\n                    <td>authorized provider masking author</td>\n                    <td>Definition:Provider authorized to mask information to protect the patient, a third party, or to ensure that the provider has consulted with the patient prior to release of this information.</td>\n                  </tr>\n                </table>\n              </li>\n              <li>Include these codes as defined in \n                <a href=\"v3/ParticipationType/cs.html\">\n                  <code>http://hl7.org/fhir/v3/ParticipationType</code>\n                </a>\n                <table class=\"none\">\n                  <tr>\n                    <td>\n                      <b>Code</b>\n                    </td>\n                    <td>\n                      <b>Display</b>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationType/cs.html#v3-ParticipationType-AUT\">AUT</a>\n                    </td>\n                    <td>author (originator)</td>\n                    <td>Definition: A party that originates the Act and therefore has responsibility for the information given in the Act and ownership of this Act.\n                      <br/>\n                        \n                           Example: the report writer, the person writing the act definition, the guideline author, the placer of an order, the EKG cart (device) creating a report etc. Every Act should have an author. Authorship is regardless of mood always actual authorship. \n                      <br/>\n                        Examples of such policies might include:\n                      <br/>\n                        \n                           \n                              The author and anyone they explicitly delegate may update the report;\n                      <br/>\n                           \n                           \n                              All administrators within the same clinic may cancel and reschedule appointments created by other administrators within that clinic;\n                      <br/>\n                           \n                        \n                        A party that is neither an author nor a party who is extended authorship maintenance rights by policy, may only amend, reverse, override, replace, or follow up in other ways on this Act, whereby the Act remains intact and is linked to another Act authored by that other party.\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationType/cs.html#v3-ParticipationType-CST\">CST</a>\n                    </td>\n                    <td>custodian</td>\n                    <td>An entity (person, organization or device) that is in charge of maintaining the information of this act (e.g., who maintains the report or the master service catalog item, etc.).</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationType/cs.html#v3-ParticipationType-INF\">INF</a>\n                    </td>\n                    <td>informant</td>\n                    <td>A source of reported information (e.g., a next of kin who answers questions about the patient's history).  For history questions, the patient is logically an informant, yet the informant of history questions is implicitly the subject.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationType/cs.html#v3-ParticipationType-IRCP\">IRCP</a>\n                    </td>\n                    <td>information recipient</td>\n                    <td>A party, who may or should receive or who has recieved the Act or subsequent or derivative information of that Act. Information recipient is inert, i.e., independent of mood.&quot; Rationale: this is a generalization of a too diverse family that the definition can't be any more specific, and the concept is abstract so one of the specializations should be used.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationType/cs.html#v3-ParticipationType-LA\">LA</a>\n                    </td>\n                    <td>legal authenticator</td>\n                    <td>A verifier who legally authenticates the accuracy of an act. An example would be a staff physician who sees a patient and dictates a note, then later signs it. Their signature constitutes a legal authentication.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationType/cs.html#v3-ParticipationType-IRCP\">IRCP</a>\n                    </td>\n                    <td>information recipient</td>\n                    <td>A party, who may or should receive or who has recieved the Act or subsequent or derivative information of that Act. Information recipient is inert, i.e., independent of mood.&quot; Rationale: this is a generalization of a too diverse family that the definition can't be any more specific, and the concept is abstract so one of the specializations should be used.</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationType/cs.html#v3-ParticipationType-TRC\">TRC</a>\n                    </td>\n                    <td>tracker</td>\n                    <td>A secondary information recipient, who receives copies (e.g., a primary care provider receiving copies of results as ordered by specialist).</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"v3/ParticipationType/cs.html#v3-ParticipationType-WIT\">WIT</a>\n                    </td>\n                    <td>witness</td>\n                    <td>Only with service events.  A person witnessing the action happening without doing anything.  A witness is not necessarily aware, much less approves of anything stated in the service event.  Example for a witness is students watching an operation or an advanced directive witness.</td>\n                  </tr>\n                </table>\n              </li>\n              <li>Include all codes defined in \n                <a href=\"codesystem-extra-security-role-type.html\">\n                  <code>http://hl7.org/fhir/extra-security-role-type</code>\n                </a>\n              </li>\n              <li>Include these codes as defined in \n                <a href=\"http://dicom.nema.org/resources/ontology/DCM\">\n                  <code>http://dicom.nema.org/resources/ontology/DCM</code>\n                </a>\n                <table class=\"none\">\n                  <tr>\n                    <td>\n                      <b>Code</b>\n                    </td>\n                    <td>\n                      <b>Display</b>\n                    </td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-dicom-dcim.html#dicom-dcim-110150\">110150</a>\n                    </td>\n                    <td>Application</td>\n                    <td>Audit participant role ID of software application</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-dicom-dcim.html#dicom-dcim-110151\">110151</a>\n                    </td>\n                    <td>Application Launcher</td>\n                    <td>Audit participant role ID of software application launcher, i.e., the entity that started or stopped an application</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-dicom-dcim.html#dicom-dcim-110152\">110152</a>\n                    </td>\n                    <td>Destination Role ID</td>\n                    <td>Audit participant role ID of the receiver of data</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-dicom-dcim.html#dicom-dcim-110153\">110153</a>\n                    </td>\n                    <td>Source Role ID</td>\n                    <td>Audit participant role ID of the sender of data</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-dicom-dcim.html#dicom-dcim-110154\">110154</a>\n                    </td>\n                    <td>Destination Media</td>\n                    <td>Audit participant role ID of media receiving data during an export</td>\n                  </tr>\n                  <tr>\n                    <td>\n                      <a href=\"codesystem-dicom-dcim.html#dicom-dcim-110155\">110155</a>\n                    </td>\n                    <td>Source Media</td>\n                    <td>Audit participant role ID of media providing data during an import</td>\n                  </tr>\n                </table>\n              </li>\n            </ul>\n          </div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-wg","valueCode":"sec"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-ballot-status","valueString":"Trial Use"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":3}],"url":"http://hl7.org/fhir/ValueSet/security-role-type","version":"1.8.0","name":"SecurityRoleType","status":"draft","experimental":false,"date":"2017-01-30T18:00:00+01:00","publisher":"HL7 (FHIR Project)","contact":[{"telecom":[{"system":"url","value":"http://hl7.org/fhir"},{"system":"email","value":"fhir@lists.hl7.org"}]}],"description":"This example FHIR value set is comprised of example Actor Type codes, which can be used to value FHIR agents, actors, and other role         elements such as those specified in financial transactions. The FHIR Actor value set is based on    DICOM Audit Message, C402;   ASTM Standard, E1762-95 [2013]; selected codes and          derived actor roles from HL7 RoleClass OID 2.16.840.1.113883.5.110;    HL7 Role Code 2.16.840.1.113883.5.111, including AgentRoleType;          HL7 ParticipationType OID: 2.16.840.1.113883.5.90; and    HL7 ParticipationFunction codes OID: 2.16.840.1.113883.5.88.           This value set includes, by reference, role codes from external code systems: NUCC Health Care Provider Taxonomy OID: 2.16.840.1.113883.6.101;          North American Industry Classification System [NAICS]OID: 2.16.840.1.113883.6.85; IndustryClassificationSystem 2.16.840.1.113883.1.11.16039;          and US Census Occupation Code OID: 2.16.840.1.113883.6.243 for relevant recipient or custodian codes not included in this value set.            If no source is indicated in the definition comments, then these are example FHIR codes.          It can be extended with appropriate roles described by SNOMED as well as those described in the HL7 Role Based Access Control Catalog and the          HL7 Healthcare (Security and Privacy) Access Control Catalog.            In Role-Based Access Control (RBAC), permissions are operations on an object that a user wishes to access. Permissions are grouped into roles.          A role characterizes the functions a user is allowed to perform. Roles are assigned to users. If the user's role has the appropriate permissions          to access an object, then that user is granted access to the object. FHIR readily enables RBAC, as FHIR Resources are object types and the CRUDE          events (the FHIR equivalent to permissions in the RBAC scheme) are operations on those objects.          In Attribute-Based Access Control (ABAC), a user requests to perform operations on objects. That user's access request is granted or denied          based on a set of access control policies that are specified in terms of attributes and conditions. FHIR readily enables ABAC, as instances of          a Resource in FHIR (again, Resources are object types) can have attributes associated with them. These attributes include security tags,          environment conditions, and a host of user and object characteristics, which are the same attributes as those used in ABAC. Attributes help          define the access control policies that determine the operations a user may perform on a Resource (in FHIR) or object (in ABAC). For example,          a tag (or attribute) may specify that the identified Resource (object) is not to be further disclosed without explicit consent from the patient.","copyright":"This is an example FHIR value set based on ASTM Standard, E1762-95 (2013) HL7 RoleClass OID 2.16.840.1.113883.5.110,          HL7 Role Code 2.16.840.1.113883.5.111, HL7 ParticipationType OID: 2.16.840.1.113883.5.90, HL7 ParticipationFunction codes at OID: 2.16.840.1.113883.5.88,          and HL7 Security and Privacy Domain Analysis Model roles classes.   These codes are excerpted from Digital Imaging and Communications in Medicine (DICOM) Standard, Part 16: Content Mapping Resource, Copyright © 2011 by the National Electrical Manufacturers Association.","extensible":true,"compose":{"include":[{"system":"http://www.hl7.org/fhir/contractsignertypecodes","concept":[{"code":"AMENDER"},{"code":"COAUTH"},{"code":"CONT"},{"code":"EVTWIT"},{"code":"PRIMAUTH"},{"code":"REVIEWER"},{"code":"SOURCE"},{"code":"TRANS"},{"code":"VALID"},{"code":"VERF"}]},{"system":"http://hl7.org/fhir/v3/RoleClass","concept":[{"code":"AFFL"},{"code":"AGNT"},{"code":"ASSIGNED"},{"code":"CLAIM"},{"code":"COVPTY"},{"code":"DEPEN"},{"code":"ECON"},{"code":"EMP"},{"code":"GUARD"},{"code":"INVSBJ"},{"code":"NAMED"},{"code":"NOK"},{"code":"PAT"},{"code":"PROV"},{"code":"NOT"}]},{"system":"http://hl7.org/fhir/v3/RoleCode","concept":[{"code":"CLASSIFIER"},{"code":"CONSENTER"},{"code":"CONSWIT"},{"code":"COPART"},{"code":"DECLASSIFIER"},{"code":"DELEGATEE"},{"code":"DELEGATOR"},{"code":"DOWNGRDER"},{"code":"DPOWATT"},{"code":"EXCEST"},{"code":"GRANTEE"},{"code":"GRANTOR"},{"code":"GT"},{"code":"GUADLTM"},{"code":"HPOWATT"},{"code":"INTPRTER"},{"code":"POWATT"},{"code":"RESPRSN"},{"code":"SPOWATT"}]},{"system":"http://hl7.org/fhir/v3/RoleCode","filter":[{"property":"concept","op":"is-a","value":"_CitizenRoleType"}]},{"system":"http://hl7.org/fhir/v3/ParticipationFunction","concept":[{"code":"AUCG"},{"code":"AULR"},{"code":"AUTM"},{"code":"AUWA"},{"code":"PROMSK"}]},{"system":"http://hl7.org/fhir/v3/ParticipationType","concept":[{"code":"AUT"},{"code":"CST"},{"code":"INF"},{"code":"IRCP"},{"code":"LA"},{"code":"IRCP"},{"code":"TRC"},{"code":"WIT"}]},{"system":"http://hl7.org/fhir/extra-security-role-type"},{"system":"http://dicom.nema.org/resources/ontology/DCM","concept":[{"code":"110150"},{"code":"110151"},{"code":"110152"},{"code":"110153"},{"code":"110154"},{"code":"110155"}]}]}}