{"resourceType":"ValueSet","id":"v3-RoleCode","meta":{"lastUpdated":"2016-11-11T00:00:00.000+11:00","profile":["http://hl7.org/fhir/StructureDefinition/shareablevalueset"]},"text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n            <p>Release Date: 2016-11-11</p>\n\n            <table class=\"grid\">\n \n              <tr>\n                <td>\n                  <b>Level</b>\n                </td>\n                <td>\n                  <b>Code</b>\n                </td>\n                <td>\n                  <b>Display</b>\n                </td>\n                <td>\n                  <b>Definition</b>\n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_AffiliationRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_AffiliationRoleType\"> </a>\n                </td>\n                <td>\n                        Concepts characterizing the type of association formed by player and scoper when there is a recognized Affiliate role by which the two parties are related.\n                  <br/>\n\n                        \n                           Examples: Business Partner, Business Associate, Colleague\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_AgentRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_AgentRoleType\"> </a>\n                </td>\n                <td>\n                        Parties that may or should contribute or have contributed to an Act.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    AMENDER\n                  <a name=\"AMENDER\"> </a>\n                </td>\n                <td>amender</td>\n                <td>\n                        An entity which corrected, edited, or amended pre-existing information.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CLASSIFIER\n                  <a name=\"CLASSIFIER\"> </a>\n                </td>\n                <td>classifier</td>\n                <td>\n                        An individual authorized to assign an original classification to information, including compilations of unclassified information, based on a determination that the information requires protection against unauthorized disclosure. The individual marks the information with immutable, computable, and human readable security labels in accordance with applicable security labeling policies.  The labeling policies provide instructions on whether and if so how the security labels may be later reclassified [i.e., upgraded, downgraded, used in derivative classification, or declassified] in a manner that preserves the overridden original classification binding and provenance.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CONSENTER\n                  <a name=\"CONSENTER\"> </a>\n                </td>\n                <td>consenter</td>\n                <td>\n                        An entity or an entity's delegatee who is the grantee in an agreement such as a consent for services, advanced directive, or a privacy consent directive in accordance with jurisdictional, organizational, or patient policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CONSWIT\n                  <a name=\"CONSWIT\"> </a>\n                </td>\n                <td>consent witness</td>\n                <td>\n                        An entity which has witnessed and attests to observing another entity being counseled about an agreement such as a consent for services, advanced directive, or a privacy consent directive.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    COPART\n                  <a name=\"COPART\"> </a>\n                </td>\n                <td>co-participant</td>\n                <td>\n                        An entity which participates in the generation of and attest to veracity of content, but is not an author or coauthor. For example a surgeon who is required by institutional, regulatory, or legal rules to sign an operative report, but who was not involved in the authorship of that report.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DECLASSIFIER\n                  <a name=\"DECLASSIFIER\"> </a>\n                </td>\n                <td>declassifier</td>\n                <td>\n                        An individual which is authorized to declassify information based on a determination that the information no longer requires protection against unauthorized disclosure.  The individual marks the information being declassified using computable and human readable security labels indicating that this is copy of previously classified information is unclassified in accordance with applicable security labeling policies.  The labeling policies provide instructions on whether and if so how the security labels may be later reclassified [i.e., upgraded or used in derivative classification] in a manner that preserves the overridden original classification binding and provenance.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DELEGATEE\n                  <a name=\"DELEGATEE\"> </a>\n                </td>\n                <td>delegatee</td>\n                <td>\n                        A party to whom some right or authority is granted by a delegator.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DELEGATOR\n                  <a name=\"DELEGATOR\"> </a>\n                </td>\n                <td>delegator</td>\n                <td>\n                        A party that grants all or some portion its right or authority to another party.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DOWNGRDER\n                  <a name=\"DOWNGRDER\"> </a>\n                </td>\n                <td>downgrader</td>\n                <td>\n                        An individual authorized to lower the classification level of labeled content and provide rationale for doing so as directed by a classification guide.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    DRIVCLASSIFIER\n                  <a name=\"DRIVCLASSIFIER\"> </a>\n                </td>\n                <td>derivative classifier</td>\n                <td>\n                        An individual who is only authorized to classify reproduced, extracted, or summarized classified information, or compile classified and unclassified information by applying classification markings derived from source material or as directed by a classification guide.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GRANTEE\n                  <a name=\"GRANTEE\"> </a>\n                </td>\n                <td>grantee</td>\n                <td>\n                        An entity which accepts certain rights or authority from a grantor.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GRANTOR\n                  <a name=\"GRANTOR\"> </a>\n                </td>\n                <td>grantor</td>\n                <td>\n                        An entity which agrees to confer certain rights or authority to a grantee.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    INTPRTER\n                  <a name=\"INTPRTER\"> </a>\n                </td>\n                <td>interpreter</td>\n                <td>\n                        An entity which converts spoken or written language into the language of key participants in an event such as when a provider is obtaining a patient's consent to treatment or permission to disclose information.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    REVIEWER\n                  <a name=\"REVIEWER\"> </a>\n                </td>\n                <td>reviewer</td>\n                <td>\n                        An entity authorized to filter information according to approved criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    VALIDATOR\n                  <a name=\"VALIDATOR\"> </a>\n                </td>\n                <td>validator</td>\n                <td>\n                        An entity authorized to validate information for inclusion in a record.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_CoverageSponsorRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_CoverageSponsorRoleType\"> </a>\n                </td>\n                <td>\n                        \n                           Description:Codes that indicate a specific type of sponsor.  Used when the sponsor's role is only either as a fully insured sponsor or only as a self-insured sponsor.  NOTE: Where a sponsor may be either, use the SponsorParticipationFunction.code (fully insured or self insured) to indicate the type of responsibility. (CO6-0057)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    FULLINS\n                  <a name=\"FULLINS\"> </a>\n                </td>\n                <td>Fully insured coverage sponsor</td>\n                <td>\n                        \n                           Description:An employer or organization that contracts with an underwriter to assumes the financial risk and administrative responsibility for coverage of health services for covered parties.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SELFINS\n                  <a name=\"SELFINS\"> </a>\n                </td>\n                <td>Self insured coverage sponsor</td>\n                <td>\n                        \n                           Description:An employer or organization that assumes the financial risk and administrative responsibility for coverage of health services for covered parties.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_PayorRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_PayorRoleType\"> </a>\n                </td>\n                <td>\n                        \n                           Description:PayorRoleType for a particular type of policy or program benefit package or plan where more detail about the coverage administration role of the Payor is required.  The functions performed by a Payor qualified by a PayorRoleType may be specified by the PayorParticpationFunction value set.\n                  <br/>\n\n                        \n                           Examples:A Payor that is a TPA may administer a managed care plan without underwriting the risk.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ENROLBKR\n                  <a name=\"ENROLBKR\"> </a>\n                </td>\n                <td>Enrollment Broker</td>\n                <td>\n                        \n                           Description:A payor that is responsible for functions related to the enrollment of covered parties.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    TPA\n                  <a name=\"TPA\"> </a>\n                </td>\n                <td>Third party administrator</td>\n                <td>\n                        \n                           Description:Third party administrator (TPA) is a payor organization that processes health care claims without carrying insurance risk. Third party administrators are prominent players in the managed care industry and have the expertise and capability to administer all or a portion of the claims process. They are normally contracted by a health insurer or self-insuring companies to administer services, including claims administration, premium collection, enrollment and other administrative activities.\n                  <br/>\n\n                        Self-insured employers often contract with third party administrator to handle their insurance functions. Insurance companies oftentimes outsource the claims, utilization review or membership functions to a TPA. Sometimes TPAs only manage provider networks, only claims or only utilization review.\n                  <br/>\n\n                        While some third-party administrators may operate as units of insurance companies, they are often independent. However, hospitals or provider organizations desiring to set up their own health plans will often outsource certain responsibilities to TPAs.  TPAs may perform one or several payor functions, specified by the PayorParticipationFunction value set, such as provider management, enrollment, utilization management, and fee for service claims adjudication management.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    UMO\n                  <a name=\"UMO\"> </a>\n                </td>\n                <td>Utilization management organization</td>\n                <td>\n                        \n                           Description:A payor that is responsible for review and case management of health services covered under a policy or program.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  RESPRSN\n                  <a name=\"RESPRSN\"> </a>\n                </td>\n                <td>responsible party</td>\n                <td>\n                        The role played by a party who has legal responsibility for another party.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    EXCEST\n                  <a name=\"EXCEST\"> </a>\n                </td>\n                <td>executor of estate</td>\n                <td>\n                        The role played by a person acting as the estate executor for a deceased subscriber or policyholder who was the responsible party \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GUADLTM\n                  <a name=\"GUADLTM\"> </a>\n                </td>\n                <td>guardian ad lidem</td>\n                <td>\n                        The role played by a person appointed by the court to look out for the best interests of a minor child during the course of legal proceedings.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GUARD\n                  <a name=\"GUARD\"> </a>\n                </td>\n                <td>guardian</td>\n                <td>\n                        The role played by a person or institution legally empowered with responsibility for the care of a ward.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    POWATT\n                  <a name=\"POWATT\"> </a>\n                </td>\n                <td>power of attorney</td>\n                <td>\n                        A relationship between two people in which one person authorizes another to act for him in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DPOWATT\n                  <a name=\"DPOWATT\"> </a>\n                </td>\n                <td>durable power of attorney</td>\n                <td>\n                        A relationship between two people in which one person authorizes another, usually a family member or relative, to act for him or her in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts that is often limited in the kinds of powers that can be assigned.  Unlike ordinary powers of attorney, durable powers can survive for long periods of time, and again, unlike standard powers of attorney, durable powers can continue after incompetency. \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      HPOWATT\n                  <a name=\"HPOWATT\"> </a>\n                </td>\n                <td>healthcare power of attorney</td>\n                <td>\n                        A relationship between two people in which one person authorizes another to act for him or her in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts that continues (by its terms) to be effective even though the grantor has become mentally incompetent after signing the document.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SPOWATT\n                  <a name=\"SPOWATT\"> </a>\n                </td>\n                <td>special power of attorney</td>\n                <td>\n                        A relationship between two people in which one person authorizes another to act for him or her in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts that is often limited in the kinds of powers that can be assigned.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_AssignedRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_AssignedRoleType\"> </a>\n                </td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_AssignedNonPersonLivingSubjectRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_AssignedNonPersonLivingSubjectRoleType\"> </a>\n                </td>\n                <td>\n                        \n                           Description:A role type that is used to further qualify a non-person subject playing a role where the role class attribute is set to RoleClass AssignedEntity\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ASSIST\n                  <a name=\"ASSIST\"> </a>\n                </td>\n                <td>Assistive non-person living subject</td>\n                <td>\n                        \n                           Description:Dogs trained to assist the ill or physically challenged. \n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    BIOTH\n                  <a name=\"BIOTH\"> </a>\n                </td>\n                <td>Biotherapeutic non-person living subject</td>\n                <td>\n                        \n                           Description:Animals, including fish and insects, and microorganisms which may participate as assigned entities in biotherapies.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      ANTIBIOT\n                  <a name=\"ANTIBIOT\"> </a>\n                </td>\n                <td>Antibiotic</td>\n                <td>\n                        \n                           Description:Non-person living subject used as antibiotic.\n                  <br/>\n\n                        \n                           Examples:Bacteriophage, is a virus that infects bacteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DEBR\n                  <a name=\"DEBR\"> </a>\n                </td>\n                <td>Debridement</td>\n                <td>\n                        \n                           Description:Maggots raised for biodebridement.\n                  <br/>\n\n                        \n                           Discussion: Maggot Debridement Therapy is the medical use of live maggots for cleaning non-healing wounds.\n                  <br/>\n\n                        \n                           Examples:Removal of burnt skin.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CCO\n                  <a name=\"CCO\"> </a>\n                </td>\n                <td>Clinical Companion</td>\n                <td>\n                        \n                           Description:Companion animals, such as dogs, cats, and rabbits, which may be provided to patients to improve general mood, decrease depression and loneliness, and distract from stress-inducing concerns to improve quality of life.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SEE\n                  <a name=\"SEE\"> </a>\n                </td>\n                <td>Seeing</td>\n                <td>\n                        \n                           Description:Dogs trained to assist persons who are seeing impaired or blind.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SNIFF\n                  <a name=\"SNIFF\"> </a>\n                </td>\n                <td>Sniffing</td>\n                <td>\n                        \n                           Description:Dogs trained or having the ability to detect imminent seizures or cancers in humans, probably as a result of volatile chemical (odors) given off by the malignancy of the host.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_CertifiedEntityType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_CertifiedEntityType\"> </a>\n                </td>\n                <td>\n                        Defines types of certifications for all entities\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>_CitizenRoleType\n                  <a name=\"_CitizenRoleType\"> </a>\n                </td>\n                <td>CitizenRoleType</td>\n                <td>\n                        A role type used to qualify a person's legal status within a country or nation.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  CAS\n                  <a name=\"CAS\"> </a>\n                </td>\n                <td>asylum seeker</td>\n                <td>\n                        A person who has fled his or her home country to find a safe place elsewhere.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CASM\n                  <a name=\"CASM\"> </a>\n                </td>\n                <td>single minor asylum seeker</td>\n                <td>\n                        A person who is someone of below legal age who has fled his or her home country, without his or her parents, to find a safe place elsewhere at time of categorization.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  CN\n                  <a name=\"CN\"> </a>\n                </td>\n                <td>national</td>\n                <td>\n                        A person who is legally recognized as a member of a nation or country, with associated rights and obligations.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  CNRP\n                  <a name=\"CNRP\"> </a>\n                </td>\n                <td>non-country member without residence permit</td>\n                <td>\n                        A foreigner who is present in a country (which is foreign to him/her) unlawfully or without the country's authorization (may be called an illegal alien).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CNRPM\n                  <a name=\"CNRPM\"> </a>\n                </td>\n                <td>non-country member minor without residence permit</td>\n                <td>\n                        A person who is below legal age present in a country, without his or her parents, (which is foreign to him/her) unlawfully or without the country's authorization.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  CPCA\n                  <a name=\"CPCA\"> </a>\n                </td>\n                <td>permit card applicant</td>\n                <td>\n                        A non-country member admitted to the territory of a nation or country as a non-resident for an explicit purpose.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  CRP\n                  <a name=\"CRP\"> </a>\n                </td>\n                <td>non-country member with residence permit</td>\n                <td>\n                        A foreigner who is a resident of the country but does not have citizenship.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CRPM\n                  <a name=\"CRPM\"> </a>\n                </td>\n                <td>non-country member minor with residence permit</td>\n                <td>\n                        A person who is a resident below legal age of the country without his or her parents and does not have citizenship.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_ContactRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ContactRoleType\"> </a>\n                </td>\n                <td>\n                        Types of contact for Role code &quot;CON&quot;\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_AdministrativeContactRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_AdministrativeContactRoleType\"> </a>\n                </td>\n                <td>\n                        A contact role used for business and/or administrative purposes.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    BILL\n                  <a name=\"BILL\"> </a>\n                </td>\n                <td>Billing Contact</td>\n                <td>\n                        A contact role used to identify a person within a Provider organization that can be contacted for billing purposes (e.g. about the content of the Invoice).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ORG\n                  <a name=\"ORG\"> </a>\n                </td>\n                <td>organizational contact</td>\n                <td>\n                        A contact for an organization for administrative purposes. Contact role specifies a person acting as a liason for the organization.\n                  <br/>\n\n                        Example: HR Department representative.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PAYOR\n                  <a name=\"PAYOR\"> </a>\n                </td>\n                <td>Payor Contact</td>\n                <td>\n                        A contact role used to identify a person within a Payor organization to whom this communication is addressed.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr style=\"background: #EFEFEF\">\n                <td>2</td>\n                <td>  ECON\n                  <a name=\"ECON\"> </a> \n                  <b>\n                    <i>Deprecated</i>\n                  </b>\n                </td>\n                <td>emergency contact</td>\n                <td>\n                        A contact designated for contact in emergent situations.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr style=\"background: #EFEFEF\">\n                <td>2</td>\n                <td>  NOK\n                  <a name=\"NOK\"> </a> \n                  <b>\n                    <i>Deprecated</i>\n                  </b>\n                </td>\n                <td>next of kin</td>\n                <td>\n                        Played by an individual who is designated as the next of kin for another individual which scopes the role.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_IdentifiedEntityType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_IdentifiedEntityType\"> </a>\n                </td>\n                <td>\n                        \n                           Definition: A code representing the type of identifier that has been assigned to the identified entity (IDENT).\n                  <br/>\n\n                        \n                           Examples: Example values include Social Insurance Number, Product Catalog ID, Product Model Number.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_LocationIdentifiedEntityRoleCode)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_LocationIdentifiedEntityRoleCode\"> </a>\n                </td>\n                <td>\n                        \n                           Description:Describes types of identifiers other than the primary location registry identifier for a service delivery location.  Identifiers may be assigned by a local service delivery organization, a formal body capable of accrediting the location for the capability to provide specific services or the identifier may be assigned at a jurisdictional level.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ACHFID\n                  <a name=\"ACHFID\"> </a>\n                </td>\n                <td>accreditation location identifier</td>\n                <td>\n                        \n                           Description:Identifier assigned to a  location by the organization responsible for accrediting the location.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    JURID\n                  <a name=\"JURID\"> </a>\n                </td>\n                <td>jurisdiction location identifier</td>\n                <td>\n                        \n                           Description:Identifier assigned to a location by a jurisdiction.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    LOCHFID\n                  <a name=\"LOCHFID\"> </a>\n                </td>\n                <td>local location identifier</td>\n                <td>\n                        \n                           Description:Identifier assigned to a  location by a local party (which could be the facility itself or organization overseeing a group of facilities).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_LivingSubjectProductionClass)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_LivingSubjectProductionClass\"> </a>\n                </td>\n                <td>\n                        Code indicating the primary use for which a living subject is bred or grown\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  BF\n                  <a name=\"BF\"> </a>\n                </td>\n                <td>Beef</td>\n                <td>\n                        Cattle used for meat production\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  BL\n                  <a name=\"BL\"> </a>\n                </td>\n                <td>Broiler</td>\n                <td>\n                        Chickens raised for meat\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  BR\n                  <a name=\"BR\"> </a>\n                </td>\n                <td>Breeder</td>\n                <td>\n                        Breeding/genetic stock\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  CO\n                  <a name=\"CO\"> </a>\n                </td>\n                <td>Companion</td>\n                <td>\n                        Companion animals\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  DA\n                  <a name=\"DA\"> </a>\n                </td>\n                <td>Dairy</td>\n                <td>\n                        Milk production\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  DR\n                  <a name=\"DR\"> </a>\n                </td>\n                <td>Draft</td>\n                <td>\n                        Draft animals\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  DU\n                  <a name=\"DU\"> </a>\n                </td>\n                <td>Dual</td>\n                <td>\n                        Dual purpose.  Defined purposes based on species and breed\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  FI\n                  <a name=\"FI\"> </a>\n                </td>\n                <td>Fiber</td>\n                <td>\n                        Animals raised for their fur, hair or skins\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  LY\n                  <a name=\"LY\"> </a>\n                </td>\n                <td>Layer</td>\n                <td>\n                        Chickens raised for egg production\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  MT\n                  <a name=\"MT\"> </a>\n                </td>\n                <td>Meat</td>\n                <td>\n                        Animals raised for meat production\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  MU\n                  <a name=\"MU\"> </a>\n                </td>\n                <td>Multiplier</td>\n                <td>\n                        Poultry flocks used for chick/poult production\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  PL\n                  <a name=\"PL\"> </a>\n                </td>\n                <td>Pleasure</td>\n                <td>\n                        Animals rasied for recreation\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  RC\n                  <a name=\"RC\"> </a>\n                </td>\n                <td>Racing</td>\n                <td>\n                        Animals raised for racing perfomance\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  SH\n                  <a name=\"SH\"> </a>\n                </td>\n                <td>Show</td>\n                <td>\n                        Animals raised for shows\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  VL\n                  <a name=\"VL\"> </a>\n                </td>\n                <td>Veal</td>\n                <td>\n                        Cattle raised for veal meat production.  Implicit is the husbandry method.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  WL\n                  <a name=\"WL\"> </a>\n                </td>\n                <td>Wool</td>\n                <td>\n                        Sheep, goats and other mammals raised for their fiber\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  WO\n                  <a name=\"WO\"> </a>\n                </td>\n                <td>Working</td>\n                <td>\n                        Animals used to perform work\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_MedicationGeneralizationRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_MedicationGeneralizationRoleType\"> </a>\n                </td>\n                <td>\n                        Identifies the specific hierarchical relationship between the playing and scoping medications. \n                  <br/>\n\n                        \n                           Examples: Generic, Generic Formulation, Therapeutic Class, etc.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  DC\n                  <a name=\"DC\"> </a>\n                </td>\n                <td>therapeutic class</td>\n                <td>\n                        \n                           Description:A categorization of medicinal products by their therapeutic properties and/or main therapeutic use.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  GD\n                  <a name=\"GD\"> </a>\n                </td>\n                <td>generic drug</td>\n                <td>\n                        Relates a manufactured drug product to the non-proprietary (generic) representation of its ingredients independent of strength, and form.\n                  <br/>\n\n                        The scoping entity identifies a unique combination of medicine ingredients; sometimes referred to as &quot;ingredient set&quot;.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GDF\n                  <a name=\"GDF\"> </a>\n                </td>\n                <td>generic drug form</td>\n                <td>\n                        Relates a manufactured drug product to the non-proprietary (generic) representation of its ingredients and dose form, independent of strength of the ingredients. The scoping entity identifies a unique combination of medicine ingredients in a specific dose form.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GDS\n                  <a name=\"GDS\"> </a>\n                </td>\n                <td>generic drug strength</td>\n                <td>\n                        Relates a manufactured drug product to the non-proprietary (generic) representation of is ingredients with their strength.  The scoping entity identifies a unique combination of medicine ingredients with their strength.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GDSF\n                  <a name=\"GDSF\"> </a>\n                </td>\n                <td>generic drug strength form</td>\n                <td>\n                        Relates a manufactured drug product to the non-proprietary (generic) representation of its ingredients with their strength in a specific dose form. The scoping entity identifies a unique combination of medicine ingredients with their strength in a single dose form.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  MGDSF\n                  <a name=\"MGDSF\"> </a>\n                </td>\n                <td>manufactured drug strength form</td>\n                <td>\n                        Relates a manufactured drug product to the non-proprietary (generic) representation of its ingredients with their strength in a specific dose form. The scoping entity identifies a unique combination of medicine ingredients with their strength in a single dose form.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_MemberRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_MemberRoleType\"> </a>\n                </td>\n                <td>\n                        Types of membership for Role code &quot;MBR&quot;\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  TRB\n                  <a name=\"TRB\"> </a>\n                </td>\n                <td>Tribal Member</td>\n                <td>\n                        A person who is a member of a tribe.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_PersonalRelationshipRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_PersonalRelationshipRoleType\"> </a>\n                </td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  FAMMEMB\n                  <a name=\"FAMMEMB\"> </a>\n                </td>\n                <td>family member</td>\n                <td>\n                        A relationship between two people characterizing their &quot;familial&quot; relationship\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    CHILD\n                  <a name=\"CHILD\"> </a>\n                </td>\n                <td>child</td>\n                <td>\n                        The player of the role is a child of the scoping entity.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      CHLDADOPT\n                  <a name=\"CHLDADOPT\"> </a>\n                </td>\n                <td>adopted child</td>\n                <td>\n                        The player of the role is a child taken into a family through legal means and raised by the scoping person (parent) as his or her own child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        DAUADOPT\n                  <a name=\"DAUADOPT\"> </a>\n                </td>\n                <td>adopted daughter</td>\n                <td>\n                        The player of the role is a female child taken into a family through legal means and raised by the scoping person (parent) as his or her own child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SONADOPT\n                  <a name=\"SONADOPT\"> </a>\n                </td>\n                <td>adopted son</td>\n                <td>\n                        The player of the role is a male child taken into a family through legal means and raised by the scoping person (parent) as his or her own child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      CHLDFOST\n                  <a name=\"CHLDFOST\"> </a>\n                </td>\n                <td>foster child</td>\n                <td>\n                        The player of the role is a child receiving parental care and nurture from the scoping person (parent) but not related to him or her through legal or blood ties.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        DAUFOST\n                  <a name=\"DAUFOST\"> </a>\n                </td>\n                <td>foster daughter</td>\n                <td>\n                        The player of the role is a female child receiving parental care and nurture from the scoping person (parent) but not related to him or her through legal or blood ties.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SONFOST\n                  <a name=\"SONFOST\"> </a>\n                </td>\n                <td>foster son</td>\n                <td>\n                        The player of the role is a male child receiving parental care and nurture from the scoping person (parent) but not related to him or her through legal or blood ties.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DAUC\n                  <a name=\"DAUC\"> </a>\n                </td>\n                <td>daughter</td>\n                <td>\n                        \n                           Description: The player of the role is a female child (of any type) of scoping entity (parent)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#DAUADOPT\">DAUADOPT</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#DAUFOST\">DAUFOST</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        DAU\n                  <a name=\"DAU\"> </a>\n                </td>\n                <td>natural daughter</td>\n                <td>\n                        The player of the role is a female offspring of the scoping entity (parent).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        STPDAU\n                  <a name=\"STPDAU\"> </a>\n                </td>\n                <td>stepdaughter</td>\n                <td>\n                        The player of the role is a daughter of the scoping person's spouse by a previous union.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      NCHILD\n                  <a name=\"NCHILD\"> </a>\n                </td>\n                <td>natural child</td>\n                <td>\n                        The player of the role is an offspring of the scoping entity as determined by birth.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#DAU\">DAU</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SON\n                  <a name=\"SON\"> </a>\n                </td>\n                <td>natural son</td>\n                <td>\n                        The player of the role is a male offspring of the scoping entity (parent).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SONC\n                  <a name=\"SONC\"> </a>\n                </td>\n                <td>son</td>\n                <td>\n                        \n                           Description: The player of the role is a male child (of any type) of scoping entity (parent)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SONADOPT\">SONADOPT</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SONFOST\">SONFOST</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#SON\">SON</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        STPSON\n                  <a name=\"STPSON\"> </a>\n                </td>\n                <td>stepson</td>\n                <td>\n                        The player of the role is a son of the scoping person's spouse by a previous union.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      STPCHLD\n                  <a name=\"STPCHLD\"> </a>\n                </td>\n                <td>step child</td>\n                <td>\n                        The player of the role is a child of the scoping person's spouse by a previous union.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#STPDAU\">STPDAU</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#STPSON\">STPSON</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    EXT\n                  <a name=\"EXT\"> </a>\n                </td>\n                <td>extended family member</td>\n                <td>\n                        \n                           Description: A family member not having an immediate genetic or legal relationship e.g. Aunt, cousin, great grandparent, grandchild, grandparent, niece, nephew or uncle.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      AUNT\n                  <a name=\"AUNT\"> </a>\n                </td>\n                <td>aunt</td>\n                <td>\n                        The player of the role is a sister of the scoping person's mother or father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MAUNT\n                  <a name=\"MAUNT\"> </a>\n                </td>\n                <td>maternal aunt</td>\n                <td>\n                        \n                           Description:The player of the role is a biological sister of the scoping person's biological mother.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PAUNT\n                  <a name=\"PAUNT\"> </a>\n                </td>\n                <td>paternal aunt</td>\n                <td>\n                        \n                           Description:The player of the role is a biological sister of the scoping person's biological father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      COUSN\n                  <a name=\"COUSN\"> </a>\n                </td>\n                <td>cousin</td>\n                <td>\n                        The player of the role is a relative of the scoping person descended from a common ancestor, such as a \tgrandparent, by two or more steps in a diverging line.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MCOUSN\n                  <a name=\"MCOUSN\"> </a>\n                </td>\n                <td>maternal cousin</td>\n                <td>\n                        \n                           Description:The player of the role is a biological relative of the scoping person descended from a common ancestor on the player's mother's side, such as a grandparent, by two or more steps in a diverging line.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PCOUSN\n                  <a name=\"PCOUSN\"> </a>\n                </td>\n                <td>paternal cousin</td>\n                <td>\n                        \n                           Description:The player of the role is a biological relative of the scoping person descended from a common ancestor on the player's father's side, such as a grandparent, by two or more steps in a diverging line.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      GGRPRN\n                  <a name=\"GGRPRN\"> </a>\n                </td>\n                <td>great grandparent</td>\n                <td>\n                        The player of the role is a parent of the scoping person's grandparent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GGRFTH\n                  <a name=\"GGRFTH\"> </a>\n                </td>\n                <td>great grandfather</td>\n                <td>\n                        The player of the role is the father of the scoping person's grandparent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          MGGRFTH\n                  <a name=\"MGGRFTH\"> </a>\n                </td>\n                <td>maternal great-grandfather</td>\n                <td>\n                        \n                           Description:The player of the role is the biological father of the scoping person's biological mother's parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PGGRFTH\n                  <a name=\"PGGRFTH\"> </a>\n                </td>\n                <td>paternal great-grandfather</td>\n                <td>\n                        \n                           Description:The player of the role is the biological father of the scoping person's biological father's parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GGRMTH\n                  <a name=\"GGRMTH\"> </a>\n                </td>\n                <td>great grandmother</td>\n                <td>\n                        The player of the role is the mother of the scoping person's grandparent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          MGGRMTH\n                  <a name=\"MGGRMTH\"> </a>\n                </td>\n                <td>maternal great-grandmother</td>\n                <td>\n                        \n                           Description:The player of the role is the biological mother of the scoping person's biological mother's parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PGGRMTH\n                  <a name=\"PGGRMTH\"> </a>\n                </td>\n                <td>paternal great-grandmother</td>\n                <td>\n                        \n                           Description:The player of the role is the biological mother of the scoping person's biological father's parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MGGRPRN\n                  <a name=\"MGGRPRN\"> </a>\n                </td>\n                <td>maternal great-grandparent</td>\n                <td>\n                        \n                           Description:The player of the role is a biological parent of the scoping person's biological mother's parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#MGGRFTH\">MGGRFTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#MGGRMTH\">MGGRMTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PGGRPRN\n                  <a name=\"PGGRPRN\"> </a>\n                </td>\n                <td>paternal great-grandparent</td>\n                <td>\n                        \n                           Description:The player of the role is a biological parent of the scoping person's biological father's parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PGGRFTH\">PGGRFTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PGGRMTH\">PGGRMTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      GRNDCHILD\n                  <a name=\"GRNDCHILD\"> </a>\n                </td>\n                <td>grandchild</td>\n                <td>\n                        The player of the role is a child of the scoping person's son or daughter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GRNDDAU\n                  <a name=\"GRNDDAU\"> </a>\n                </td>\n                <td>granddaughter</td>\n                <td>\n                        The player of the role is a daughter of the scoping person's son or daughter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GRNDSON\n                  <a name=\"GRNDSON\"> </a>\n                </td>\n                <td>grandson</td>\n                <td>\n                        The player of the role is a son of the scoping person's son or daughter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      GRPRN\n                  <a name=\"GRPRN\"> </a>\n                </td>\n                <td>grandparent</td>\n                <td>\n                        The player of the role is a parent of the scoping person's mother or father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GRFTH\n                  <a name=\"GRFTH\"> </a>\n                </td>\n                <td>grandfather</td>\n                <td>\n                        The player of the role is the father of the scoping person's mother or father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          MGRFTH\n                  <a name=\"MGRFTH\"> </a>\n                </td>\n                <td>maternal grandfather</td>\n                <td>\n                        \n                           Description:The player of the role is the biological father of the scoping person's biological mother.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PGRFTH\n                  <a name=\"PGRFTH\"> </a>\n                </td>\n                <td>paternal grandfather</td>\n                <td>\n                        \n                           Description:The player of the role is the biological father of the scoping person's biological father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GRMTH\n                  <a name=\"GRMTH\"> </a>\n                </td>\n                <td>grandmother</td>\n                <td>\n                        The player of the role is the mother of the scoping person's mother or father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          MGRMTH\n                  <a name=\"MGRMTH\"> </a>\n                </td>\n                <td>maternal grandmother</td>\n                <td>\n                        \n                           Description:The player of the role is the biological mother of the scoping person's biological mother.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PGRMTH\n                  <a name=\"PGRMTH\"> </a>\n                </td>\n                <td>paternal grandmother</td>\n                <td>\n                        \n                           Description:The player of the role is the biological mother of the scoping person's biological father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MGRPRN\n                  <a name=\"MGRPRN\"> </a>\n                </td>\n                <td>maternal grandparent</td>\n                <td>\n                        \n                           Description:The player of the role is the biological parent of the scoping person's biological mother.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#MGRFTH\">MGRFTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#MGRMTH\">MGRMTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PGRPRN\n                  <a name=\"PGRPRN\"> </a>\n                </td>\n                <td>paternal grandparent</td>\n                <td>\n                        \n                           Description:The player of the role is the biological parent of the scoping person's biological father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PGRFTH\">PGRFTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PGRMTH\">PGRMTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      INLAW\n                  <a name=\"INLAW\"> </a>\n                </td>\n                <td>inlaw</td>\n                <td>\n                        A relationship between an individual and a member of their spousal partner's immediate family.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CHLDINLAW\n                  <a name=\"CHLDINLAW\"> </a>\n                </td>\n                <td>child-in-law</td>\n                <td>\n                        The player of the role is the spouse of scoping person's child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          DAUINLAW\n                  <a name=\"DAUINLAW\"> </a>\n                </td>\n                <td>daughter in-law</td>\n                <td>\n                        The player of the role is the wife of scoping person's son.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SONINLAW\n                  <a name=\"SONINLAW\"> </a>\n                </td>\n                <td>son in-law</td>\n                <td>\n                        The player of the role is the husband of scoping person's daughter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PRNINLAW\n                  <a name=\"PRNINLAW\"> </a>\n                </td>\n                <td>parent in-law</td>\n                <td>\n                        The player of the role is the parent of scoping person's husband or wife.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          FTHINLAW\n                  <a name=\"FTHINLAW\"> </a>\n                </td>\n                <td>father-in-law</td>\n                <td>\n                        The player of the role is the father of the scoping person's husband or wife.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          MTHINLAW\n                  <a name=\"MTHINLAW\"> </a>\n                </td>\n                <td>mother-in-law</td>\n                <td>\n                        The player of the role is the mother of the scoping person's husband or wife.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SIBINLAW\n                  <a name=\"SIBINLAW\"> </a>\n                </td>\n                <td>sibling in-law</td>\n                <td>\n                        The player of the role is: (1) a sibling of the scoping person's spouse, or (2) the spouse of the scoping person's sibling, or (3) the spouse of a sibling of the scoping person's spouse.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          BROINLAW\n                  <a name=\"BROINLAW\"> </a>\n                </td>\n                <td>brother-in-law</td>\n                <td>\n                        The player of the role is: (1) a brother of the scoping person's spouse, or (2) the husband of the scoping person's sister, or (3) the husband of a sister of the scoping person's spouse.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          SISINLAW\n                  <a name=\"SISINLAW\"> </a>\n                </td>\n                <td>sister-in-law</td>\n                <td>\n                        The player of the role is: (1) a sister of the scoping person's spouse, or (2) the wife of the scoping person's brother, or (3) the wife of a brother of the scoping person's spouse.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      NIENEPH\n                  <a name=\"NIENEPH\"> </a>\n                </td>\n                <td>niece/nephew</td>\n                <td>\n                        The player of the role is a child of scoping person's brother or sister or of the brother or sister of the \tscoping person's spouse.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NEPHEW\n                  <a name=\"NEPHEW\"> </a>\n                </td>\n                <td>nephew</td>\n                <td>\n                        The player of the role is a son of the scoping person's brother or sister or of the brother or sister of the \tscoping person's spouse.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NIECE\n                  <a name=\"NIECE\"> </a>\n                </td>\n                <td>niece</td>\n                <td>\n                        The player of the role is a daughter of the scoping person's brother or sister or of the brother or sister of the \tscoping person's spouse.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      UNCLE\n                  <a name=\"UNCLE\"> </a>\n                </td>\n                <td>uncle</td>\n                <td>\n                        The player of the role is a brother of the scoping person's mother or father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MUNCLE\n                  <a name=\"MUNCLE\"> </a>\n                </td>\n                <td>maternal uncle</td>\n                <td>\n                        \n                           Description:The player of the role is a biological brother of the scoping person's biological mother.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PUNCLE\n                  <a name=\"PUNCLE\"> </a>\n                </td>\n                <td>paternal uncle</td>\n                <td>\n                        \n                           Description:The player of the role is a biological brother of the scoping person's biological father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PRN\n                  <a name=\"PRN\"> </a>\n                </td>\n                <td>parent</td>\n                <td>\n                        The player of the role is one who begets, gives birth to, or nurtures and raises the scoping entity (child).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      ADOPTP\n                  <a name=\"ADOPTP\"> </a>\n                </td>\n                <td>adoptive parent</td>\n                <td>\n                        The player of the role (parent) has taken the scoper (child) into their family through legal means and raises them as his or her own child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ADOPTF\n                  <a name=\"ADOPTF\"> </a>\n                </td>\n                <td>adoptive father</td>\n                <td>\n                        The player of the role (father) is a male who has taken the scoper (child) into their family through legal means and raises them as his own child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ADOPTM\n                  <a name=\"ADOPTM\"> </a>\n                </td>\n                <td>adoptive mother</td>\n                <td>\n                        The player of the role (father) is a female who has taken the scoper (child) into their family through legal means and raises them as her own child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      FTH\n                  <a name=\"FTH\"> </a>\n                </td>\n                <td>father</td>\n                <td>\n                        The player of the role is a male who begets or raises or nurtures the scoping entity (child).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#ADOPTF\">ADOPTF</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        FTHFOST\n                  <a name=\"FTHFOST\"> </a>\n                </td>\n                <td>foster father</td>\n                <td>\n                        The player of the role (parent) who is a male state-certified caregiver responsible for the scoper (child) who has been placed in the parent's care. The placement of the child is usually arranged through the government or a social-service agency, and temporary.\n                  <br/>\n\n                        The state, via a jurisdiction recognized child protection agency, stands as in loco parentis to the child, making all legal decisions while the foster parent is responsible for the day-to-day care of the specified child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NFTH\n                  <a name=\"NFTH\"> </a>\n                </td>\n                <td>natural father</td>\n                <td>\n                        The player of the role is a male who begets the scoping entity (child).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          NFTHF\n                  <a name=\"NFTHF\"> </a>\n                </td>\n                <td>natural father of fetus</td>\n                <td>\n                        Indicates the biologic male parent of a fetus.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        STPFTH\n                  <a name=\"STPFTH\"> </a>\n                </td>\n                <td>stepfather</td>\n                <td>\n                        The player of the role is the husband of scoping person's mother and not the scoping person's natural father.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      MTH\n                  <a name=\"MTH\"> </a>\n                </td>\n                <td>mother</td>\n                <td>\n                        The player of the role is a female who conceives, gives birth to, or raises and nurtures the scoping entity (child).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#ADOPTM\">ADOPTM</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GESTM\n                  <a name=\"GESTM\"> </a>\n                </td>\n                <td>gestational mother</td>\n                <td>\n                        The player is a female whose womb carries the fetus of the scoper.  Generally used when the gestational mother and natural mother are not the same.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MTHFOST\n                  <a name=\"MTHFOST\"> </a>\n                </td>\n                <td>foster mother</td>\n                <td>\n                        The player of the role (parent) who is a female state-certified caregiver responsible for the scoper (child) who has been placed in the parent's care. The placement of the child is usually arranged through the government or a social-service agency, and temporary.\n                  <br/>\n\n                        The state, via a jurisdiction recognized child protection agency, stands as in loco parentis to the child, making all legal decisions while the foster parent is responsible for the day-to-day care of the specified child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NMTH\n                  <a name=\"NMTH\"> </a>\n                </td>\n                <td>natural mother</td>\n                <td>\n                        The player of the role is a female who conceives or gives birth to the scoping entity (child).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          NMTHF\n                  <a name=\"NMTHF\"> </a>\n                </td>\n                <td>natural mother of fetus</td>\n                <td>\n                        The player is the biologic female parent of the scoping fetus.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        STPMTH\n                  <a name=\"STPMTH\"> </a>\n                </td>\n                <td>stepmother</td>\n                <td>\n                        The player of the role is the wife of scoping person's father and not the scoping person's natural mother.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      NPRN\n                  <a name=\"NPRN\"> </a>\n                </td>\n                <td>natural parent</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#NFTH\">NFTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#NMTH\">NMTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      PRNFOST\n                  <a name=\"PRNFOST\"> </a>\n                </td>\n                <td>foster parent</td>\n                <td>\n                        The player of the role (parent) who is a state-certified caregiver responsible for the scoper (child) who has been placed in the parent's care. The placement of the child is usually arranged through the government or a social-service agency, and temporary.\n                  <br/>\n\n                        The state, via a jurisdiction recognized child protection agency, stands as in loco parentis to the child, making all legal decisions while the foster parent is responsible for the day-to-day care of the specified child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#FTHFOST\">FTHFOST</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#MTHFOST\">MTHFOST</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      STPPRN\n                  <a name=\"STPPRN\"> </a>\n                </td>\n                <td>step parent</td>\n                <td>\n                        The player of the role is the spouse of the scoping person's parent and not the scoping person's natural parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#STPFTH\">STPFTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#STPMTH\">STPMTH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SIB\n                  <a name=\"SIB\"> </a>\n                </td>\n                <td>sibling</td>\n                <td>\n                        The player of the role shares one or both parents in common with the scoping entity.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      BRO\n                  <a name=\"BRO\"> </a>\n                </td>\n                <td>brother</td>\n                <td>\n                        The player of the role is a male sharing one or both parents in common with the scoping entity.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HBRO\n                  <a name=\"HBRO\"> </a>\n                </td>\n                <td>half-brother</td>\n                <td>\n                        The player of the role is a male related to the scoping entity by sharing only one biological parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NBRO\n                  <a name=\"NBRO\"> </a>\n                </td>\n                <td>natural brother</td>\n                <td>\n                        The player of the role is a male having the same biological parents as the scoping entity.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          TWINBRO\n                  <a name=\"TWINBRO\"> </a>\n                </td>\n                <td>twin brother</td>\n                <td>\n                        The scoper was carried in the same womb as the male player and shares common biological parents.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            FTWINBRO\n                  <a name=\"FTWINBRO\"> </a>\n                </td>\n                <td>fraternal twin brother</td>\n                <td>\n                        The scoper was carried in the same womb as the male player and shares common biological parents but is the product of a distinct egg/sperm pair.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            ITWINBRO\n                  <a name=\"ITWINBRO\"> </a>\n                </td>\n                <td>identical twin brother</td>\n                <td>\n                        The male scoper is an offspring of the same egg-sperm pair as the male player.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        STPBRO\n                  <a name=\"STPBRO\"> </a>\n                </td>\n                <td>stepbrother</td>\n                <td>\n                        The player of the role is a son of the scoping person's stepparent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      HSIB\n                  <a name=\"HSIB\"> </a>\n                </td>\n                <td>half-sibling</td>\n                <td>\n                        The player of the role is related to the scoping entity by sharing only one biological parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#HBRO\">HBRO</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HSIS\n                  <a name=\"HSIS\"> </a>\n                </td>\n                <td>half-sister</td>\n                <td>\n                        The player of the role is a female related to the scoping entity by sharing only one biological parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      NSIB\n                  <a name=\"NSIB\"> </a>\n                </td>\n                <td>natural sibling</td>\n                <td>\n                        The player of the role has both biological parents in common with the scoping entity.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#NBRO\">NBRO</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NSIS\n                  <a name=\"NSIS\"> </a>\n                </td>\n                <td>natural sister</td>\n                <td>\n                        The player of the role is a female having the same biological parents as the scoping entity.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          TWINSIS\n                  <a name=\"TWINSIS\"> </a>\n                </td>\n                <td>twin sister</td>\n                <td>\n                        The scoper was carried in the same womb as the female player and shares common biological parents.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            FTWINSIS\n                  <a name=\"FTWINSIS\"> </a>\n                </td>\n                <td>fraternal twin sister</td>\n                <td>\n                        The scoper was carried in the same womb as the female player and shares common biological parents but is the product of a distinct egg/sperm pair.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            ITWINSIS\n                  <a name=\"ITWINSIS\"> </a>\n                </td>\n                <td>identical twin sister</td>\n                <td>\n                        The female scoper is an offspring of the same egg-sperm pair as the female player.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        TWIN\n                  <a name=\"TWIN\"> </a>\n                </td>\n                <td>twin</td>\n                <td>\n                        The scoper and player were carried in the same womb and shared common biological parents.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#TWINBRO\">TWINBRO</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#TWINSIS\">TWINSIS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          FTWIN\n                  <a name=\"FTWIN\"> </a>\n                </td>\n                <td>fraternal twin</td>\n                <td>\n                        The scoper and player were carried in the same womb and share common biological parents but are the product of distinct egg/sperm pairs.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            \n                  <a href=\"#FTWINBRO\">FTWINBRO</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            \n                  <a href=\"#FTWINSIS\">FTWINSIS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          ITWIN\n                  <a name=\"ITWIN\"> </a>\n                </td>\n                <td>identical twin</td>\n                <td>\n                        The scoper and player are offspring of the same egg-sperm pair.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            \n                  <a href=\"#ITWINBRO\">ITWINBRO</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            \n                  <a href=\"#ITWINSIS\">ITWINSIS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SIS\n                  <a name=\"SIS\"> </a>\n                </td>\n                <td>sister</td>\n                <td>\n                        The player of the role is a female sharing one or both parents in common with the scoping entity.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#HSIS\">HSIS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#NSIS\">NSIS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        STPSIS\n                  <a name=\"STPSIS\"> </a>\n                </td>\n                <td>stepsister</td>\n                <td>\n                        The player of the role is a daughter of the scoping person's stepparent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      STPSIB\n                  <a name=\"STPSIB\"> </a>\n                </td>\n                <td>step sibling</td>\n                <td>\n                        The player of the role is a child of the scoping person's stepparent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#STPBRO\">STPBRO</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#STPSIS\">STPSIS</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SIGOTHR\n                  <a name=\"SIGOTHR\"> </a>\n                </td>\n                <td>significant other</td>\n                <td>\n                        A person who is important to one's well being; especially a spouse or one in a similar relationship.  (The player is the one who is important)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DOMPART\n                  <a name=\"DOMPART\"> </a>\n                </td>\n                <td>domestic partner</td>\n                <td>\n                        The player of the role cohabits with the scoping person but is not the scoping person's spouse.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      FMRSPS\n                  <a name=\"FMRSPS\"> </a>\n                </td>\n                <td>former spouse</td>\n                <td>\n                        Player of the role was previously joined to the scoping person in marriage and this marriage is now dissolved and inactive.\n                  <br/>\n\n                        \n                           Usage Note: This is significant to indicate as some jurisdictions have different legal requirements for former spouse to access the patient's record, from a general friend.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      SPS\n                  <a name=\"SPS\"> </a>\n                </td>\n                <td>spouse</td>\n                <td>\n                        The player of the role is a marriage partner of the scoping person.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HUSB\n                  <a name=\"HUSB\"> </a>\n                </td>\n                <td>husband</td>\n                <td>\n                        The player of the role is a man joined to a woman (scoping person) in marriage.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        WIFE\n                  <a name=\"WIFE\"> </a>\n                </td>\n                <td>wife</td>\n                <td>\n                        The player of the role is a woman joined to a man (scoping person) in marriage.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  FRND\n                  <a name=\"FRND\"> </a>\n                </td>\n                <td>unrelated friend</td>\n                <td>\n                        The player of the role is a person who is known, liked, and trusted by the scoping person.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  NBOR\n                  <a name=\"NBOR\"> </a>\n                </td>\n                <td>neighbor</td>\n                <td>\n                        The player of the role lives near or next to the \tscoping person.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  ONESELF\n                  <a name=\"ONESELF\"> </a>\n                </td>\n                <td>self</td>\n                <td>\n                        The relationship that a person has with his or her self.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  ROOM\n                  <a name=\"ROOM\"> </a>\n                </td>\n                <td>Roommate</td>\n                <td>\n                        One who shares living quarters with the subject.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_PolicyOrProgramCoverageRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_PolicyOrProgramCoverageRoleType\"> </a>\n                </td>\n                <td>\n                        \n                           Description: A role recognized through the eligibility of an identified party for benefits covered under an insurance policy or a program based on meeting eligibility criteria.\n                  <br/>\n\n                        Eligibility as a covered party may be conditioned on the party meeting criteria to qualify for coverage under a policy or program, which may be mandated by law.  These criteria may be: \n                  <br/>\n\n                        \n                           \n                              The sole basis for coverage, e.g., being differently abled may qualify a person for disability coverage\n                  <br/>\n\n                           \n                           \n                              May more fully qualify a covered party role e.g, being differently abled may qualify an adult child as a dependent\n                  <br/>\n\n                           \n                           \n                              May impact the level of coverage for a covered party under a policy or program, e.g., being differently abled may qualify a program eligible for additional benefits.\n                  <br/>\n\n                           \n                        \n                        \n                           Discussion:  The Abstract Value Set &quot;CoverageRoleType&quot;, which was developed for use in the Canadian realm &quot;pre-coordinate&quot; coverage roles with other roles that a covered party must play in order to be eligible for coverage, e.g., &quot;handicapped dependent&quot;.   These role.codes may only be used with COVPTY to avoid overlapping concepts that would result from using them to specify the specializations of COVPTY, e.g., the role.class DEPEN should not be used with the role.code family dependent because that relationship has overlapping concepts due to the role.code precoodination and is conveyed in FICO with the personal relationship role that has a PART role link to the covered party role.  For the same reasons, the role.class DEPEN should not be used with the role.code HANDIC (handicapped dependent); the role.code DIFFABLE (differently abled) should be used instead.\n                  <br/>\n\n                        In summary, the coded concepts in the Abstract Value Set &quot;CoveredPartyRoleType&quot; can be &quot;post-coordinated&quot; with the &quot;RoleClassCoveredParty&quot; Abstract Value Set.  Decoupling these concepts is intended to support an expansive range of covered party concepts and their semantic comparability.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_CoverageRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_CoverageRoleType\"> </a>\n                </td>\n                <td>\n                        Role recognized through the issuance of insurance coverage to an identified covered party who has this relationship with the policy holder such as the policy holder themselves (self), spouse, child, etc\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    FAMDEP\n                  <a name=\"FAMDEP\"> </a>\n                </td>\n                <td>family dependent</td>\n                <td>\n                        The player of the role is dependent of the scoping entity.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    HANDIC\n                  <a name=\"HANDIC\"> </a>\n                </td>\n                <td>handicapped dependent</td>\n                <td>\n                        Covered party is a dependent of the policy holder with a physical or mental disability causing a disadvantage that makes independent achievement unusually difficult.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    INJ\n                  <a name=\"INJ\"> </a>\n                </td>\n                <td>injured plaintiff</td>\n                <td>\n                        Covered party is an injured party with a legal claim for compensation against a policy holder under an insurance policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SELF\n                  <a name=\"SELF\"> </a>\n                </td>\n                <td>self</td>\n                <td>\n                        Covered party is the policy holder.  Also known as the subscriber.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SPON\n                  <a name=\"SPON\"> </a>\n                </td>\n                <td>sponsored dependent</td>\n                <td>\n                        Covered party is an individual that the policy holder has assumed responsibility for, such as foster child or legal ward.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    STUD\n                  <a name=\"STUD\"> </a>\n                </td>\n                <td>student</td>\n                <td>\n                        Covered party to an insurance policy has coverage through full-time or part-time attendance at a recognized educational institution as defined by a particular insurance policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      FSTUD\n                  <a name=\"FSTUD\"> </a>\n                </td>\n                <td>full-time student</td>\n                <td>\n                        Covered party to an insurance policy has coverage through full-time attendance at a recognized educational institution as defined by a particular insurance policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      PSTUD\n                  <a name=\"PSTUD\"> </a>\n                </td>\n                <td>part-time student</td>\n                <td>\n                        Covered party to an insurance policy has coverage through part-time attendance at a recognized educational institution as defined by a particular insurance policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ADOPT\n                  <a name=\"ADOPT\"> </a>\n                </td>\n                <td>adopted child</td>\n                <td>\n                        A child taken into one's family through legal means and raised as one's own child.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GCHILD\n                  <a name=\"GCHILD\"> </a>\n                </td>\n                <td>grandchild</td>\n                <td>\n                        A child of one's son or daughter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    GPARNT\n                  <a name=\"GPARNT\"> </a>\n                </td>\n                <td>grandparent</td>\n                <td>\n                        parent of a parent of the subject.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    NAT\n                  <a name=\"NAT\"> </a>\n                </td>\n                <td>natural child</td>\n                <td>\n                        A child as determined by birth.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    NIENE\n                  <a name=\"NIENE\"> </a>\n                </td>\n                <td>niece/nephew</td>\n                <td>\n                        A child of one's brother or sister or of the brother or sister of one's spouse.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PARNT\n                  <a name=\"PARNT\"> </a>\n                </td>\n                <td>parent</td>\n                <td>\n                        One that begets or brings forth offspring or a person who brings up and cares for for another (Webster's Collegiate Dictionary)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SPSE\n                  <a name=\"SPSE\"> </a>\n                </td>\n                <td>spouse</td>\n                <td>\n                        A marriage partner; a husband or wife.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    STEP\n                  <a name=\"STEP\"> </a>\n                </td>\n                <td>step child</td>\n                <td>\n                        A child receiving parental care and nurture from a person who is related to them through marriage to their parent.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_CoveredPartyRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_CoveredPartyRoleType\"> </a>\n                </td>\n                <td>\n                        A role recognized through the eligibility of an identified living subject for benefits covered under an insurance policy or a program.  Eligibility as a covered party may be conditioned on a relationship with (1) the policy holder such as the policy holder who is covered as an individual under a poliy or as a party sponsored for coverage by the policy holder.\n                  <br/>\n\n                        \n                           Example:An employee as a subscriber; or (2) on being scoped another covered party such as the subscriber, as in the case of a dependent. \n                  <br/>\n\n                        \n                           Discussion:  The Abstract Value Set &quot;CoverageRoleType&quot;, which was developed for use in the Canadian realm &quot;pre-coordinate&quot; coverage roles with other roles that a covered party must play in order to be eligible for coverage, e.g., &quot;handicapped dependent&quot;.  Other codes in the Abstract Value Set CoveredPartyRoleType domain can be &quot;post-coordinated&quot; with the EligiblePartyRoleType codes to denote comparable concepts.  Decoupling the concepts is intended to support a wider range of concepts and semantic comparability of coded concepts.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_ClaimantCoveredPartyRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ClaimantCoveredPartyRoleType\"> </a>\n                </td>\n                <td>\n                        \n                           DescriptionA role recognized through the eligibility of a party play a claimant for benefits covered or provided under an insurance policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      CRIMEVIC\n                  <a name=\"CRIMEVIC\"> </a>\n                </td>\n                <td>crime victim</td>\n                <td>\n                        \n                           Description: A person playing the role of program eligible under a program based on allegations of being the victim of a crime.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is &quot;program eligible&quot; and the person's status as a crime victim meets jurisdictional or program criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      INJWKR\n                  <a name=\"INJWKR\"> </a>\n                </td>\n                <td>injured worker</td>\n                <td>\n                        \n                           Description: A person playing the role of program eligible under a workers compensation program based on the filing of work-related injury claim.\n                  <br/>\n\n                        \n                           Discussion:  This CoveredPartyRoleType.code is used when the CoveredPartyRole class code is either &quot;program eligible&quot;, a &quot;named insured&quot;, and &quot;individual insured&quot;,  or &quot;dependent&quot;, and the person's status as differently abled or &quot;handicapped&quot; meets jurisdictional, policy, or program criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_DependentCoveredPartyRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_DependentCoveredPartyRoleType\"> </a>\n                </td>\n                <td>\n                        \n                           Description: A role recognized through the eligibility of a party to play a dependent for benefits covered or provided under a health insurance policy because of an association with the subscriber that is recognized by the policy underwriter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      COCBEN\n                  <a name=\"COCBEN\"> </a>\n                </td>\n                <td>continuity of coverage beneficiary</td>\n                <td>\n                        \n                           Description: A person playing the role of an individual insured with continuity of coverage under a policy which is being terminated based on loss of original status that was the basis for coverage.  Criteria for qualifying for continuity of coverage may be set by law.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is either &quot;program eligible&quot; or &quot;subscriber&quot; and the person's status as a continuity of coverage beneficiary meets jurisdictional or policy criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DIFFABL\n                  <a name=\"DIFFABL\"> </a>\n                </td>\n                <td>differently abled</td>\n                <td>\n                        \n                           Description: A person playing the role of program eligible under a program based on meeting criteria for health or functional limitation set by law or by the program.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is either &quot;program eligible&quot;, &quot;named insured&quot;, &quot;individual insured&quot;, or &quot;dependent&quot;, and the person's status as differently abled meets jurisdictional, policy, or program criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      WARD\n                  <a name=\"WARD\"> </a>\n                </td>\n                <td>ward</td>\n                <td>\n                        \n                           Description: A person, who is a minor or is deemed incompetent, who plays the role of a program eligible where eligibility for coverage is based on meeting program eligibility criteria for status as a ward of a court or jurisdiction.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is a &quot;claimant&quot;, &quot;program eligible&quot;, a &quot;named insured&quot;, an &quot;individual Insured&quot; or a &quot;dependent&quot;, and the person's status as a ward meets program or policy criteria. In the case of a ward covered under a program providing financial or health benefits, a governmental agency may take temporary custody of a minor or incompetent for his/her protection and care, e.g., if the ward is suffering from neglect or abuse, or has been in trouble with the law.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_IndividualInsuredPartyRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_IndividualInsuredPartyRoleType\"> </a>\n                </td>\n                <td>\n                        A role recognized through the eligibility of a party to play an individual insured for benefits covered or provided under an insurance policy where the party is also the policy holder.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#COCBEN\">COCBEN</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      RETIREE\n                  <a name=\"RETIREE\"> </a>\n                </td>\n                <td>retiree</td>\n                <td>\n                        \n                           Description: A person playing the role of an individual insured under a policy based on meeting criteria for the employment status of retired set by law or the policy.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is either &quot;program eligible&quot; or &quot;subscriber&quot; and the person's status as a retiree meets jurisdictional or policy criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_ProgramEligiblePartyRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ProgramEligiblePartyRoleType\"> </a>\n                </td>\n                <td>\n                        \n                           Description:A role recognized through the eligibility of a party to play a program eligible for benefits covered or provided under a program.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#CRIMEVIC\">CRIMEVIC</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#INJWKR\">INJWKR</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#DIFFABL\">DIFFABL</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#WARD\">WARD</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      INDIG\n                  <a name=\"INDIG\"> </a>\n                </td>\n                <td>member of an indigenous people</td>\n                <td>\n                        \n                           Description: A person playing the role of program eligible under a program based on aboriginal ancestry or as a member of an aboriginal community.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is &quot;program eligible&quot; and the person's status as a member of an indigenous people meets jurisdictional or program criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      MIL\n                  <a name=\"MIL\"> </a>\n                </td>\n                <td>military</td>\n                <td>\n                        \n                           Definition: A person playing the role of program eligible under a program based on military status.\n                  <br/>\n\n                        \n                           Discussion:  This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is either &quot;program eligible&quot; or &quot;subscriber&quot; and the person's status as a member of the military meets jurisdictional or program criteria\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ACTMIL\n                  <a name=\"ACTMIL\"> </a>\n                </td>\n                <td>active duty military</td>\n                <td>\n                        \n                           Description: A person playing the role of program eligible under a program based on active military status.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is either &quot;program eligible&quot; or &quot;subscriber&quot; and the persons status as active duty military meets jurisdictional or program criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        RETMIL\n                  <a name=\"RETMIL\"> </a>\n                </td>\n                <td>retired military</td>\n                <td>\n                        \n                           Description: A person playing the role of program eligible under a program based on retired military status.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is either &quot;program eligible&quot; or &quot;subscriber&quot; and the persons status as retired military meets jurisdictional or program criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        VET\n                  <a name=\"VET\"> </a>\n                </td>\n                <td>veteran</td>\n                <td>\n                        \n                           Description: A person playing the role of program eligible under a program based on status as a military veteran.\n                  <br/>\n\n                        \n                           Discussion: This CoveredPartyRoleType.code is typically used when the CoveredPartyRole class code is either &quot;program eligible&quot; or &quot;subscriber&quot; and the persons status as a veteran meets jurisdictional or program criteria.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_SubscriberCoveredPartyRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_SubscriberCoveredPartyRoleType\"> </a>\n                </td>\n                <td>\n                        \n                           Description: A role recognized through the eligibility of a party to play a subscriber for benefits covered or provided under a health insurance policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#COCBEN\">COCBEN</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#RETIREE\">RETIREE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      \n                  <a href=\"#MIL\">MIL</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_ResearchSubjectRoleBasis)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ResearchSubjectRoleBasis\"> </a>\n                </td>\n                <td>\n                        Specifies the administrative functionality within a formal experimental design for which the ResearchSubject role was established.  Examples: screening - role is used for pre-enrollment evaluation portion of the design; enrolled - role is used for subjects admitted to the active treatment portion of the design.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  ERL\n                  <a name=\"ERL\"> </a>\n                </td>\n                <td>enrollment</td>\n                <td>\n                        \n                           Definition:The specific role being played by a research subject participating in the active treatment or primary data collection portion of a research study.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  SCN\n                  <a name=\"SCN\"> </a>\n                </td>\n                <td>screening</td>\n                <td>\n                        \n                           Definition:The specific role being played by a research subject participating in the pre-enrollment evaluation portion of  a research study.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_ServiceDeliveryLocationRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_ServiceDeliveryLocationRoleType\"> </a>\n                </td>\n                <td>\n                        A role of a place that further classifies the setting (e.g., accident site, road side, work site, community location) in which services are delivered.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_DedicatedServiceDeliveryLocationRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_DedicatedServiceDeliveryLocationRoleType\"> </a>\n                </td>\n                <td>\n                        A role of a place that further classifies a setting that is intended to house the provision of services.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_DedicatedClinicalLocationRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_DedicatedClinicalLocationRoleType\"> </a>\n                </td>\n                <td>\n                        A role of a place that further classifies the clinical setting (e.g., cardiology clinic, primary care clinic, rehabilitation hospital, skilled nursing facility) in which care is delivered during an encounter.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DX\n                  <a name=\"DX\"> </a>\n                </td>\n                <td>Diagnostics or therapeutics unit</td>\n                <td>\n                        A practice setting where diagnostic procedures or therapeutic interventions are performed\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CVDX\n                  <a name=\"CVDX\"> </a>\n                </td>\n                <td>Cardiovascular diagnostics or therapeutics unit</td>\n                <td>\n                        A practice setting where cardiovascular diagnostic procedures or therapeutic interventions are performed (e.g., cardiac catheterization lab, echocardiography suite)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          CATH\n                  <a name=\"CATH\"> </a>\n                </td>\n                <td>Cardiac catheterization lab</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          ECHO\n                  <a name=\"ECHO\"> </a>\n                </td>\n                <td>Echocardiography lab</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GIDX\n                  <a name=\"GIDX\"> </a>\n                </td>\n                <td>Gastroenterology diagnostics or therapeutics lab</td>\n                <td>\n                        A practice setting where GI procedures (such as endoscopies) are performed\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          ENDOS\n                  <a name=\"ENDOS\"> </a>\n                </td>\n                <td>Endoscopy lab</td>\n                <td>\n                        (X12N 261QD0000N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        RADDX\n                  <a name=\"RADDX\"> </a>\n                </td>\n                <td>Radiology diagnostics or therapeutics unit</td>\n                <td>\n                        A practice setting where radiology services (diagnostic or therapeutic) are provided            (X12N 261QR0200N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          RADO\n                  <a name=\"RADO\"> </a>\n                </td>\n                <td>Radiation oncology unit</td>\n                <td>\n                        (X12N 261QX0203N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          RNEU\n                  <a name=\"RNEU\"> </a>\n                </td>\n                <td>Neuroradiology unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      HOSP\n                  <a name=\"HOSP\"> </a>\n                </td>\n                <td>Hospital</td>\n                <td>\n                        An acute care institution that provides medical, surgical, or psychiatric care and treatment for the sick or the injured.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CHR\n                  <a name=\"CHR\"> </a>\n                </td>\n                <td>Chronic Care Facility</td>\n                <td>\n                        (1) A hospital including a physical plant and personnel that provides multidisciplinary diagnosis and treatment for diseases that have one or more of the following characteristics: is permanent; leaves residual disability; is caused by nonreversible pathological alteration; requires special training of the patient for rehabilitation; and/or may be expected to require a long period of supervision or care. In addition, patients require the safety, security, and shelter of these specialized inpatient or partial hospitalization settings. (2) A hospital that provides medical and skilled nursing services to patients with long-term illnesses who are not in an acute phase but who require an intensity of services not available in nursing homes\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GACH\n                  <a name=\"GACH\"> </a>\n                </td>\n                <td>Hospitals; General Acute Care Hospital</td>\n                <td>\n                        (X12N 282N00000N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MHSP\n                  <a name=\"MHSP\"> </a>\n                </td>\n                <td>Military Hospital</td>\n                <td>\n                        A health care facility operated by the Department of Defense or other military operation.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PSYCHF\n                  <a name=\"PSYCHF\"> </a>\n                </td>\n                <td>Psychatric Care Facility</td>\n                <td>\n                        Healthcare facility that cares for patients with psychiatric illness(s).\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        RH\n                  <a name=\"RH\"> </a>\n                </td>\n                <td>Rehabilitation hospital</td>\n                <td>\n                        (X12N 283X00000N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          RHAT\n                  <a name=\"RHAT\"> </a>\n                </td>\n                <td>addiction treatment center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include life training and/or social support to people with addictions.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          RHII\n                  <a name=\"RHII\"> </a>\n                </td>\n                <td>intellectual impairment center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include adaptation, rehabilitation and social integration services for people with intellectual and/or pervasive development disorders such as autism or severe behaviour disorder.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          RHMAD\n                  <a name=\"RHMAD\"> </a>\n                </td>\n                <td>parents with adjustment difficulties center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may social support services for adolescents who are pregnant or have child and are experiencing adaptation issues/difficulties in their current or eventual parenting role.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          RHPI\n                  <a name=\"RHPI\"> </a>\n                </td>\n                <td>physical impairment center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include adaptation, rehabilitation and social integration services for people with physical impairments.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            RHPIH\n                  <a name=\"RHPIH\"> </a>\n                </td>\n                <td>physical impairment - hearing center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services for people with hearing impairments.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            RHPIMS\n                  <a name=\"RHPIMS\"> </a>\n                </td>\n                <td>physical impairment - motor skills center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services for people with motor skill impairments.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            RHPIVS\n                  <a name=\"RHPIVS\"> </a>\n                </td>\n                <td>physical impairment - visual skills center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services for people with visual skill impairments.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          RHYAD\n                  <a name=\"RHYAD\"> </a>\n                </td>\n                <td>youths with adjustment difficulties center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include life training and/or social support services for the adaption, rehabilitation and social integration of youths with adjustment difficulties.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      HU\n                  <a name=\"HU\"> </a>\n                </td>\n                <td>Hospital unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        BMTU\n                  <a name=\"BMTU\"> </a>\n                </td>\n                <td>Bone marrow transplant unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CCU\n                  <a name=\"CCU\"> </a>\n                </td>\n                <td>Coronary care unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CHEST\n                  <a name=\"CHEST\"> </a>\n                </td>\n                <td>Chest unit</td>\n                <td>\n                        A specialty unit in hospital that focuses on chronic respirator patients and pulmonary failure\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        EPIL\n                  <a name=\"EPIL\"> </a>\n                </td>\n                <td>Epilepsy unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ER\n                  <a name=\"ER\"> </a>\n                </td>\n                <td>Emergency room</td>\n                <td>\n                        The section of a health care facility for providing rapid treatment to victims of sudden illness or trauma.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          ETU\n                  <a name=\"ETU\"> </a>\n                </td>\n                <td>Emergency trauma unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HD\n                  <a name=\"HD\"> </a>\n                </td>\n                <td>Hemodialysis unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HLAB\n                  <a name=\"HLAB\"> </a>\n                </td>\n                <td>hospital laboratory</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include tests done based on clinical specimens to get health information about a patient as pertaining to the diagnosis, treatment and prevention of disease.  Hospital laboratories may be further divided into specialized units such as Anatomic Pathology, Microbiology, and Biochemistry.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          INLAB\n                  <a name=\"INLAB\"> </a>\n                </td>\n                <td>inpatient laboratory</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include tests are done on clinical specimens to get health information about a patient pertaining to the diagnosis, treatment, and prevention of disease for a hospital visit longer than one day.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          OUTLAB\n                  <a name=\"OUTLAB\"> </a>\n                </td>\n                <td>outpatient laboratory</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include tests are done on clinical specimens to get health information about a patient pertaining to the diagnosis, treatment, and prevention of disease for same day visits.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HRAD\n                  <a name=\"HRAD\"> </a>\n                </td>\n                <td>radiology unit</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include the branch of medicine that uses ionizing and non-ionizing radiation to diagnose and treat diseases.  The radiology unit may be further divided into subspecialties such as Imaging, Cardiovascular, Thoracic, and Ultrasound.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HUSCS\n                  <a name=\"HUSCS\"> </a>\n                </td>\n                <td>specimen collection site</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include collecting specimens and/or samples from patients for laboratory testing purposes, but does not perform any tests or analysis functions.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ICU\n                  <a name=\"ICU\"> </a>\n                </td>\n                <td>Intensive care unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDICU\n                  <a name=\"PEDICU\"> </a>\n                </td>\n                <td>Pediatric intensive care unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>7</td>\n                <td>            PEDNICU\n                  <a name=\"PEDNICU\"> </a>\n                </td>\n                <td>Pediatric neonatal intensive care unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        INPHARM\n                  <a name=\"INPHARM\"> </a>\n                </td>\n                <td>inpatient pharmacy</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include providing judicious, safe, efficacious, appropriate and cost effective use of medicines for treatment of patients for visits longer than one day. The distinction between inpatient pharmacies and retail (or outpatient) pharmacies is that they are part of a patient's continuity of care while staying in the hospital.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MBL\n                  <a name=\"MBL\"> </a>\n                </td>\n                <td>medical laboratory</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which include biochemistry, hematology, microbiology, immunochemistry, and toxicology.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NCCS\n                  <a name=\"NCCS\"> </a>\n                </td>\n                <td>Neurology critical care and stroke unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NS\n                  <a name=\"NS\"> </a>\n                </td>\n                <td>Neurosurgery unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        OUTPHARM\n                  <a name=\"OUTPHARM\"> </a>\n                </td>\n                <td>outpatient pharmacy</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include providing judicious, safe, efficacious, appropriate and cost effective use of medicines for treatment of patients for outpatient visits and may also be used for discharge prescriptions.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PEDU\n                  <a name=\"PEDU\"> </a>\n                </td>\n                <td>Pediatric unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDICU\">PEDICU</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PHU\n                  <a name=\"PHU\"> </a>\n                </td>\n                <td>Psychiatric hospital unit</td>\n                <td>\n                        (X12N 273R00000N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        RHU\n                  <a name=\"RHU\"> </a>\n                </td>\n                <td>Rehabilitation hospital unit</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SLEEP\n                  <a name=\"SLEEP\"> </a>\n                </td>\n                <td>Sleep disorders unit</td>\n                <td>\n                        (X12N 261QA1200N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      NCCF\n                  <a name=\"NCCF\"> </a>\n                </td>\n                <td>Nursing or custodial care facility</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SNF\n                  <a name=\"SNF\"> </a>\n                </td>\n                <td>Skilled nursing facility</td>\n                <td>\n                        (X12N 314000000N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      OF\n                  <a name=\"OF\"> </a>\n                </td>\n                <td>Outpatient facility</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ALL\n                  <a name=\"ALL\"> </a>\n                </td>\n                <td>Allergy clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        AMPUT\n                  <a name=\"AMPUT\"> </a>\n                </td>\n                <td>Amputee clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        BMTC\n                  <a name=\"BMTC\"> </a>\n                </td>\n                <td>Bone marrow transplant clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        BREAST\n                  <a name=\"BREAST\"> </a>\n                </td>\n                <td>Breast clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CANC\n                  <a name=\"CANC\"> </a>\n                </td>\n                <td>Child and adolescent neurology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CAPC\n                  <a name=\"CAPC\"> </a>\n                </td>\n                <td>Child and adolescent psychiatry clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CARD\n                  <a name=\"CARD\"> </a>\n                </td>\n                <td>Ambulatory Health Care Facilities; Clinic/Center; Rehabilitation: Cardiac Facilities</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDCARD\n                  <a name=\"PEDCARD\"> </a>\n                </td>\n                <td>Pediatric cardiology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        COAG\n                  <a name=\"COAG\"> </a>\n                </td>\n                <td>Coagulation clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        CRS\n                  <a name=\"CRS\"> </a>\n                </td>\n                <td>Colon and rectal surgery clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        DERM\n                  <a name=\"DERM\"> </a>\n                </td>\n                <td>Dermatology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ENDO\n                  <a name=\"ENDO\"> </a>\n                </td>\n                <td>Endocrinology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDE\n                  <a name=\"PEDE\"> </a>\n                </td>\n                <td>Pediatric endocrinology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ENT\n                  <a name=\"ENT\"> </a>\n                </td>\n                <td>Otorhinolaryngology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        FMC\n                  <a name=\"FMC\"> </a>\n                </td>\n                <td>Family medicine clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GI\n                  <a name=\"GI\"> </a>\n                </td>\n                <td>Gastroenterology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDGI\n                  <a name=\"PEDGI\"> </a>\n                </td>\n                <td>Pediatric gastroenterology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GIM\n                  <a name=\"GIM\"> </a>\n                </td>\n                <td>General internal medicine clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        GYN\n                  <a name=\"GYN\"> </a>\n                </td>\n                <td>Gynecology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HEM\n                  <a name=\"HEM\"> </a>\n                </td>\n                <td>Hematology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDHEM\n                  <a name=\"PEDHEM\"> </a>\n                </td>\n                <td>Pediatric hematology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        HTN\n                  <a name=\"HTN\"> </a>\n                </td>\n                <td>Hypertension clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        IEC\n                  <a name=\"IEC\"> </a>\n                </td>\n                <td>Impairment evaluation center</td>\n                <td>\n                        Focuses on assessing disability\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        INFD\n                  <a name=\"INFD\"> </a>\n                </td>\n                <td>Infectious disease clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDID\n                  <a name=\"PEDID\"> </a>\n                </td>\n                <td>Pediatric infectious disease clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        INV\n                  <a name=\"INV\"> </a>\n                </td>\n                <td>Infertility clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        LYMPH\n                  <a name=\"LYMPH\"> </a>\n                </td>\n                <td>Lympedema clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        MGEN\n                  <a name=\"MGEN\"> </a>\n                </td>\n                <td>Medical genetics clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NEPH\n                  <a name=\"NEPH\"> </a>\n                </td>\n                <td>Nephrology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDNEPH\n                  <a name=\"PEDNEPH\"> </a>\n                </td>\n                <td>Pediatric nephrology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        NEUR\n                  <a name=\"NEUR\"> </a>\n                </td>\n                <td>Neurology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        OB\n                  <a name=\"OB\"> </a>\n                </td>\n                <td>Obstetrics clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        OMS\n                  <a name=\"OMS\"> </a>\n                </td>\n                <td>Oral and maxillofacial surgery clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ONCL\n                  <a name=\"ONCL\"> </a>\n                </td>\n                <td>Medical oncology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDHO\n                  <a name=\"PEDHO\"> </a>\n                </td>\n                <td>Pediatric oncology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        OPH\n                  <a name=\"OPH\"> </a>\n                </td>\n                <td>Opthalmology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        OPTC\n                  <a name=\"OPTC\"> </a>\n                </td>\n                <td>optometry clinic</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include examination, diagnosis, treatment, management, and prevention of diseases and disorders of the eye as well as prescribing and fitting appropriate corrective lenses (glasses or contact lenses) as needed.  Optometry clinics may also provide tests for visual field screening, measuring intra-ocular pressure and ophthalmoscopy, as and when required.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        ORTHO\n                  <a name=\"ORTHO\"> </a>\n                </td>\n                <td>Orthopedics clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          HAND\n                  <a name=\"HAND\"> </a>\n                </td>\n                <td>Hand clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PAINCL\n                  <a name=\"PAINCL\"> </a>\n                </td>\n                <td>Pain clinic</td>\n                <td>\n                        (X12N 261QP3300N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PC\n                  <a name=\"PC\"> </a>\n                </td>\n                <td>Primary care clinic</td>\n                <td>\n                        (X12N 261QP2300N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PEDC\n                  <a name=\"PEDC\"> </a>\n                </td>\n                <td>Pediatrics clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDCARD\">PEDCARD</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDE\">PEDE</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDGI\">PEDGI</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDHEM\">PEDHEM</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDID\">PEDID</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDNEPH\">PEDNEPH</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDHO\">PEDHO</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PEDRHEUM\n                  <a name=\"PEDRHEUM\"> </a>\n                </td>\n                <td>Pediatric rheumatology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        POD\n                  <a name=\"POD\"> </a>\n                </td>\n                <td>Podiatry clinic</td>\n                <td>\n                        (X12N 261QP1100N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PREV\n                  <a name=\"PREV\"> </a>\n                </td>\n                <td>Preventive medicine clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PROCTO\n                  <a name=\"PROCTO\"> </a>\n                </td>\n                <td>Proctology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PROFF\n                  <a name=\"PROFF\"> </a>\n                </td>\n                <td>Provider's Office</td>\n                <td>\n                        Location where healthcare service was delivered, identified as the healthcare provider's practice office.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PROS\n                  <a name=\"PROS\"> </a>\n                </td>\n                <td>Prosthodontics clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PSI\n                  <a name=\"PSI\"> </a>\n                </td>\n                <td>Psychology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PSY\n                  <a name=\"PSY\"> </a>\n                </td>\n                <td>Psychiatry clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        RHEUM\n                  <a name=\"RHEUM\"> </a>\n                </td>\n                <td>Rheumatology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          \n                  <a href=\"#PEDRHEUM\">PEDRHEUM</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SPMED\n                  <a name=\"SPMED\"> </a>\n                </td>\n                <td>Sports medicine clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SU\n                  <a name=\"SU\"> </a>\n                </td>\n                <td>Surgery clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          PLS\n                  <a name=\"PLS\"> </a>\n                </td>\n                <td>Plastic surgery clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>6</td>\n                <td>          URO\n                  <a name=\"URO\"> </a>\n                </td>\n                <td>Urology clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        TR\n                  <a name=\"TR\"> </a>\n                </td>\n                <td>Transplant clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        TRAVEL\n                  <a name=\"TRAVEL\"> </a>\n                </td>\n                <td>Travel and geographic medicine clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        WND\n                  <a name=\"WND\"> </a>\n                </td>\n                <td>Wound clinic</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      RTF\n                  <a name=\"RTF\"> </a>\n                </td>\n                <td>Residential treatment facility</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        PRC\n                  <a name=\"PRC\"> </a>\n                </td>\n                <td>Pain rehabilitation center</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        SURF\n                  <a name=\"SURF\"> </a>\n                </td>\n                <td>Substance use rehabilitation facility</td>\n                <td>\n                        (X12N 324500000N)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    \n                  <span style=\"color: grey\">\n                    <i>(_DedicatedNonClinicalLocationRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_DedicatedNonClinicalLocationRoleType\"> </a>\n                </td>\n                <td>\n                        A role of a place that further classifies a setting that is intended to house the provision of non-clinical services.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      DADDR\n                  <a name=\"DADDR\"> </a>\n                </td>\n                <td>Delivery Address</td>\n                <td>\n                        Location address where medical supplies were transported to for use.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      MOBL\n                  <a name=\"MOBL\"> </a>\n                </td>\n                <td>Mobile Unit</td>\n                <td>\n                        Location (mobile) where healthcare service was delivered.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        AMB\n                  <a name=\"AMB\"> </a>\n                </td>\n                <td>Ambulance</td>\n                <td>\n                        Location (mobile) where healthcare service was delivered, identified specifically as an ambulance.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      PHARM\n                  <a name=\"PHARM\"> </a>\n                </td>\n                <td>Pharmacy</td>\n                <td>\n                        Location where healthcare service was delivered, identified as a pharmacy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#INPHARM\">INPHARM</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>5</td>\n                <td>        \n                  <a href=\"#OUTPHARM\">OUTPHARM</a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  \n                  <span style=\"color: grey\">\n                    <i>(_IncidentalServiceDeliveryLocationRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_IncidentalServiceDeliveryLocationRoleType\"> </a>\n                </td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    ACC\n                  <a name=\"ACC\"> </a>\n                </td>\n                <td>accident site</td>\n                <td>\n                        Location of an accident where healthcare service was delivered, such as a roadside.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    COMM\n                  <a name=\"COMM\"> </a>\n                </td>\n                <td>Community Location</td>\n                <td>\n                        Community location where healthcare is delivered.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>4</td>\n                <td>      CSC\n                  <a name=\"CSC\"> </a>\n                </td>\n                <td>community service center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include providing front-line services to the population of a defined geographic area such as: healthcare services and social services, preventive or curative, rehabilitation or reintegration.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    PTRES\n                  <a name=\"PTRES\"> </a>\n                </td>\n                <td>Patient's Residence</td>\n                <td>\n                        location where healthcare was delivered which is the residence of the Patient.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    SCHOOL\n                  <a name=\"SCHOOL\"> </a>\n                </td>\n                <td>school</td>\n                <td>\n                        Location where healthcare service was delivered, identified as a school or educational facility.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    UPC\n                  <a name=\"UPC\"> </a>\n                </td>\n                <td>underage protection center</td>\n                <td>\n                        \n                           Description: A location that plays the role of delivering services which may include: social emergency services required for a young person as required under any jurisdictional youth laws, child placement, and family mediation in the defined geographical area the SDL is responsible for. It may provide expertise in a judiciary setting on child custody, adoption and biological history research.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    WORK\n                  <a name=\"WORK\"> </a>\n                </td>\n                <td>work site</td>\n                <td>\n                        Location where healthcare service was delivered, identified as a work place.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>\n                  <span style=\"color: grey\">\n                    <i>(_SpecimenRoleType)</i>\n                  </span> \n                  <b>\n                    <i>Abstract</i>\n                  </b>\n                </td>\n                <td>\n                  <a name=\"_SpecimenRoleType\"> </a>\n                </td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  C\n                  <a name=\"C\"> </a>\n                </td>\n                <td>Calibrator</td>\n                <td>\n                        A specimen used for initial calibration settings of an instrument\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  G\n                  <a name=\"G\"> </a>\n                </td>\n                <td>Group</td>\n                <td>\n                        A set of patient samples in which the individuals of the group may or may not be identified.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  L\n                  <a name=\"L\"> </a>\n                </td>\n                <td>Pool</td>\n                <td>\n                        Aliquots of individual specimens combined to form a single specimen representing all of the included individuals.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  P\n                  <a name=\"P\"> </a>\n                </td>\n                <td>Patient</td>\n                <td>\n                        A specimen that has been collected from a patient.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  Q\n                  <a name=\"Q\"> </a>\n                </td>\n                <td>Quality Control</td>\n                <td>\n                        A specimen specifically used to verify the sensitivity, specificity, accuracy or other perfomance parameter of a diagnostic test.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    B\n                  <a name=\"B\"> </a>\n                </td>\n                <td>Blind</td>\n                <td>\n                        Quality Control specimen submitted to the lab whose identity and composition is not known to the lab.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    E\n                  <a name=\"E\"> </a>\n                </td>\n                <td>Electronic QC</td>\n                <td>\n                        An electronically simulated QC specimen\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    F\n                  <a name=\"F\"> </a>\n                </td>\n                <td>Filler Proficiency</td>\n                <td>\n                        Specimen used for testing proficiency of an organization performing testing (how does this differ from O?)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    O\n                  <a name=\"O\"> </a>\n                </td>\n                <td>Operator Proficiency</td>\n                <td>\n                        A specimen used for evaluation of operator proficiency (operator in what context?)\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>3</td>\n                <td>    V\n                  <a name=\"V\"> </a>\n                </td>\n                <td>Verifying</td>\n                <td>\n                        A specimen used for periodic calibration checks of instruments\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>2</td>\n                <td>  R\n                  <a name=\"R\"> </a>\n                </td>\n                <td>Replicate</td>\n                <td>\n                        A portion of an original patent sample that is tested at the same time as the original sample\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>CLAIM\n                  <a name=\"CLAIM\"> </a>\n                </td>\n                <td>claimant</td>\n                <td>\n                        A party that makes a claim for coverage under a policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>communityLaboratory\n                  <a name=\"communityLaboratory\"> </a>\n                </td>\n                <td>Community Laboratory</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>GT\n                  <a name=\"GT\"> </a>\n                </td>\n                <td>Guarantor</td>\n                <td>\n                        An individual or organization that makes or gives a promise, assurance, pledge to pay or has paid the healthcare service provider.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>homeHealth\n                  <a name=\"homeHealth\"> </a>\n                </td>\n                <td>Home Health</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>laboratory\n                  <a name=\"laboratory\"> </a>\n                </td>\n                <td>Laboratory</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>pathologist\n                  <a name=\"pathologist\"> </a>\n                </td>\n                <td>Pathologist</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>PH\n                  <a name=\"PH\"> </a>\n                </td>\n                <td>Policy Holder</td>\n                <td>\n                        Policy holder for the insurance policy.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>phlebotomist\n                  <a name=\"phlebotomist\"> </a>\n                </td>\n                <td>Phlebotomist</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>PROG\n                  <a name=\"PROG\"> </a>\n                </td>\n                <td>program eligible</td>\n                <td>\n                        A party that meets the eligibility criteria for coverage under a program.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>PT\n                  <a name=\"PT\"> </a>\n                </td>\n                <td>Patient</td>\n                <td>\n                        The recipient for the service(s) and/or product(s) when they are not the covered party.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>subject\n                  <a name=\"subject\"> </a>\n                </td>\n                <td>Self</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>thirdParty\n                  <a name=\"thirdParty\"> </a>\n                </td>\n                <td>Third Party</td>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>DEP\n                  <a name=\"DEP\"> </a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>DEPEN\n                  <a name=\"DEPEN\"> </a>\n                </td>\n                <td>dependent</td>\n                <td>\n                        A party covered under a policy based on association with a subscriber.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>FM\n                  <a name=\"FM\"> </a>\n                </td>\n                <td>Family Member</td>\n                <td>\n                        A member of the covered party's family. This could be the spouse, a parent, a grand parent, a sibling, etc.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>INDIV\n                  <a name=\"INDIV\"> </a>\n                </td>\n                <td>individual</td>\n                <td>\n                        A party covered under a policy as the policyholder.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>NAMED\n                  <a name=\"NAMED\"> </a>\n                </td>\n                <td>named insured</td>\n                <td>\n                        A party to an insurance policy to whom the insurer agrees to indemnify for losses, provides benefits for, or renders services.\n                  <br/>\n\n                     \n                </td>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>PSYCHCF\n                  <a name=\"PSYCHCF\"> </a>\n                </td>\n                <td/>\n                <td/>\n              </tr>\n \n              <tr>\n                <td>1</td>\n                <td>SUBSCR\n                  <a name=\"SUBSCR\"> </a>\n                </td>\n                <td>subscriber</td>\n                <td>\n                        A party covered under a policy based on association with a sponsor who is the policy holder, and whose association may provide for the eligibility of dependents for coverage\n                  <br/>\n\n                     \n                </td>\n              </tr>\n\n            </table>\n\n          </div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-ballot-status","valueString":"External"},{"url":"http://hl7.org/fhir/StructureDefinition/structuredefinition-fmm","valueInteger":0}],"url":"http://hl7.org/fhir/ValueSet/v3-RoleCode","version":"2016-11-11","name":"v3 Code System RoleCode","status":"active","experimental":false,"date":"2016-11-11","publisher":"HL7, Inc","contact":[{"telecom":[{"system":"url","value":"http://hl7.org"}]}],"description":" A set of codes further specifying the kind of Role; specific classification codes for further qualifying RoleClass codes.","immutable":true,"compose":{"include":[{"system":"http://hl7.org/fhir/v3/RoleCode"}]}}