{"resourceType":"DataElement","id":"DocumentReference.securityLabel","meta":{"lastUpdated":"2015-10-24T07:41:03.495+11:00"},"url":"http://hl7.org/fhir/DataElement/DocumentReference.securityLabel","status":"draft","experimental":true,"stringency":"fully-specified","element":[{"path":"DocumentReference.securityLabel","short":"Document security-tags","definition":"A set of Security-Tag codes specifying the level of privacy/security of the Document. Note that DocumentReference.meta.security contains the security labels of the \"reference\" to the document, while DocumentReference.securityLabel contains a snapshot of the security labels on the document the reference refers to.","comments":"The confidentiality codes can carry multiple vocabulary items. HL7 has developed an understanding of security and privacy tags that might be desirable in a Document Sharing environment, called HL7 Healthcare Privacy and Security Classification System (HCS). The following specification is recommended but not mandated, as the vocabulary bindings are an administrative domain responsibility. The use of this method is up to the policy domain such as the XDS Affinity Domain or other Trust Domain where all parties including sender and recipients are trusted to appropriately tag and enforce.   In the HL7 Healthcare Privacy and Security Classification (HCS) there are code systems specific to Confidentiality, Sensitivity, Integrity, and Handling Caveats. Some values would come from a local vocabulary as they are related to workflow roles and special projects.","requirements":"Use of the Health Care Privacy/Security Classification (HCS) system of security-tag use is recommended.","min":0,"max":"*","type":[{"code":"CodeableConcept"}],"isSummary":true,"binding":{"strength":"extensible","description":"Security Labels from the Healthcare Privacy and Security Classification System.","valueSetReference":{"reference":"http://hl7.org/fhir/ValueSet/security-labels"}},"mapping":[{"identity":"xds","map":"DocumentEntry.confidentialityCode"},{"identity":"v2","map":"TXA-18"},{"identity":"rim","map":".confidentialityCode"}]}]}