{"resourceType":"DataElement","id":"MedicationStatement","meta":{"lastUpdated":"2015-10-24T07:41:03.495+11:00"},"url":"http://hl7.org/fhir/DataElement/MedicationStatement","status":"draft","experimental":true,"stringency":"fully-specified","element":[{"path":"MedicationStatement","short":"Record of medication being taken by a patient","definition":"A record of a medication that is being consumed by a patient.   A MedicationStatement may indicate that the patient may be taking the medication now, or has taken the medication in the past or will be taking the medication in the future.  The source of this information can be the patient, significant other (such as a family member or spouse), or a clinician.  A common scenario where this information is captured is during the history taking process during a patient visit or stay.   The medication information may come from e.g. the patient's memory, from a prescription bottle,  or from a list of medications the patient, clinician or other party maintains   The primary difference between a medication statement and a medication administration is that the medication administration has complete administration information and is based on actual administration information from the person who administered the medication.  A medication statement is often, if not always, less specific.  There is no required date/time when the medication was administered, in fact we only know that a source has reported the patient is taking this medication, where details such as time, quantity, or rate or even medication product may be incomplete or missing or less precise.  As stated earlier, the medication statement information may come from the patient's memory, from a prescription bottle or from a list of medications the patient, clinician or other party maintains.  Medication administration is more formal and is not missing detailed information.","min":0,"max":"*","type":[{"code":"DomainResource"}],"constraint":[{"key":"mst-2","severity":"error","human":"Reason for use is only permitted if wasNotTaken is false","xpath":"not(exists(*[starts-with(local-name(.), 'reasonForUse')]) and f:wasNotTaken/@value=true())"},{"key":"mst-1","severity":"error","human":"Reason not taken is only permitted if wasNotTaken is true","xpath":"not(exists(f:reasonNotTaken) and f:wasNotTaken/@value=false())"}],"isSummary":true,"mapping":[{"identity":"rim","map":"SubstanceAdministration"},{"identity":"w5","map":"clinical.medication"}]}]}