{"resourceType":"OperationDefinition","id":"Questionnaire-populate","meta":{"lastUpdated":"2015-10-24T07:41:03.495+11:00"},"text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n            <h2>Populate Questionnaire</h2>\n            <p>OPERATION: Populate Questionnaire</p>\n            <div>\n              <p>Generates a \n                <a href=\"questionnaireresponse.html\">QuestionnaireResponse</a> instance  based on a specified \n                <a href=\"questionnaire.html\">Questionnaire</a>, filling in answers to questions where possible based on information provided as part of the operation or already known by the server about the subject of the \n                <a href=\"questionnaire.html\">Questionnaire</a>.  If the operation is not called at the instance level, one and only one of the identifier, questionnaire or questionnaireRef 'in' parameters must be provided. If called at the instance level, these parameters will be ignored. The response will contain a \n                <a href=\"questionnaireresponse.html\">QuestionnaireResponse</a> instance based on the specified \n                <a href=\"questionnaire.html\">Questionnaire</a> and/or an \n                <a href=\"operationoutcome.html\">OperationOutcome</a> resource with errors or warnings.  The \n                <a href=\"questionnaireresponse.html\">QuestionnaireResponse</a> instance will be populated with an unanswered set of questions following the group and question structure of the specified \n                <a href=\"questionnaire.html\">Questionnaire</a>.  If  \n                <em>content</em> parameters were specified or the \n                <em>local</em> parameter was set to true, some of the questions may have answers filled in as well.  In the case of repeating questions or groups, typically only one repetition will be provided unless answer values exist that would support populating multiple repetitions.  Population of the \n                <a href=\"questionnaireresponse.html\">QuestionnaireResponse</a> with appropriate data is dependent on the questions and/or groups in the \n                <a href=\"questionnaire.html\">Questionnaire</a> having metadata that allows the server to recognize the questions.  This might be through \n                <em>Questionnaire.group.question.code</em>, through extensions such as the \n                <a href=\"extension-questionnaire-dereference.html\">http://hl7.org/fhir/StructureDefinition/questionnaire-deReference</a> extension or through use of the \n                <a href=\"conceptmap.html\">ConceptMap</a> resource.  Regardless of the mechanism used to link the questions in a questionnaire to a &quot;known&quot; mappable concept, solutions using this operation should ensure that the details of the question and associated linkage element are sufficiently similar as to safely allow auto-population; i.e. the question text and context must be sufficiently the same, the value set for the question must fall within the value set for the mapped element, the data types must be the same or convertible, etc.\n              </p>\n\n            </div>\n            <p>URL: [base]/Questionnaire/$populate</p>\n            <p>URL: [base]/Questionnaire/[id]/$populate</p>\n            <p>Parameters</p>\n            <table class=\"grid\">\n              <tr>\n                <td>\n                  <b>Use</b>\n                </td>\n                <td>\n                  <b>Name</b>\n                </td>\n                <td>\n                  <b>Cardinality</b>\n                </td>\n                <td>\n                  <b>Type</b>\n                </td>\n                <td>\n                  <b>Binding</b>\n                </td>\n                <td>\n                  <b>Documentation</b>\n                </td>\n              </tr>\n              <tr>\n                <td>IN</td>\n                <td>identifier</td>\n                <td>0..1</td>\n                <td>uri</td>\n                <td/>\n                <td>\n                  <div>\n                    <p>A logical questionnaire identifier (i.e. ''Questionnaire.identifier''). The server must know the questionnaire or be able to retrieve it from other known repositories.</p>\n\n                  </div>\n                </td>\n              </tr>\n              <tr>\n                <td>IN</td>\n                <td>questionnaire</td>\n                <td>0..1</td>\n                <td>Questionnaire</td>\n                <td/>\n                <td>\n                  <div>\n                    <p>The \n                      <a href=\"questionnaire.html\">Questionnaire</a> is provided directly as part of the request. Servers may choose not to accept questionnaires in this fashion\n                    </p>\n\n                  </div>\n                </td>\n              </tr>\n              <tr>\n                <td>IN</td>\n                <td>questionnaireRef</td>\n                <td>0..1</td>\n                <td>Reference</td>\n                <td/>\n                <td>\n                  <div>\n                    <p>The \n                      <a href=\"questionnaire.html\">Questionnaire</a> is provided as a resource reference. Servers may choose not to accept questionnaires in this fashion or may fail if they cannot resolve or access the referenced questionnaire.\n                    </p>\n\n                  </div>\n                </td>\n              </tr>\n              <tr>\n                <td>IN</td>\n                <td>subject</td>\n                <td>1..1</td>\n                <td>Reference</td>\n                <td/>\n                <td>\n                  <div>\n                    <p>The resource that is to be the \n                      <em>QuestionnaireResponse.subject</em>. The \n                      <a href=\"questionnaireresponse.html\">QuestionnaireResponse</a> instance will reference the provided subject.  In addition, if the \n                      <em>local</em> parameter is set to true, server information about the specified subject will be used to populate the instance.\n                    </p>\n\n                  </div>\n                </td>\n              </tr>\n              <tr>\n                <td>IN</td>\n                <td>content</td>\n                <td>0..*</td>\n                <td>Reference</td>\n                <td/>\n                <td>\n                  <div>\n                    <p>Resources containing information to be used to help populate the \n                      <a href=\"questionnaireresponse.html\">QuestionnaireResponse</a>.  These may be FHIR resources or may be binaries containing FHIR documents, CDA documents or other source materials.  Servers may not support all possible source materials and may ignore materials they do not recognize.  (They MAY provide warnings if ignoring submitted resources.)\n                    </p>\n\n                  </div>\n                </td>\n              </tr>\n              <tr>\n                <td>IN</td>\n                <td>local</td>\n                <td>0..1</td>\n                <td>boolean</td>\n                <td/>\n                <td>\n                  <div>\n                    <p>If specified and set to 'true' (and the server is capable), the server should use what resources and other knowledge it has about the referenced subject when pre-populating answers to questions.</p>\n\n                  </div>\n                </td>\n              </tr>\n              <tr>\n                <td>OUT</td>\n                <td>return</td>\n                <td>1..1</td>\n                <td>QuestionnaireResponse</td>\n                <td/>\n                <td>\n                  <div>\n                    <p>The partially (or fully)-populated set of answers for the specified Questionnaire</p>\n\n                  </div>\n                </td>\n              </tr>\n            </table>\n            <div>\n              <p>While it is theoretically possible for a \n                <a href=\"questionnaireresponse.html\">QuestionnaireResponse</a> instance to be completely auto-populated and submitted without human review, the intention of this transaction is merely to reduce redundant data entry.  A client \n                <strong>SHOULD</strong> ensure that a human submitter has an opportunity to review the auto-populated answers to confirm correctness as well as to complete or expand on information provided by the auto-population process.  Complex form designs with conditional logic or tight constraints on cardinalities may be challenging to auto-populate.  A server MAY choose to traverse the questionnaire as if it were a human respondent, answering only those questions that are enabled based on previously answered questions.  However, doing so may result in minimal population.  Alternatively, systems may choose to populate all known answers, independent of dependencies and other constraints.  This may cause questions to be answered that should not be answered.  It will be up to the client to appropriately prune the final populated questionnaire once human review has taken place.  Invoking this operation with the ''content'' parameter may involve the disclosure of personally identifiable healthcare information to the system which is performing the population process.  No such disclosures should be made unless the system on which the operation is being invoked is a &quot;trusted&quot; system and appropriate agreements are in place to protect the confidentiality of any information shared with that system.\n              </p>\n\n            </div>\n          </div>"},"url":"http://hl7.org/fhir/OperationDefinition/Questionnaire-populate","name":"Populate Questionnaire","status":"draft","kind":"operation","publisher":"HL7 (FHIR Project)","contact":[{"telecom":[{"system":"other","value":"http://hl7.org/fhir"},{"system":"email","value":"fhir@lists.hl7.org"}]}],"date":"2015-10-24T07:41:03+11:00","description":"Generates a [[[QuestionnaireResponse]]] instance  based on a specified [[[Questionnaire]]], filling in answers to questions where possible based on information provided as part of the operation or already known by the server about the subject of the [[[Questionnaire]]].  If the operation is not called at the instance level, one and only one of the identifier, questionnaire or questionnaireRef 'in' parameters must be provided. If called at the instance level, these parameters will be ignored. The response will contain a [[[QuestionnaireResponse]]] instance based on the specified [[[Questionnaire]]] and/or an [[[OperationOutcome]]] resource with errors or warnings.  The [[[QuestionnaireResponse]]] instance will be populated with an unanswered set of questions following the group and question structure of the specified [[[Questionnaire]]].  If  *content* parameters were specified or the *local* parameter was set to true, some of the questions may have answers filled in as well.  In the case of repeating questions or groups, typically only one repetition will be provided unless answer values exist that would support populating multiple repetitions.  Population of the [[[QuestionnaireResponse]]] with appropriate data is dependent on the questions and/or groups in the [[[Questionnaire]]] having metadata that allows the server to recognize the questions.  This might be through *Questionnaire.group.question.code*, through extensions such as the [[[http://hl7.org/fhir/StructureDefinition/questionnaire-deReference]]] extension or through use of the [[[ConceptMap]]] resource.  Regardless of the mechanism used to link the questions in a questionnaire to a \"known\" mappable concept, solutions using this operation should ensure that the details of the question and associated linkage element are sufficiently similar as to safely allow auto-population; i.e. the question text and context must be sufficiently the same, the value set for the question must fall within the value set for the mapped element, the data types must be the same or convertible, etc.","code":"populate","notes":"While it is theoretically possible for a [[[QuestionnaireResponse]]] instance to be completely auto-populated and submitted without human review, the intention of this transaction is merely to reduce redundant data entry.  A client **SHOULD** ensure that a human submitter has an opportunity to review the auto-populated answers to confirm correctness as well as to complete or expand on information provided by the auto-population process.  Complex form designs with conditional logic or tight constraints on cardinalities may be challenging to auto-populate.  A server MAY choose to traverse the questionnaire as if it were a human respondent, answering only those questions that are enabled based on previously answered questions.  However, doing so may result in minimal population.  Alternatively, systems may choose to populate all known answers, independent of dependencies and other constraints.  This may cause questions to be answered that should not be answered.  It will be up to the client to appropriately prune the final populated questionnaire once human review has taken place.  Invoking this operation with the ''content'' parameter may involve the disclosure of personally identifiable healthcare information to the system which is performing the population process.  No such disclosures should be made unless the system on which the operation is being invoked is a \"trusted\" system and appropriate agreements are in place to protect the confidentiality of any information shared with that system.","system":false,"type":["Questionnaire"],"instance":true,"parameter":[{"name":"identifier","use":"in","min":0,"max":"1","documentation":"A logical questionnaire identifier (i.e. ''Questionnaire.identifier''). The server must know the questionnaire or be able to retrieve it from other known repositories.","type":"uri"},{"name":"questionnaire","use":"in","min":0,"max":"1","documentation":"The [[[Questionnaire]]] is provided directly as part of the request. Servers may choose not to accept questionnaires in this fashion","type":"Questionnaire"},{"name":"questionnaireRef","use":"in","min":0,"max":"1","documentation":"The [[[Questionnaire]]] is provided as a resource reference. Servers may choose not to accept questionnaires in this fashion or may fail if they cannot resolve or access the referenced questionnaire.","type":"Reference","profile":{"reference":"http://hl7.org/fhir/StructureDefinition/Questionnaire"}},{"name":"subject","use":"in","min":1,"max":"1","documentation":"The resource that is to be the *QuestionnaireResponse.subject*. The [[[QuestionnaireResponse]]] instance will reference the provided subject.  In addition, if the *local* parameter is set to true, server information about the specified subject will be used to populate the instance.","type":"Reference"},{"name":"content","use":"in","min":0,"max":"*","documentation":"Resources containing information to be used to help populate the [[[QuestionnaireResponse]]].  These may be FHIR resources or may be binaries containing FHIR documents, CDA documents or other source materials.  Servers may not support all possible source materials and may ignore materials they do not recognize.  (They MAY provide warnings if ignoring submitted resources.)","type":"Reference"},{"name":"local","use":"in","min":0,"max":"1","documentation":"If specified and set to 'true' (and the server is capable), the server should use what resources and other knowledge it has about the referenced subject when pre-populating answers to questions.","type":"boolean"},{"name":"return","use":"out","min":1,"max":"1","documentation":"The partially (or fully)-populated set of answers for the specified Questionnaire","type":"QuestionnaireResponse"}]}