{"resourceType":"ValueSet","id":"resource-types","meta":{"lastUpdated":"2015-10-24T07:41:03.495+11:00","profile":["http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"]},"text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n            <h2>ResourceType</h2>\n            <p>One of the resource types defined as part of FHIR.</p>\n            <p>This value set has an inline code system http://hl7.org/fhir/resource-types, which defines the following codes:</p>\n            <table class=\"codes\">\n              <tr>\n                <td>\n                  <b>Code</b>\n                </td>\n                <td>\n                  <b>Display</b>\n                </td>\n                <td>\n                  <b>Definition</b>\n                </td>\n              </tr>\n              <tr>\n                <td>Account\n                  <a name=\"Account\"> </a>\n                </td>\n                <td>Account</td>\n                <td>A financial tool for tracking value accrued for a particular purpose.  In the healthcare field, used to track charges for a patient, cost centres, etc.</td>\n              </tr>\n              <tr>\n                <td>AllergyIntolerance\n                  <a name=\"AllergyIntolerance\"> </a>\n                </td>\n                <td>AllergyIntolerance</td>\n                <td>Risk of harmful or undesirable, physiological response which is unique to an individual and associated with exposure to a substance.</td>\n              </tr>\n              <tr>\n                <td>Appointment\n                  <a name=\"Appointment\"> </a>\n                </td>\n                <td>Appointment</td>\n                <td>A booking of a healthcare event among patient(s), practitioner(s), related person(s) and/or device(s) for a specific date/time. This may result in one or more Encounter(s).</td>\n              </tr>\n              <tr>\n                <td>AppointmentResponse\n                  <a name=\"AppointmentResponse\"> </a>\n                </td>\n                <td>AppointmentResponse</td>\n                <td>A reply to an appointment request for a patient and/or practitioner(s), such as a confirmation or rejection.</td>\n              </tr>\n              <tr>\n                <td>AuditEvent\n                  <a name=\"AuditEvent\"> </a>\n                </td>\n                <td>AuditEvent</td>\n                <td>A record of an event made for purposes of maintaining a security log. Typical uses include detection of intrusion attempts and monitoring for inappropriate usage.</td>\n              </tr>\n              <tr>\n                <td>Basic\n                  <a name=\"Basic\"> </a>\n                </td>\n                <td>Basic</td>\n                <td>Basic is used for handling concepts not yet defined in FHIR, narrative-only resources that don't map to an existing resource, and custom resources not appropriate for inclusion in the FHIR specification.</td>\n              </tr>\n              <tr>\n                <td>Binary\n                  <a name=\"Binary\"> </a>\n                </td>\n                <td>Binary</td>\n                <td>A binary resource can contain any content, whether text, image, pdf, zip archive, etc.</td>\n              </tr>\n              <tr>\n                <td>BodySite\n                  <a name=\"BodySite\"> </a>\n                </td>\n                <td>BodySite</td>\n                <td>Record details about the anatomical location of a specimen or body part.  This resource may be used when a coded concept does not provide the necessary detail needed for the use case.</td>\n              </tr>\n              <tr>\n                <td>Bundle\n                  <a name=\"Bundle\"> </a>\n                </td>\n                <td>Bundle</td>\n                <td>A container for a collection of resources.</td>\n              </tr>\n              <tr>\n                <td>CarePlan\n                  <a name=\"CarePlan\"> </a>\n                </td>\n                <td>CarePlan</td>\n                <td>Describes the intention of how one or more practitioners intend to deliver care for a particular patient, group or community for a period of time, possibly limited to care for a specific condition or set of conditions.</td>\n              </tr>\n              <tr>\n                <td>Claim\n                  <a name=\"Claim\"> </a>\n                </td>\n                <td>Claim</td>\n                <td>A provider issued list of services and products provided, or to be provided, to a patient which is provided to an insurer for payment recovery.</td>\n              </tr>\n              <tr>\n                <td>ClaimResponse\n                  <a name=\"ClaimResponse\"> </a>\n                </td>\n                <td>ClaimResponse</td>\n                <td>This resource provides the adjudication details from the processing of a Claim resource.</td>\n              </tr>\n              <tr>\n                <td>ClinicalImpression\n                  <a name=\"ClinicalImpression\"> </a>\n                </td>\n                <td>ClinicalImpression</td>\n                <td>A record of a clinical assessment performed to determine what problem(s) may affect the patient and before planning the treatments or management strategies that are best to manage a patient's condition. Assessments are often 1:1 with a clinical consultation / encounter,  but this varies greatly depending on the clinical workflow. This resource is called &quot;ClinicalImpression&quot; rather than &quot;ClinicalAssessment&quot; to avoid confusion with the recording of assessment tools such as Apgar score.</td>\n              </tr>\n              <tr>\n                <td>Communication\n                  <a name=\"Communication\"> </a>\n                </td>\n                <td>Communication</td>\n                <td>An occurrence of information being transmitted; e.g. an alert that was sent to a responsible provider, a public health agency was notified about a reportable condition.</td>\n              </tr>\n              <tr>\n                <td>CommunicationRequest\n                  <a name=\"CommunicationRequest\"> </a>\n                </td>\n                <td>CommunicationRequest</td>\n                <td>A request to convey information; e.g. the CDS system proposes that an alert be sent to a responsible provider, the CDS system proposes that the public health agency be notified about a reportable condition.</td>\n              </tr>\n              <tr>\n                <td>Composition\n                  <a name=\"Composition\"> </a>\n                </td>\n                <td>Composition</td>\n                <td>A set of healthcare-related information that is assembled together into a single logical document that provides a single coherent statement of meaning, establishes its own context and that has clinical attestation with regard to who is making the statement. While a Composition defines the structure, it does not actually contain the content: rather the full content of a document is contained in a Bundle, of which the Composition is the first resource contained.</td>\n              </tr>\n              <tr>\n                <td>ConceptMap\n                  <a name=\"ConceptMap\"> </a>\n                </td>\n                <td>ConceptMap</td>\n                <td>A statement of relationships from one set of concepts to one or more other concepts - either code systems or data elements, or classes in class models.</td>\n              </tr>\n              <tr>\n                <td>Condition\n                  <a name=\"Condition\"> </a>\n                </td>\n                <td>Condition</td>\n                <td>Use to record detailed information about conditions, problems or diagnoses recognized by a clinician. There are many uses including: recording a diagnosis during an encounter; populating a problem list or a summary statement, such as a discharge summary.</td>\n              </tr>\n              <tr>\n                <td>Conformance\n                  <a name=\"Conformance\"> </a>\n                </td>\n                <td>Conformance</td>\n                <td>A conformance statement is a set of capabilities of a FHIR Server that may be used as a statement of actual server functionality or a statement of required or desired server implementation.</td>\n              </tr>\n              <tr>\n                <td>Contract\n                  <a name=\"Contract\"> </a>\n                </td>\n                <td>Contract</td>\n                <td>A formal agreement between parties regarding the conduct of business, exchange of information or other matters.</td>\n              </tr>\n              <tr>\n                <td>Coverage\n                  <a name=\"Coverage\"> </a>\n                </td>\n                <td>Coverage</td>\n                <td>Financial instrument which may be used to pay for or reimburse health care products and services.</td>\n              </tr>\n              <tr>\n                <td>DataElement\n                  <a name=\"DataElement\"> </a>\n                </td>\n                <td>DataElement</td>\n                <td>The formal description of a single piece of information that can be gathered and reported.</td>\n              </tr>\n              <tr>\n                <td>DetectedIssue\n                  <a name=\"DetectedIssue\"> </a>\n                </td>\n                <td>DetectedIssue</td>\n                <td>Indicates an actual or potential clinical issue with or between one or more active or proposed clinical actions for a patient; e.g. Drug-drug interaction, Ineffective treatment frequency, Procedure-condition conflict, etc.</td>\n              </tr>\n              <tr>\n                <td>Device\n                  <a name=\"Device\"> </a>\n                </td>\n                <td>Device</td>\n                <td>This resource identifies an instance of a manufactured item that is used in the provision of healthcare without being substantially changed through that activity. The device may be a medical or non-medical device.  Medical devices includes durable (reusable) medical equipment, implantable devices, as well as disposable equipment used for diagnostic, treatment, and research for healthcare and public health.  Non-medical devices may include items such as a machine, cellphone, computer, application, etc.</td>\n              </tr>\n              <tr>\n                <td>DeviceComponent\n                  <a name=\"DeviceComponent\"> </a>\n                </td>\n                <td>DeviceComponent</td>\n                <td>Describes the characteristics, operational status and capabilities of a medical-related component of a medical device.</td>\n              </tr>\n              <tr>\n                <td>DeviceMetric\n                  <a name=\"DeviceMetric\"> </a>\n                </td>\n                <td>DeviceMetric</td>\n                <td>Describes a measurement, calculation or setting capability of a medical device.</td>\n              </tr>\n              <tr>\n                <td>DeviceUseRequest\n                  <a name=\"DeviceUseRequest\"> </a>\n                </td>\n                <td>DeviceUseRequest</td>\n                <td>Represents a request for a patient to employ a medical device. The device may be an implantable device, or an external assistive device, such as a walker.</td>\n              </tr>\n              <tr>\n                <td>DeviceUseStatement\n                  <a name=\"DeviceUseStatement\"> </a>\n                </td>\n                <td>DeviceUseStatement</td>\n                <td>A record of a device being used by a patient where the record is the result of a report from the patient or another clinician.</td>\n              </tr>\n              <tr>\n                <td>DiagnosticOrder\n                  <a name=\"DiagnosticOrder\"> </a>\n                </td>\n                <td>DiagnosticOrder</td>\n                <td>A record of a request for a diagnostic investigation service to be performed.</td>\n              </tr>\n              <tr>\n                <td>DiagnosticReport\n                  <a name=\"DiagnosticReport\"> </a>\n                </td>\n                <td>DiagnosticReport</td>\n                <td>The findings and interpretation of diagnostic  tests performed on patients, groups of patients, devices, and locations, and/or specimens derived from these. The report includes clinical context such as requesting and provider information, and some mix of atomic results, images, textual and coded interpretations, and formatted representation of diagnostic reports.</td>\n              </tr>\n              <tr>\n                <td>DocumentManifest\n                  <a name=\"DocumentManifest\"> </a>\n                </td>\n                <td>DocumentManifest</td>\n                <td>A manifest that defines a set of documents.</td>\n              </tr>\n              <tr>\n                <td>DocumentReference\n                  <a name=\"DocumentReference\"> </a>\n                </td>\n                <td>DocumentReference</td>\n                <td>A reference to a document .</td>\n              </tr>\n              <tr>\n                <td>DomainResource\n                  <a name=\"DomainResource\"> </a>\n                </td>\n                <td>DomainResource</td>\n                <td>--- Abstract Type! ---A resource that includes narrative, extensions, and contained resources.</td>\n              </tr>\n              <tr>\n                <td>EligibilityRequest\n                  <a name=\"EligibilityRequest\"> </a>\n                </td>\n                <td>EligibilityRequest</td>\n                <td>This resource provides the insurance eligibility details from the insurer regarding a specified coverage and optionally some class of service.</td>\n              </tr>\n              <tr>\n                <td>EligibilityResponse\n                  <a name=\"EligibilityResponse\"> </a>\n                </td>\n                <td>EligibilityResponse</td>\n                <td>This resource provides eligibility and plan details from the processing of an Eligibility resource.</td>\n              </tr>\n              <tr>\n                <td>Encounter\n                  <a name=\"Encounter\"> </a>\n                </td>\n                <td>Encounter</td>\n                <td>An interaction between a patient and healthcare provider(s) for the purpose of providing healthcare service(s) or assessing the health status of a patient.</td>\n              </tr>\n              <tr>\n                <td>EnrollmentRequest\n                  <a name=\"EnrollmentRequest\"> </a>\n                </td>\n                <td>EnrollmentRequest</td>\n                <td>This resource provides the insurance enrollment details to the insurer regarding a specified coverage.</td>\n              </tr>\n              <tr>\n                <td>EnrollmentResponse\n                  <a name=\"EnrollmentResponse\"> </a>\n                </td>\n                <td>EnrollmentResponse</td>\n                <td>This resource provides enrollment and plan details from the processing of an Enrollment resource.</td>\n              </tr>\n              <tr>\n                <td>EpisodeOfCare\n                  <a name=\"EpisodeOfCare\"> </a>\n                </td>\n                <td>EpisodeOfCare</td>\n                <td>An association between a patient and an organization / healthcare provider(s) during which time encounters may occur. The managing organization assumes a level of responsibility for the patient during this time.</td>\n              </tr>\n              <tr>\n                <td>ExplanationOfBenefit\n                  <a name=\"ExplanationOfBenefit\"> </a>\n                </td>\n                <td>ExplanationOfBenefit</td>\n                <td>This resource provides: the claim details; adjudication details from the processing of a Claim; and optionally account balance information, for informing the subscriber of the benefits provided.</td>\n              </tr>\n              <tr>\n                <td>FamilyMemberHistory\n                  <a name=\"FamilyMemberHistory\"> </a>\n                </td>\n                <td>FamilyMemberHistory</td>\n                <td>Significant health events and conditions for a person related to the patient relevant in the context of care for the patient.</td>\n              </tr>\n              <tr>\n                <td>Flag\n                  <a name=\"Flag\"> </a>\n                </td>\n                <td>Flag</td>\n                <td>Prospective warnings of potential issues when providing care to the patient.</td>\n              </tr>\n              <tr>\n                <td>Goal\n                  <a name=\"Goal\"> </a>\n                </td>\n                <td>Goal</td>\n                <td>Describes the intended objective(s) for a patient, group or organization care, for example, weight loss, restoring an activity of daily living, obtaining herd immunity via immunization, meeting a process improvement objective, etc.</td>\n              </tr>\n              <tr>\n                <td>Group\n                  <a name=\"Group\"> </a>\n                </td>\n                <td>Group</td>\n                <td>Represents a defined collection of entities that may be discussed or acted upon collectively but which are not expected to act collectively and are not formally or legally recognized; i.e. a collection of entities that isn't an Organization.</td>\n              </tr>\n              <tr>\n                <td>HealthcareService\n                  <a name=\"HealthcareService\"> </a>\n                </td>\n                <td>HealthcareService</td>\n                <td>The details of a healthcare service available at a location.</td>\n              </tr>\n              <tr>\n                <td>ImagingObjectSelection\n                  <a name=\"ImagingObjectSelection\"> </a>\n                </td>\n                <td>ImagingObjectSelection</td>\n                <td>A manifest of a set of DICOM Service-Object Pair Instances (SOP Instances).  The referenced SOP Instances (images or other content) are for a single patient, and may be from one or more studies. The referenced SOP Instances have been selected for a purpose, such as quality assurance, conference, or consult. Reflecting that range of purposes, typical ImagingObjectSelection resources may include all SOP Instances in a study (perhaps for sharing through a Health Information Exchange); key images from multiple studies (for reference by a referring or treating physician); a multi-frame ultrasound instance (&quot;cine&quot; video clip) and a set of measurements taken from that instance (for inclusion in a teaching file); and so on.</td>\n              </tr>\n              <tr>\n                <td>ImagingStudy\n                  <a name=\"ImagingStudy\"> </a>\n                </td>\n                <td>ImagingStudy</td>\n                <td>Representation of the content produced in a DICOM imaging study. A study comprises a set of series, each of which includes a set of Service-Object Pair Instances (SOP Instances - images or other data) acquired or produced in a common context.  A series is of only one modality (e.g. X-ray, CT, MR, ultrasound), but a study may have multiple series of different modalities.</td>\n              </tr>\n              <tr>\n                <td>Immunization\n                  <a name=\"Immunization\"> </a>\n                </td>\n                <td>Immunization</td>\n                <td>Describes the event of a patient being administered a vaccination or a record of a vaccination as reported by a patient, a clinician or another party and may include vaccine reaction information and what vaccination protocol was followed.</td>\n              </tr>\n              <tr>\n                <td>ImmunizationRecommendation\n                  <a name=\"ImmunizationRecommendation\"> </a>\n                </td>\n                <td>ImmunizationRecommendation</td>\n                <td>A patient's point-in-time immunization and recommendation (i.e. forecasting a patient's immunization eligibility according to a published schedule) with optional supporting justification.</td>\n              </tr>\n              <tr>\n                <td>ImplementationGuide\n                  <a name=\"ImplementationGuide\"> </a>\n                </td>\n                <td>ImplementationGuide</td>\n                <td>A set of rules or how FHIR is used to solve a particular problem. This resource is used to gather all the parts of an implementation guide into a logical whole, and to publish a computable definition of all the parts.</td>\n              </tr>\n              <tr>\n                <td>List\n                  <a name=\"List\"> </a>\n                </td>\n                <td>List</td>\n                <td>A set of information summarized from a list of other resources.</td>\n              </tr>\n              <tr>\n                <td>Location\n                  <a name=\"Location\"> </a>\n                </td>\n                <td>Location</td>\n                <td>Details and position information for a physical place where services are provided  and resources and participants may be stored, found, contained or accommodated.</td>\n              </tr>\n              <tr>\n                <td>Media\n                  <a name=\"Media\"> </a>\n                </td>\n                <td>Media</td>\n                <td>A photo, video, or audio recording acquired or used in healthcare. The actual content may be inline or provided by direct reference.</td>\n              </tr>\n              <tr>\n                <td>Medication\n                  <a name=\"Medication\"> </a>\n                </td>\n                <td>Medication</td>\n                <td>This resource is primarily used for the identification and definition of a medication. It covers the ingredients and the packaging for a medication.</td>\n              </tr>\n              <tr>\n                <td>MedicationAdministration\n                  <a name=\"MedicationAdministration\"> </a>\n                </td>\n                <td>MedicationAdministration</td>\n                <td>Describes the event of a patient consuming or otherwise being administered a medication.  This may be as simple as swallowing a tablet or it may be a long running infusion.  Related resources tie this event to the authorizing prescription, and the specific encounter between patient and health care practitioner.</td>\n              </tr>\n              <tr>\n                <td>MedicationDispense\n                  <a name=\"MedicationDispense\"> </a>\n                </td>\n                <td>MedicationDispense</td>\n                <td>Indicates that a medication product is to be or has been dispensed for a named person/patient.  This includes a description of the medication product (supply) provided and the instructions for administering the medication.  The medication dispense is the result of a pharmacy system responding to a medication order.</td>\n              </tr>\n              <tr>\n                <td>MedicationOrder\n                  <a name=\"MedicationOrder\"> </a>\n                </td>\n                <td>MedicationOrder</td>\n                <td>An order for both supply of the medication and the instructions for administration of the medication to a patient. The resource is called &quot;MedicationOrder&quot; rather than &quot;MedicationPrescription&quot; to generalize the use across inpatient and outpatient settings as well as for care plans, etc.</td>\n              </tr>\n              <tr>\n                <td>MedicationStatement\n                  <a name=\"MedicationStatement\"> </a>\n                </td>\n                <td>MedicationStatement</td>\n                <td>A record of a medication that is being consumed by a patient.   A MedicationStatement may indicate that the patient may be taking the medication now, or has taken the medication in the past or will be taking the medication in the future.  The source of this information can be the patient, significant other (such as a family member or spouse), or a clinician.  A common scenario where this information is captured is during the history taking process during a patient visit or stay.   The medication information may come from e.g. the patient's memory, from a prescription bottle,  or from a list of medications the patient, clinician or other party maintains \n\nThe primary difference between a medication statement and a medication administration is that the medication administration has complete administration information and is based on actual administration information from the person who administered the medication.  A medication statement is often, if not always, less specific.  There is no required date/time when the medication was administered, in fact we only know that a source has reported the patient is taking this medication, where details such as time, quantity, or rate or even medication product may be incomplete or missing or less precise.  As stated earlier, the medication statement information may come from the patient's memory, from a prescription bottle or from a list of medications the patient, clinician or other party maintains.  Medication administration is more formal and is not missing detailed information.</td>\n              </tr>\n              <tr>\n                <td>MessageHeader\n                  <a name=\"MessageHeader\"> </a>\n                </td>\n                <td>MessageHeader</td>\n                <td>The header for a message exchange that is either requesting or responding to an action.  The reference(s) that are the subject of the action as well as other information related to the action are typically transmitted in a bundle in which the MessageHeader resource instance is the first resource in the bundle.</td>\n              </tr>\n              <tr>\n                <td>NamingSystem\n                  <a name=\"NamingSystem\"> </a>\n                </td>\n                <td>NamingSystem</td>\n                <td>A curated namespace that issues unique symbols within that namespace for the identification of concepts, people, devices, etc.  Represents a &quot;System&quot; used within the Identifier and Coding data types.</td>\n              </tr>\n              <tr>\n                <td>NutritionOrder\n                  <a name=\"NutritionOrder\"> </a>\n                </td>\n                <td>NutritionOrder</td>\n                <td>A request to supply a diet, formula feeding (enteral) or oral nutritional supplement to a patient/resident.</td>\n              </tr>\n              <tr>\n                <td>Observation\n                  <a name=\"Observation\"> </a>\n                </td>\n                <td>Observation</td>\n                <td>Measurements and simple assertions made about a patient, device or other subject.</td>\n              </tr>\n              <tr>\n                <td>OperationDefinition\n                  <a name=\"OperationDefinition\"> </a>\n                </td>\n                <td>OperationDefinition</td>\n                <td>A formal computable definition of an operation (on the RESTful interface) or a named query (using the search interaction).</td>\n              </tr>\n              <tr>\n                <td>OperationOutcome\n                  <a name=\"OperationOutcome\"> </a>\n                </td>\n                <td>OperationOutcome</td>\n                <td>A collection of error, warning or information messages that result from a system action.</td>\n              </tr>\n              <tr>\n                <td>Order\n                  <a name=\"Order\"> </a>\n                </td>\n                <td>Order</td>\n                <td>A request to perform an action.</td>\n              </tr>\n              <tr>\n                <td>OrderResponse\n                  <a name=\"OrderResponse\"> </a>\n                </td>\n                <td>OrderResponse</td>\n                <td>A response to an order.</td>\n              </tr>\n              <tr>\n                <td>Organization\n                  <a name=\"Organization\"> </a>\n                </td>\n                <td>Organization</td>\n                <td>A formally or informally recognized grouping of people or organizations formed for the purpose of achieving some form of collective action.  Includes companies, institutions, corporations, departments, community groups, healthcare practice groups, etc.</td>\n              </tr>\n              <tr>\n                <td>Parameters\n                  <a name=\"Parameters\"> </a>\n                </td>\n                <td>Parameters</td>\n                <td>This special resource type is used to represent an operation request and response (operations.html). It has no other use, and there is no RESTful endpoint associated with it.</td>\n              </tr>\n              <tr>\n                <td>Patient\n                  <a name=\"Patient\"> </a>\n                </td>\n                <td>Patient</td>\n                <td>Demographics and other administrative information about an individual or animal receiving care or other health-related services.</td>\n              </tr>\n              <tr>\n                <td>PaymentNotice\n                  <a name=\"PaymentNotice\"> </a>\n                </td>\n                <td>PaymentNotice</td>\n                <td>This resource provides the status of the payment for goods and services rendered, and the request and response resource references.</td>\n              </tr>\n              <tr>\n                <td>PaymentReconciliation\n                  <a name=\"PaymentReconciliation\"> </a>\n                </td>\n                <td>PaymentReconciliation</td>\n                <td>This resource provides payment details and claim references supporting a bulk payment.</td>\n              </tr>\n              <tr>\n                <td>Person\n                  <a name=\"Person\"> </a>\n                </td>\n                <td>Person</td>\n                <td>Demographics and administrative information about a person independent of a specific health-related context.</td>\n              </tr>\n              <tr>\n                <td>Practitioner\n                  <a name=\"Practitioner\"> </a>\n                </td>\n                <td>Practitioner</td>\n                <td>A person who is directly or indirectly involved in the provisioning of healthcare.</td>\n              </tr>\n              <tr>\n                <td>Procedure\n                  <a name=\"Procedure\"> </a>\n                </td>\n                <td>Procedure</td>\n                <td>An action that is or was performed on a patient. This can be a physical intervention like an operation, or less invasive like counseling or hypnotherapy.</td>\n              </tr>\n              <tr>\n                <td>ProcedureRequest\n                  <a name=\"ProcedureRequest\"> </a>\n                </td>\n                <td>ProcedureRequest</td>\n                <td>A request for a procedure to be performed. May be a proposal or an order.</td>\n              </tr>\n              <tr>\n                <td>ProcessRequest\n                  <a name=\"ProcessRequest\"> </a>\n                </td>\n                <td>ProcessRequest</td>\n                <td>This resource provides the target, request and response, and action details for an action to be performed by the target on or about existing resources.</td>\n              </tr>\n              <tr>\n                <td>ProcessResponse\n                  <a name=\"ProcessResponse\"> </a>\n                </td>\n                <td>ProcessResponse</td>\n                <td>This resource provides processing status, errors and notes from the processing of a resource.</td>\n              </tr>\n              <tr>\n                <td>Provenance\n                  <a name=\"Provenance\"> </a>\n                </td>\n                <td>Provenance</td>\n                <td>Provenance of a resource is a record that describes entities and processes involved in producing and delivering or otherwise influencing that resource. Provenance provides a critical foundation for assessing authenticity, enabling trust, and allowing reproducibility. Provenance assertions are a form of contextual metadata and can themselves become important records with their own provenance. Provenance statement indicates clinical significance in terms of confidence in authenticity, reliability, and trustworthiness, integrity, and stage in lifecycle (e.g. Document Completion - has the artifact been legally authenticated), all of which may impact security, privacy, and trust policies.</td>\n              </tr>\n              <tr>\n                <td>Questionnaire\n                  <a name=\"Questionnaire\"> </a>\n                </td>\n                <td>Questionnaire</td>\n                <td>A structured set of questions intended to guide the collection of answers. The questions are ordered and grouped into coherent subsets, corresponding to the structure of the grouping of the underlying questions.</td>\n              </tr>\n              <tr>\n                <td>QuestionnaireResponse\n                  <a name=\"QuestionnaireResponse\"> </a>\n                </td>\n                <td>QuestionnaireResponse</td>\n                <td>A structured set of questions and their answers. The questions are ordered and grouped into coherent subsets, corresponding to the structure of the grouping of the underlying questions.</td>\n              </tr>\n              <tr>\n                <td>ReferralRequest\n                  <a name=\"ReferralRequest\"> </a>\n                </td>\n                <td>ReferralRequest</td>\n                <td>Used to record and send details about a request for referral service or transfer of a patient to the care of another provider or provider organization.</td>\n              </tr>\n              <tr>\n                <td>RelatedPerson\n                  <a name=\"RelatedPerson\"> </a>\n                </td>\n                <td>RelatedPerson</td>\n                <td>Information about a person that is involved in the care for a patient, but who is not the target of healthcare, nor has a formal responsibility in the care process.</td>\n              </tr>\n              <tr>\n                <td>Resource\n                  <a name=\"Resource\"> </a>\n                </td>\n                <td>Resource</td>\n                <td>--- Abstract Type! ---This is the base resource type for everything.</td>\n              </tr>\n              <tr>\n                <td>RiskAssessment\n                  <a name=\"RiskAssessment\"> </a>\n                </td>\n                <td>RiskAssessment</td>\n                <td>An assessment of the likely outcome(s) for a patient or other subject as well as the likelihood of each outcome.</td>\n              </tr>\n              <tr>\n                <td>Schedule\n                  <a name=\"Schedule\"> </a>\n                </td>\n                <td>Schedule</td>\n                <td>A container for slot(s) of time that may be available for booking appointments.</td>\n              </tr>\n              <tr>\n                <td>SearchParameter\n                  <a name=\"SearchParameter\"> </a>\n                </td>\n                <td>SearchParameter</td>\n                <td>A search parameter that defines a named search item that can be used to search/filter on a resource.</td>\n              </tr>\n              <tr>\n                <td>Slot\n                  <a name=\"Slot\"> </a>\n                </td>\n                <td>Slot</td>\n                <td>A slot of time on a schedule that may be available for booking appointments.</td>\n              </tr>\n              <tr>\n                <td>Specimen\n                  <a name=\"Specimen\"> </a>\n                </td>\n                <td>Specimen</td>\n                <td>A sample to be used for analysis.</td>\n              </tr>\n              <tr>\n                <td>StructureDefinition\n                  <a name=\"StructureDefinition\"> </a>\n                </td>\n                <td>StructureDefinition</td>\n                <td>A definition of a FHIR structure. This resource is used to describe the underlying resources, data types defined in FHIR, and also for describing extensions, and constraints on resources and data types.</td>\n              </tr>\n              <tr>\n                <td>Subscription\n                  <a name=\"Subscription\"> </a>\n                </td>\n                <td>Subscription</td>\n                <td>The subscription resource is used to define a push based subscription from a server to another system. Once a subscription is registered with the server, the server checks every resource that is created or updated, and if the resource matches the given criteria, it sends a message on the defined &quot;channel&quot; so that another system is able to take an appropriate action.</td>\n              </tr>\n              <tr>\n                <td>Substance\n                  <a name=\"Substance\"> </a>\n                </td>\n                <td>Substance</td>\n                <td>A homogeneous material with a definite composition.</td>\n              </tr>\n              <tr>\n                <td>SupplyDelivery\n                  <a name=\"SupplyDelivery\"> </a>\n                </td>\n                <td>SupplyDelivery</td>\n                <td>Record of delivery of what is supplied.</td>\n              </tr>\n              <tr>\n                <td>SupplyRequest\n                  <a name=\"SupplyRequest\"> </a>\n                </td>\n                <td>SupplyRequest</td>\n                <td>A record of a request for a medication, substance or device used in the healthcare setting.</td>\n              </tr>\n              <tr>\n                <td>TestScript\n                  <a name=\"TestScript\"> </a>\n                </td>\n                <td>TestScript</td>\n                <td>TestScript is a resource that specifies a suite of tests against a FHIR server implementation to determine compliance against the FHIR specification.</td>\n              </tr>\n              <tr>\n                <td>ValueSet\n                  <a name=\"ValueSet\"> </a>\n                </td>\n                <td>ValueSet</td>\n                <td>A value set specifies a set of codes drawn from one or more code systems.</td>\n              </tr>\n              <tr>\n                <td>VisionPrescription\n                  <a name=\"VisionPrescription\"> </a>\n                </td>\n                <td>VisionPrescription</td>\n                <td>An authorization for the supply of glasses and/or contact lenses to a patient.</td>\n              </tr>\n            </table>\n          </div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.4.642.2.16"}],"url":"http://hl7.org/fhir/ValueSet/resource-types","version":"1.0.2","name":"ResourceType","status":"draft","experimental":false,"publisher":"HL7 (FHIR Project)","contact":[{"telecom":[{"system":"other","value":"http://hl7.org/fhir"},{"system":"email","value":"fhir@lists.hl7.org"}]}],"date":"2015-10-24T07:41:03+11:00","description":"One of the resource types defined as part of FHIR.","codeSystem":{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.4.642.1.16"}],"system":"http://hl7.org/fhir/resource-types","version":"1.0.2","caseSensitive":true,"concept":[{"code":"Account","display":"Account","definition":"A financial tool for tracking value accrued for a particular purpose.  In the healthcare field, used to track charges for a patient, cost centres, etc."},{"code":"AllergyIntolerance","display":"AllergyIntolerance","definition":"Risk of harmful or undesirable, physiological response which is unique to an individual and associated with exposure to a substance."},{"code":"Appointment","display":"Appointment","definition":"A booking of a healthcare event among patient(s), practitioner(s), related person(s) and/or device(s) for a specific date/time. This may result in one or more Encounter(s)."},{"code":"AppointmentResponse","display":"AppointmentResponse","definition":"A reply to an appointment request for a patient and/or practitioner(s), such as a confirmation or rejection."},{"code":"AuditEvent","display":"AuditEvent","definition":"A record of an event made for purposes of maintaining a security log. Typical uses include detection of intrusion attempts and monitoring for inappropriate usage."},{"code":"Basic","display":"Basic","definition":"Basic is used for handling concepts not yet defined in FHIR, narrative-only resources that don't map to an existing resource, and custom resources not appropriate for inclusion in the FHIR specification."},{"code":"Binary","display":"Binary","definition":"A binary resource can contain any content, whether text, image, pdf, zip archive, etc."},{"code":"BodySite","display":"BodySite","definition":"Record details about the anatomical location of a specimen or body part.  This resource may be used when a coded concept does not provide the necessary detail needed for the use case."},{"code":"Bundle","display":"Bundle","definition":"A container for a collection of resources."},{"code":"CarePlan","display":"CarePlan","definition":"Describes the intention of how one or more practitioners intend to deliver care for a particular patient, group or community for a period of time, possibly limited to care for a specific condition or set of conditions."},{"code":"Claim","display":"Claim","definition":"A provider issued list of services and products provided, or to be provided, to a patient which is provided to an insurer for payment recovery."},{"code":"ClaimResponse","display":"ClaimResponse","definition":"This resource provides the adjudication details from the processing of a Claim resource."},{"code":"ClinicalImpression","display":"ClinicalImpression","definition":"A record of a clinical assessment performed to determine what problem(s) may affect the patient and before planning the treatments or management strategies that are best to manage a patient's condition. Assessments are often 1:1 with a clinical consultation / encounter,  but this varies greatly depending on the clinical workflow. This resource is called \"ClinicalImpression\" rather than \"ClinicalAssessment\" to avoid confusion with the recording of assessment tools such as Apgar score."},{"code":"Communication","display":"Communication","definition":"An occurrence of information being transmitted; e.g. an alert that was sent to a responsible provider, a public health agency was notified about a reportable condition."},{"code":"CommunicationRequest","display":"CommunicationRequest","definition":"A request to convey information; e.g. the CDS system proposes that an alert be sent to a responsible provider, the CDS system proposes that the public health agency be notified about a reportable condition."},{"code":"Composition","display":"Composition","definition":"A set of healthcare-related information that is assembled together into a single logical document that provides a single coherent statement of meaning, establishes its own context and that has clinical attestation with regard to who is making the statement. While a Composition defines the structure, it does not actually contain the content: rather the full content of a document is contained in a Bundle, of which the Composition is the first resource contained."},{"code":"ConceptMap","display":"ConceptMap","definition":"A statement of relationships from one set of concepts to one or more other concepts - either code systems or data elements, or classes in class models."},{"code":"Condition","display":"Condition","definition":"Use to record detailed information about conditions, problems or diagnoses recognized by a clinician. There are many uses including: recording a diagnosis during an encounter; populating a problem list or a summary statement, such as a discharge summary."},{"code":"Conformance","display":"Conformance","definition":"A conformance statement is a set of capabilities of a FHIR Server that may be used as a statement of actual server functionality or a statement of required or desired server implementation."},{"code":"Contract","display":"Contract","definition":"A formal agreement between parties regarding the conduct of business, exchange of information or other matters."},{"code":"Coverage","display":"Coverage","definition":"Financial instrument which may be used to pay for or reimburse health care products and services."},{"code":"DataElement","display":"DataElement","definition":"The formal description of a single piece of information that can be gathered and reported."},{"code":"DetectedIssue","display":"DetectedIssue","definition":"Indicates an actual or potential clinical issue with or between one or more active or proposed clinical actions for a patient; e.g. Drug-drug interaction, Ineffective treatment frequency, Procedure-condition conflict, etc."},{"code":"Device","display":"Device","definition":"This resource identifies an instance of a manufactured item that is used in the provision of healthcare without being substantially changed through that activity. The device may be a medical or non-medical device.  Medical devices includes durable (reusable) medical equipment, implantable devices, as well as disposable equipment used for diagnostic, treatment, and research for healthcare and public health.  Non-medical devices may include items such as a machine, cellphone, computer, application, etc."},{"code":"DeviceComponent","display":"DeviceComponent","definition":"Describes the characteristics, operational status and capabilities of a medical-related component of a medical device."},{"code":"DeviceMetric","display":"DeviceMetric","definition":"Describes a measurement, calculation or setting capability of a medical device."},{"code":"DeviceUseRequest","display":"DeviceUseRequest","definition":"Represents a request for a patient to employ a medical device. The device may be an implantable device, or an external assistive device, such as a walker."},{"code":"DeviceUseStatement","display":"DeviceUseStatement","definition":"A record of a device being used by a patient where the record is the result of a report from the patient or another clinician."},{"code":"DiagnosticOrder","display":"DiagnosticOrder","definition":"A record of a request for a diagnostic investigation service to be performed."},{"code":"DiagnosticReport","display":"DiagnosticReport","definition":"The findings and interpretation of diagnostic  tests performed on patients, groups of patients, devices, and locations, and/or specimens derived from these. The report includes clinical context such as requesting and provider information, and some mix of atomic results, images, textual and coded interpretations, and formatted representation of diagnostic reports."},{"code":"DocumentManifest","display":"DocumentManifest","definition":"A manifest that defines a set of documents."},{"code":"DocumentReference","display":"DocumentReference","definition":"A reference to a document ."},{"code":"DomainResource","display":"DomainResource","definition":"--- Abstract Type! ---A resource that includes narrative, extensions, and contained resources."},{"code":"EligibilityRequest","display":"EligibilityRequest","definition":"This resource provides the insurance eligibility details from the insurer regarding a specified coverage and optionally some class of service."},{"code":"EligibilityResponse","display":"EligibilityResponse","definition":"This resource provides eligibility and plan details from the processing of an Eligibility resource."},{"code":"Encounter","display":"Encounter","definition":"An interaction between a patient and healthcare provider(s) for the purpose of providing healthcare service(s) or assessing the health status of a patient."},{"code":"EnrollmentRequest","display":"EnrollmentRequest","definition":"This resource provides the insurance enrollment details to the insurer regarding a specified coverage."},{"code":"EnrollmentResponse","display":"EnrollmentResponse","definition":"This resource provides enrollment and plan details from the processing of an Enrollment resource."},{"code":"EpisodeOfCare","display":"EpisodeOfCare","definition":"An association between a patient and an organization / healthcare provider(s) during which time encounters may occur. The managing organization assumes a level of responsibility for the patient during this time."},{"code":"ExplanationOfBenefit","display":"ExplanationOfBenefit","definition":"This resource provides: the claim details; adjudication details from the processing of a Claim; and optionally account balance information, for informing the subscriber of the benefits provided."},{"code":"FamilyMemberHistory","display":"FamilyMemberHistory","definition":"Significant health events and conditions for a person related to the patient relevant in the context of care for the patient."},{"code":"Flag","display":"Flag","definition":"Prospective warnings of potential issues when providing care to the patient."},{"code":"Goal","display":"Goal","definition":"Describes the intended objective(s) for a patient, group or organization care, for example, weight loss, restoring an activity of daily living, obtaining herd immunity via immunization, meeting a process improvement objective, etc."},{"code":"Group","display":"Group","definition":"Represents a defined collection of entities that may be discussed or acted upon collectively but which are not expected to act collectively and are not formally or legally recognized; i.e. a collection of entities that isn't an Organization."},{"code":"HealthcareService","display":"HealthcareService","definition":"The details of a healthcare service available at a location."},{"code":"ImagingObjectSelection","display":"ImagingObjectSelection","definition":"A manifest of a set of DICOM Service-Object Pair Instances (SOP Instances).  The referenced SOP Instances (images or other content) are for a single patient, and may be from one or more studies. The referenced SOP Instances have been selected for a purpose, such as quality assurance, conference, or consult. Reflecting that range of purposes, typical ImagingObjectSelection resources may include all SOP Instances in a study (perhaps for sharing through a Health Information Exchange); key images from multiple studies (for reference by a referring or treating physician); a multi-frame ultrasound instance (\"cine\" video clip) and a set of measurements taken from that instance (for inclusion in a teaching file); and so on."},{"code":"ImagingStudy","display":"ImagingStudy","definition":"Representation of the content produced in a DICOM imaging study. A study comprises a set of series, each of which includes a set of Service-Object Pair Instances (SOP Instances - images or other data) acquired or produced in a common context.  A series is of only one modality (e.g. X-ray, CT, MR, ultrasound), but a study may have multiple series of different modalities."},{"code":"Immunization","display":"Immunization","definition":"Describes the event of a patient being administered a vaccination or a record of a vaccination as reported by a patient, a clinician or another party and may include vaccine reaction information and what vaccination protocol was followed."},{"code":"ImmunizationRecommendation","display":"ImmunizationRecommendation","definition":"A patient's point-in-time immunization and recommendation (i.e. forecasting a patient's immunization eligibility according to a published schedule) with optional supporting justification."},{"code":"ImplementationGuide","display":"ImplementationGuide","definition":"A set of rules or how FHIR is used to solve a particular problem. This resource is used to gather all the parts of an implementation guide into a logical whole, and to publish a computable definition of all the parts."},{"code":"List","display":"List","definition":"A set of information summarized from a list of other resources."},{"code":"Location","display":"Location","definition":"Details and position information for a physical place where services are provided  and resources and participants may be stored, found, contained or accommodated."},{"code":"Media","display":"Media","definition":"A photo, video, or audio recording acquired or used in healthcare. The actual content may be inline or provided by direct reference."},{"code":"Medication","display":"Medication","definition":"This resource is primarily used for the identification and definition of a medication. It covers the ingredients and the packaging for a medication."},{"code":"MedicationAdministration","display":"MedicationAdministration","definition":"Describes the event of a patient consuming or otherwise being administered a medication.  This may be as simple as swallowing a tablet or it may be a long running infusion.  Related resources tie this event to the authorizing prescription, and the specific encounter between patient and health care practitioner."},{"code":"MedicationDispense","display":"MedicationDispense","definition":"Indicates that a medication product is to be or has been dispensed for a named person/patient.  This includes a description of the medication product (supply) provided and the instructions for administering the medication.  The medication dispense is the result of a pharmacy system responding to a medication order."},{"code":"MedicationOrder","display":"MedicationOrder","definition":"An order for both supply of the medication and the instructions for administration of the medication to a patient. The resource is called \"MedicationOrder\" rather than \"MedicationPrescription\" to generalize the use across inpatient and outpatient settings as well as for care plans, etc."},{"code":"MedicationStatement","display":"MedicationStatement","definition":"A record of a medication that is being consumed by a patient.   A MedicationStatement may indicate that the patient may be taking the medication now, or has taken the medication in the past or will be taking the medication in the future.  The source of this information can be the patient, significant other (such as a family member or spouse), or a clinician.  A common scenario where this information is captured is during the history taking process during a patient visit or stay.   The medication information may come from e.g. the patient's memory, from a prescription bottle,  or from a list of medications the patient, clinician or other party maintains   The primary difference between a medication statement and a medication administration is that the medication administration has complete administration information and is based on actual administration information from the person who administered the medication.  A medication statement is often, if not always, less specific.  There is no required date/time when the medication was administered, in fact we only know that a source has reported the patient is taking this medication, where details such as time, quantity, or rate or even medication product may be incomplete or missing or less precise.  As stated earlier, the medication statement information may come from the patient's memory, from a prescription bottle or from a list of medications the patient, clinician or other party maintains.  Medication administration is more formal and is not missing detailed information."},{"code":"MessageHeader","display":"MessageHeader","definition":"The header for a message exchange that is either requesting or responding to an action.  The reference(s) that are the subject of the action as well as other information related to the action are typically transmitted in a bundle in which the MessageHeader resource instance is the first resource in the bundle."},{"code":"NamingSystem","display":"NamingSystem","definition":"A curated namespace that issues unique symbols within that namespace for the identification of concepts, people, devices, etc.  Represents a \"System\" used within the Identifier and Coding data types."},{"code":"NutritionOrder","display":"NutritionOrder","definition":"A request to supply a diet, formula feeding (enteral) or oral nutritional supplement to a patient/resident."},{"code":"Observation","display":"Observation","definition":"Measurements and simple assertions made about a patient, device or other subject."},{"code":"OperationDefinition","display":"OperationDefinition","definition":"A formal computable definition of an operation (on the RESTful interface) or a named query (using the search interaction)."},{"code":"OperationOutcome","display":"OperationOutcome","definition":"A collection of error, warning or information messages that result from a system action."},{"code":"Order","display":"Order","definition":"A request to perform an action."},{"code":"OrderResponse","display":"OrderResponse","definition":"A response to an order."},{"code":"Organization","display":"Organization","definition":"A formally or informally recognized grouping of people or organizations formed for the purpose of achieving some form of collective action.  Includes companies, institutions, corporations, departments, community groups, healthcare practice groups, etc."},{"code":"Parameters","display":"Parameters","definition":"This special resource type is used to represent an operation request and response (operations.html). It has no other use, and there is no RESTful endpoint associated with it."},{"code":"Patient","display":"Patient","definition":"Demographics and other administrative information about an individual or animal receiving care or other health-related services."},{"code":"PaymentNotice","display":"PaymentNotice","definition":"This resource provides the status of the payment for goods and services rendered, and the request and response resource references."},{"code":"PaymentReconciliation","display":"PaymentReconciliation","definition":"This resource provides payment details and claim references supporting a bulk payment."},{"code":"Person","display":"Person","definition":"Demographics and administrative information about a person independent of a specific health-related context."},{"code":"Practitioner","display":"Practitioner","definition":"A person who is directly or indirectly involved in the provisioning of healthcare."},{"code":"Procedure","display":"Procedure","definition":"An action that is or was performed on a patient. This can be a physical intervention like an operation, or less invasive like counseling or hypnotherapy."},{"code":"ProcedureRequest","display":"ProcedureRequest","definition":"A request for a procedure to be performed. May be a proposal or an order."},{"code":"ProcessRequest","display":"ProcessRequest","definition":"This resource provides the target, request and response, and action details for an action to be performed by the target on or about existing resources."},{"code":"ProcessResponse","display":"ProcessResponse","definition":"This resource provides processing status, errors and notes from the processing of a resource."},{"code":"Provenance","display":"Provenance","definition":"Provenance of a resource is a record that describes entities and processes involved in producing and delivering or otherwise influencing that resource. Provenance provides a critical foundation for assessing authenticity, enabling trust, and allowing reproducibility. Provenance assertions are a form of contextual metadata and can themselves become important records with their own provenance. Provenance statement indicates clinical significance in terms of confidence in authenticity, reliability, and trustworthiness, integrity, and stage in lifecycle (e.g. Document Completion - has the artifact been legally authenticated), all of which may impact security, privacy, and trust policies."},{"code":"Questionnaire","display":"Questionnaire","definition":"A structured set of questions intended to guide the collection of answers. The questions are ordered and grouped into coherent subsets, corresponding to the structure of the grouping of the underlying questions."},{"code":"QuestionnaireResponse","display":"QuestionnaireResponse","definition":"A structured set of questions and their answers. The questions are ordered and grouped into coherent subsets, corresponding to the structure of the grouping of the underlying questions."},{"code":"ReferralRequest","display":"ReferralRequest","definition":"Used to record and send details about a request for referral service or transfer of a patient to the care of another provider or provider organization."},{"code":"RelatedPerson","display":"RelatedPerson","definition":"Information about a person that is involved in the care for a patient, but who is not the target of healthcare, nor has a formal responsibility in the care process."},{"code":"Resource","display":"Resource","definition":"--- Abstract Type! ---This is the base resource type for everything."},{"code":"RiskAssessment","display":"RiskAssessment","definition":"An assessment of the likely outcome(s) for a patient or other subject as well as the likelihood of each outcome."},{"code":"Schedule","display":"Schedule","definition":"A container for slot(s) of time that may be available for booking appointments."},{"code":"SearchParameter","display":"SearchParameter","definition":"A search parameter that defines a named search item that can be used to search/filter on a resource."},{"code":"Slot","display":"Slot","definition":"A slot of time on a schedule that may be available for booking appointments."},{"code":"Specimen","display":"Specimen","definition":"A sample to be used for analysis."},{"code":"StructureDefinition","display":"StructureDefinition","definition":"A definition of a FHIR structure. This resource is used to describe the underlying resources, data types defined in FHIR, and also for describing extensions, and constraints on resources and data types."},{"code":"Subscription","display":"Subscription","definition":"The subscription resource is used to define a push based subscription from a server to another system. Once a subscription is registered with the server, the server checks every resource that is created or updated, and if the resource matches the given criteria, it sends a message on the defined \"channel\" so that another system is able to take an appropriate action."},{"code":"Substance","display":"Substance","definition":"A homogeneous material with a definite composition."},{"code":"SupplyDelivery","display":"SupplyDelivery","definition":"Record of delivery of what is supplied."},{"code":"SupplyRequest","display":"SupplyRequest","definition":"A record of a request for a medication, substance or device used in the healthcare setting."},{"code":"TestScript","display":"TestScript","definition":"TestScript is a resource that specifies a suite of tests against a FHIR server implementation to determine compliance against the FHIR specification."},{"code":"ValueSet","display":"ValueSet","definition":"A value set specifies a set of codes drawn from one or more code systems."},{"code":"VisionPrescription","display":"VisionPrescription","definition":"An authorization for the supply of glasses and/or contact lenses to a patient."}]}}