{"resourceType":"ValueSet","id":"daf-substance","meta":{"lastUpdated":"2015-10-24T07:41:03.495+11:00","profile":["http://hl7.org/fhir/StructureDefinition/valueset-shareable-definition"]},"text":{"status":"additional","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n      \n      \n      \n            <p>\n        \n        \n              <b>DAF Substance-Reactant for Intolerance and Negation Codes</b>\n      \n      \n            </p>\n      \n      \n      \n            <hr/>\n      \n      \n      \n            <p>A substance or other type of agent (e.g., sunshine) that may be associated \n       with an intolerance reaction event or a propensity to such an event. These \n       concepts are expected to be at a more general level of abstraction (ingredients \n       versus more specific formulations). This value set is quite general and includes \n       concepts that may never cause an adverse event, particularly the included SNOMED \n       CT concepts. The code system-specific value sets in this grouping value set are \n       intended to provide broad coverage of all kinds of agents, but the expectation \n       for use is that the chosen concept identifier for a substance should be appropriately \n       specific and drawn from the available code systems in the following priority order: \n       NDFRT, then RXNORM, then UNII, then SNOMED CT. This overarching grouping value \n       set is intended to support identification of drug classes, individual medication \n       ingredients, foods, general substances and environmental entities.\n      </p>\n      \n      \n      \n            <p>\n        This value set is a union of 4 other value sets:\n      </p>\n      \n      \n      \n            <ul>\n       \n        \n        \n              <li>daf-substance-ndfrt: NUI codes for NDF-RT concept types of “Mechanism of Action - N0000000223”, “Physiologic Effect - N0000009802” or “Chemical Structure - N0000000002”</li>\n       \n        \n        \n              <li>daf-substance-rxnorm: CUI codes for TTY = (IN, PIN, MIN, BN), where the code is not obsolete</li>\n       \n        \n        \n              <li>daf-substance-unii: All UNII codes</li>\n       \n        \n        \n              <li>daf-substance-sct: Substance Other Than Clinical Drug</li>\n      \n      \n      \n            </ul>\n      \n      \n      \n            <p>\n       This value set includes content from SNOMED CT, which is copyright © 2002+ International Health Terminology Standards Development Organisation (IHTSDO), and distributed by agreement between IHTSDO and HL7. Implementer use of SNOMED CT is not covered by this agreement \n      </p>\n    \n    \n    \n          </div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113762.1.4.1010.1"},{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.4.642.2.0"}],"url":"http://hl7.org/fhir/ValueSet/daf-substance","version":"1.0.2","name":"DAF Substance-Reactant for Intolerance and Negation Codes","status":"draft","experimental":true,"publisher":"FHIR Project team","contact":[{"telecom":[{"system":"other","value":"http://hl7.org/fhir"}]}],"date":"2015-10-24T07:41:03+11:00","description":"A substance or other type of agent (e.g., sunshine) that may be associated with an intolerance reaction event or a propensity to such an event. These concepts are expected to be at a more general level of abstraction (ingredients versus more specific formulations). This value set is quite general and includes concepts that may never cause an adverse event, particularly the included SNOMED CT concepts. The code system-specific value sets in this grouping value set are intended to provide broad coverage of all kinds of agents, but the expectation for use is that the chosen concept identifier for a substance should be appropriately specific and drawn from the available code systems in the following priority order: NDFRT, then RXNORM, then UNII, then SNOMED CT. This overarching grouping value set is intended to support identification of drug classes, individual medication ingredients, foods, general substances and environmental entities","copyright":"This value set includes content from SNOMED CT, which is copyright © 2002+ International Health Terminology Standards Development Organisation (IHTSDO), and distributed by agreement between IHTSDO and HL7. Implementer use of SNOMED CT is not covered by this agreement","compose":{"import":["http://hl7.org/fhir/ValueSet/daf-substance-ndfrt","http://hl7.org/fhir/ValueSet/daf-substance-rxnorm","http://hl7.org/fhir/ValueSet/daf-substance-unii","http://hl7.org/fhir/ValueSet/daf-substance-sct"],"include":[{"system":"http://snomed.info/sct","concept":[{"code":"160244002","display":"No Known Allergies"},{"code":"429625007","display":"No Known Food Allergies"},{"code":"409137002","display":"No Known Drug Allergies"},{"code":"428607008","display":"No Known Environmental Allergy"}]}]}}